#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1F8 (0x4B0 - 0x2B8)
// BlueprintGeneratedClass BP_EnvInteraction.BP_EnvInteraction_C
class ABP_EnvInteraction_C : public AHexEnvInteraction
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2B8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Comp_EnvInteraction_C*             SnowInfluencer;                                    // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Comp_EnvInteraction_C*             FoliageInfluencer;                                 // 0x2C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Comp_EnvInteraction_C*             WaterInfluencer;                                   // 0x2D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                MainCharacter;                                     // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Position;                                          // 0x2E8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_EnvInteraction_InfluencerTrigger_C*> SnowInfluencerTriggers;                            // 0x300(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_EnvInteraction_InfluencerTrigger_C*> WaterInfluencerTriggers;                           // 0x310(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_EnvInteraction_InfluencerTrigger_C*> FoliageInfluencerTriggers;                         // 0x320(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_EnvInteraction_InfluencerTrigger_C*> MudInfluencerTriggers;                             // 0x330(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class UBP_Comp_EnvInteraction_C*>     Influencers;                                       // 0x340(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class ABP_EnvInteraction_SimulationTrigger_C*> ActiveSnowSimulationTriggers;                      // 0x350(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_EnvInteraction_SimulationTrigger_C*> ActiveMudSimulationTriggers;                       // 0x360(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_EnvInteraction_SimulationTrigger_C*> ActiveWaterSimulationTriggers;                     // 0x370(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_EnvInteraction_SimulationTrigger_C*> ActiveFoliageSimulationTriggers;                   // 0x380(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_            NewMainCharacter;                                  // 0x390(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            NewInfluencer;                                     // 0x3A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<enum class EF_EnvInteraction, bool>     SimulationStatus;                                  // 0x3B0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         DebugMode;                                         // 0x400(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3AD9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       CameraWidth;                                       // 0x408(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RTSize;                                            // 0x410(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              SnowDrawingMaterial;                               // 0x418(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              InjectPressureMaterial;                            // 0x420(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              WaterUpdateSimulationMaterial;                     // 0x428(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              InjectFoliageMaterial;                             // 0x430(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              FoliageUpdateSimulationMaterial;                   // 0x438(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              InjectSnowMaterial;                                // 0x440(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              SnowUpdateSimulationMaterial;                      // 0x448(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         EnableSnowOptimization;                            // 0x450(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3ADA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              Inject_Foliage_Height;                             // 0x458(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Foliage_Update_Height_Material;                    // 0x460(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UW_EnvInteraction_C*                   DebugWidget;                                       // 0x468(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         Enable_Debug_Snow;                                 // 0x470(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PaintHeight;                                       // 0x471(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3ADB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AccumulatedDeltaTime;                              // 0x474(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              FoliageClampZValues;                               // 0x478(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Foliage_Copy_Buffer_Material;                      // 0x480(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Foliage_Update_Interpolation_Material;             // 0x488(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         FoliageFrameSwitch;                                // 0x490(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3ADC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               PositionSnow;                                      // 0x498(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_EnvInteraction_C* GetDefaultObj();

	void OnToggleDebugSnow(class APlayerController* CallFunc_GetLocalPlayerController_ReturnValue, class UW_EnvInteraction_C* CallFunc_Create_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void ParticleAffectsWaterSimulation(const struct FHexEnvInteractionParticle& Particle, bool* bAffects, bool bReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class ABP_EnvInteraction_InfluencerTrigger_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_Abs_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, double CallFunc_LessEqual_DoubleDouble_B_ImplicitCast);
	void UpdateFoliage(float DeltaTime, class UCanvas* CallFunc_BeginDrawCanvasToRenderTarget_Canvas, const struct FVector2D& CallFunc_BeginDrawCanvasToRenderTarget_Size, const struct FDrawToRenderTargetContext& CallFunc_BeginDrawCanvasToRenderTarget_Context, class UCanvas* CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1, const struct FVector2D& CallFunc_BeginDrawCanvasToRenderTarget_Size_1, const struct FDrawToRenderTargetContext& CallFunc_BeginDrawCanvasToRenderTarget_Context_1, bool CallFunc_GetSimulationStatus_Value, float CallFunc_Draw_CameraOrthoWidth_ImplicitCast);
	void UpdateWater(float DeltaTime, class UCanvas* CallFunc_BeginDrawCanvasToRenderTarget_Canvas, const struct FVector2D& CallFunc_BeginDrawCanvasToRenderTarget_Size, const struct FDrawToRenderTargetContext& CallFunc_BeginDrawCanvasToRenderTarget_Context, bool CallFunc_GetSimulationStatus_Value, float CallFunc_Draw_CameraOrthoWidth_ImplicitCast);
	void UpdateSnow(float DeltaTime, class UCanvas* CallFunc_BeginDrawCanvasToRenderTarget_Canvas, const struct FVector2D& CallFunc_BeginDrawCanvasToRenderTarget_Size, const struct FDrawToRenderTargetContext& CallFunc_BeginDrawCanvasToRenderTarget_Context, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_GetSimulationStatus_Value, bool CallFunc_IsValid_ReturnValue, float CallFunc_Draw_CameraOrthoWidth_ImplicitCast);
	void UpdateMaterialParameters(double CallFunc_Divide_DoubleDouble_ReturnValue, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_2, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_3, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_Divide_VectorFloat_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, const struct FVector& CallFunc_Divide_VectorFloat_ReturnValue_1, int32 CallFunc_FFloor_ReturnValue, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, float CallFunc_Conv_IntToFloat_ReturnValue, int32 CallFunc_FFloor_ReturnValue_1, int32 CallFunc_FFloor_ReturnValue_2, float CallFunc_Conv_IntToFloat_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue_2, int32 CallFunc_FFloor_ReturnValue_3, int32 CallFunc_FFloor_ReturnValue_4, float CallFunc_Conv_IntToFloat_ReturnValue_3, float CallFunc_Conv_IntToFloat_ReturnValue_4, const struct FVector& CallFunc_MakeVector_ReturnValue_2, int32 CallFunc_FFloor_ReturnValue_5, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_5, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_3, const struct FVector& CallFunc_Divide_VectorVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_4, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Divide_VectorVector_ReturnValue_1, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_5, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_6, double CallFunc_BreakVector_X_2, double CallFunc_BreakVector_Y_2, double CallFunc_BreakVector_Z_2, float CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast, double CallFunc_MakeVector_Z_ImplicitCast, double CallFunc_MakeVector_Z_ImplicitCast_1, double CallFunc_MakeVector_Y_ImplicitCast, double CallFunc_MakeVector_X_ImplicitCast, double CallFunc_MakeVector_Y_ImplicitCast_1, double CallFunc_MakeVector_X_ImplicitCast_1, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);
	void UpdateWaterSimulationParams(class ABP_EnvInteraction_SimulationTrigger_C* Trigger, float CallFunc_SetScalarParameterValue_Value_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast_1);
	void RemoveInfluencerToRender(enum class EF_EnvInteraction Type, class UHexEnvInteractionInfluencerComponent* Influencer, const TArray<class AActor*>& AuxActors, class USceneCaptureComponent2D* LocalCamera, class UHexEnvInteractionSimulationComponent* Temp_object_Variable, class UHexEnvInteractionSimulationComponent* Temp_object_Variable_1, enum class EF_EnvInteraction Temp_byte_Variable, class UHexEnvInteractionSimulationComponent* K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue);
	void AddInfluencerToRender(enum class EF_EnvInteraction Type, class UHexEnvInteractionInfluencerComponent* Influencer, const TArray<class AActor*>& AuxActors, class USceneCaptureComponent2D* LocalCamera, class UHexEnvInteractionSimulationComponent* Temp_object_Variable, class UHexEnvInteractionSimulationComponent* Temp_object_Variable_1, enum class EF_EnvInteraction Temp_byte_Variable, class UHexEnvInteractionSimulationComponent* K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue);
	void RemoveActorToRender(enum class EF_EnvInteraction Type, class AActor* Actor, const TArray<class AActor*>& AuxActors, class USceneCaptureComponent2D* LocalCamera, enum class EF_EnvInteraction Temp_byte_Variable, class USceneCaptureComponent2D* Temp_object_Variable, class USceneCaptureComponent2D* Temp_object_Variable_1, class USceneCaptureComponent2D* Temp_object_Variable_2, class USceneCaptureComponent2D* Temp_object_Variable_3, class USceneCaptureComponent2D* Temp_object_Variable_4, bool CallFunc_Array_RemoveItem_ReturnValue, class USceneCaptureComponent2D* K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue);
	void AddActorToRender(enum class EF_EnvInteraction Type, class AActor* Actor, const TArray<class AActor*>& AuxActors, class USceneCaptureComponent2D* LocalCamera, class USceneCaptureComponent2D* Temp_object_Variable, class USceneCaptureComponent2D* Temp_object_Variable_1, class USceneCaptureComponent2D* Temp_object_Variable_2, class USceneCaptureComponent2D* Temp_object_Variable_3, class USceneCaptureComponent2D* Temp_object_Variable_4, enum class EF_EnvInteraction Temp_byte_Variable, int32 CallFunc_Array_AddUnique_ReturnValue, class USceneCaptureComponent2D* K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue);
	void Check_Simulation(enum class EF_EnvInteraction Type, bool CallFunc_GetSimulationStatus_Value, int32 Temp_int_Array_Index_Variable, TArray<class ABP_EnvInteraction_SimulationTrigger_C*>& Temp_object_Variable, enum class EF_EnvInteraction Temp_byte_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_True_if_break_was_hit_Variable, TArray<class ABP_EnvInteraction_SimulationTrigger_C*>& K2Node_Select_Default, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, bool Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable, TArray<enum class EF_EnvInteraction>& CallFunc_Map_Keys_Keys, enum class EF_EnvInteraction CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, bool Temp_bool_Variable, bool K2Node_SwitchEnum_CmpSuccess_2, bool Temp_bool_IsClosed_Variable, class UBP_Comp_EnvInteraction_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool Temp_bool_Variable_1);
	void GetSimulationStatus(enum class EF_EnvInteraction Type, bool* Value, bool CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void Main_Character_End_Play_Handler(class AActor* Actor, enum class EEndPlayReason EndPlayReason, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	void StopSimulation(enum class EF_EnvInteraction Type, class ABP_EnvInteraction_SimulationTrigger_C* SimulationTrigger, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue_1, bool CallFunc_Array_RemoveItem_ReturnValue_2, bool CallFunc_Array_RemoveItem_ReturnValue_3);
	void StartSimulation(enum class EF_EnvInteraction Type, class ABP_EnvInteraction_SimulationTrigger_C* SimulationTrigger, int32 CallFunc_Array_AddUnique_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_GreaterEqual_IntInt_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue_1, bool CallFunc_GreaterEqual_IntInt_ReturnValue_1, int32 CallFunc_Array_AddUnique_ReturnValue_2, bool CallFunc_GreaterEqual_IntInt_ReturnValue_2, int32 CallFunc_Array_AddUnique_ReturnValue_3, bool CallFunc_GreaterEqual_IntInt_ReturnValue_3);
	void UnRegisterInfluencer(class UBP_Comp_EnvInteraction_C* New_Influencer, bool CallFunc_Array_RemoveItem_ReturnValue);
	void RegisterInfluencer(class UBP_Comp_EnvInteraction_C* New_Influencer, class AActor* CallFunc_GetOwner_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class APawn* K2Node_DynamicCast_AsPawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsPlayerControlled_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue);
	void UnRegisterInfluencerTrigger(class AActor* Trigger, enum class EEndPlayReason EndPlayReason, class ABP_EnvInteraction_InfluencerTrigger_C* ToDelete, class ABP_EnvInteraction_InfluencerTrigger_C* K2Node_DynamicCast_AsBP_Env_Interaction_Influencer_Trigger, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue_1, bool CallFunc_Array_RemoveItem_ReturnValue_2, bool CallFunc_Array_RemoveItem_ReturnValue_3);
	void RegisterInfluencerTrigger(class ABP_EnvInteraction_InfluencerTrigger_C* Trigger, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue_1, int32 CallFunc_Array_AddUnique_ReturnValue_2, int32 CallFunc_Array_AddUnique_ReturnValue_3);
	void ReceiveTick(float DeltaSeconds);
	void StartSnow();
	void StartWater();
	void ReceiveBeginPlay();
	void DebugMessages();
	void StartMud();
	void StartFoliage();
	void StopSnow();
	void StopWater();
	void StopMud();
	void StopFoliage();
	void OnToggleEnvInteraction();
	void ToggleDebug();
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void OnToggleSnowOptimization();
	void AddParticle(struct FHexEnvInteractionParticle& NewParticle, int32 SimulationBitmask);
	void ExecuteUbergraph_BP_EnvInteraction(int32 EntryPoint, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, enum class EF_EnvInteraction Temp_byte_Variable, enum class EF_EnvInteraction Temp_byte_Variable_1, enum class EF_EnvInteraction Temp_byte_Variable_2, class UDeveloperMenuSubsystem* CallFunc_GetEngineSubsystem_ReturnValue, class UDeveloperMenuSubsystem* CallFunc_GetEngineSubsystem_ReturnValue_1, uint8 CallFunc_MakeLiteralByte_ReturnValue, uint8 CallFunc_MakeLiteralByte_ReturnValue_1, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, uint8 CallFunc_MakeLiteralByte_ReturnValue_2, float K2Node_Event_DeltaSeconds, int32 CallFunc_Conv_ByteToInt_ReturnValue_2, bool Temp_bool_Has_Been_Initd_Variable, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_3, const class FString& CallFunc_Conv_IntToString_ReturnValue_2, const class FString& CallFunc_Conv_IntToString_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, const class FString& CallFunc_Conv_IntToString_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, int32 CallFunc_Array_Length_ReturnValue_5, const class FString& CallFunc_Conv_IntToString_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_8, int32 CallFunc_Array_Length_ReturnValue_6, const class FString& CallFunc_Concat_StrStr_ReturnValue_9, const class FString& CallFunc_Conv_IntToString_ReturnValue_6, const class FString& CallFunc_Concat_StrStr_ReturnValue_10, int32 CallFunc_Array_Length_ReturnValue_7, const class FString& CallFunc_Concat_StrStr_ReturnValue_11, const class FString& CallFunc_Conv_IntToString_ReturnValue_7, const class FString& CallFunc_Concat_StrStr_ReturnValue_12, int32 CallFunc_Array_Length_ReturnValue_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_13, const class FString& CallFunc_Conv_IntToString_ReturnValue_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_14, bool CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const class FString& CallFunc_Conv_BoolToString_ReturnValue, bool CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const class FString& CallFunc_Conv_BoolToString_ReturnValue_1, bool CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, const class FString& CallFunc_Conv_BoolToString_ReturnValue_2, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_15, enum class EF_EnvInteraction Temp_byte_Variable_3, const struct FLinearColor& CallFunc_MakeColor_ReturnValue, bool CallFunc_Map_Find_Value_3, bool CallFunc_Map_Find_ReturnValue_3, const class FString& CallFunc_Conv_BoolToString_ReturnValue_3, const struct FLinearColor& CallFunc_MakeColor_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_16, const class FString& CallFunc_Concat_StrStr_ReturnValue_17, const class FString& CallFunc_Concat_StrStr_ReturnValue_18, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const class FString& CallFunc_Concat_StrStr_ReturnValue_19, const class FString& CallFunc_Concat_StrStr_ReturnValue_20, const class FString& CallFunc_Concat_StrStr_ReturnValue_21, const class FString& CallFunc_Concat_StrStr_ReturnValue_22, bool CallFunc_K2_IsTimerActive_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, enum class EEndPlayReason K2Node_Event_EndPlayReason, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_2, const struct FLinearColor& CallFunc_MakeColor_ReturnValue_2, const struct FLinearColor& CallFunc_MakeColor_ReturnValue_3, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_3, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_4, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_5, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_Not_PreBool_ReturnValue, bool Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable, const struct FHexEnvInteractionParticle& K2Node_Event_newParticle, int32 K2Node_Event_simulationBitmask, int32 CallFunc_And_IntInt_ReturnValue, int32 CallFunc_And_IntInt_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, int32 CallFunc_And_IntInt_ReturnValue_2, bool CallFunc_ParticleAffectsWaterSimulation_bAffects, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class ABP_EnvInteraction_SimulationTrigger_C* CallFunc_Array_Get_Item, bool CallFunc_Array_IsValidIndex_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_IsClosed_Variable, bool CallFunc_IsValid_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_7);
	void NewInfluencer__DelegateSignature(class UBP_Comp_EnvInteraction_C* Influencer);
	void NewMainCharacter__DelegateSignature(class AActor* New_Main_Character);
};

}


