#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xC4 (0xC4 - 0x0)
// UserDefinedStruct Style_DGGUI.Style_DGGUI
struct FStyle_DGGUI
{
public:
	struct FLinearColor                          Color_Clear_2_E889F7F34B9A0891B46A1FB2ADE0FCDC;    // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Color_Dark_4_7165FF624E67903543BA289040376AEB;     // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Color_Highlight_Clear_6_10B9C4E444FABBD6A8F4E19282B38A46; // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Color_Highlight_Dark_8_B60AAAB843D527FB74F45CAD6A2A09CF; // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LightStyle_18_4ACB98E64460D30B6818EC924B060BA1;    // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F42[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateFontInfo                        Font_15_D3482B744F13AF1EAF5AE1A57778FBEE;          // 0x48(0x58)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UTexture*                              Move_Icon_25_899AE2A541487B53161E55899E5F09B2;     // 0xA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                              Rotate_Icon_26_98B99D9F425636E499A74C90D2B49A1F;   // 0xA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                              Scale_Icon_27_10F64CD845E8D1B9E9658A98112F8344;    // 0xB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                              Reset_Icon_34_46912A6D47B45BC52CA48D9009686143;    // 0xB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                        DefaultThumbnail_Size_37_BF8F440846F2327AFE2B659B209F047A; // 0xC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


