#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x140 (0x828 - 0x6E8)
// WidgetBlueprintGeneratedClass W_Head_Customization.W_Head_Customization_C
class UW_Head_Customization_C : public UHeadCustomizationScreenWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x6E8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                               Button;                                            // 0x6F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_96;                                         // 0x6F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusableButton_C*                Button_Face;                                       // 0x700(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusableButton_C*                Button_Tattoos;                                    // 0x708(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Button_Text;                                       // 0x710(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Button_Text_1;                                     // 0x718(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Container_ShapeCustomization;                      // 0x720(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          Face_Presets;                                      // 0x728(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShapeSelector_C*                  FacialHair_Selector;                               // 0x730(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShapeSelector_C*                  Hair_Selector;                                     // 0x738(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image;                                             // 0x740(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_1;                                           // 0x748(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_2;                                           // 0x750(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_3;                                           // 0x758(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_4;                                           // 0x760(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_5;                                           // 0x768(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_6;                                           // 0x770(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_7;                                           // 0x778(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_10;                                          // 0x780(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_11;                                          // 0x788(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_12;                                          // 0x790(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_13;                                          // 0x798(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_90;                                          // 0x7A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_412;                                         // 0x7A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shape_Empty_C*                    Shape_Empty;                                       // 0x7B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shape_Face_C*                     Shape_Face;                                        // 0x7B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shape_FacialHair_C*               Shape_FacialHair;                                  // 0x7C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shape_Hair_C*                     Shape_Hair;                                        // 0x7C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shape_SkinColor_C*                Shape_SkinColor;                                   // 0x7D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ColorSelector_C*                  SkinColor_Selector;                                // 0x7D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BottomBarButton_C*                  W_BottomBarButton;                                 // 0x7E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ACameraActor*                          Face_Camera;                                       // 0x7E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ACameraActor*                          Body_Camera;                                       // 0x7F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                Hair_Style;                                        // 0x7F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                FacialHair_Style;                                  // 0x808(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         Is_Armor_Visible;                                  // 0x818(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Warning_Popup_Visible;                             // 0x819(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3E0F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUserWidget*                           ShapeWidget;                                       // 0x820(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UW_Head_Customization_C* GetDefaultObj();

	class UWidget* Select_Left_from_Right(enum class EUINavigation Navigation, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UUserWidget* CallFunc_OnSwitchHeadColumn_ReturnValue, enum class ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	class UWidget* Select_Center_From_Right(enum class EUINavigation Navigation, class UUserWidget* CallFunc_OnSwitchHeadColumn_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, enum class ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	class UWidget* Select_Right_from_Center(enum class EUINavigation Navigation, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UUserWidget* CallFunc_OnSwitchHeadColumn_ReturnValue, enum class ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	class UWidget* Select_Left_From_Center(enum class EUINavigation Navigation, class UUserWidget* CallFunc_OnSwitchHeadColumn_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, enum class ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	class UWidget* Select_Right_From_Left(enum class EUINavigation Navigation, class UUserWidget* CallFunc_OnSwitchHeadColumn_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, enum class ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	class UWidget* Select_Center_From_Left(enum class EUINavigation Navigation, class UUserWidget* CallFunc_OnSwitchHeadColumn_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, enum class ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	class UWidget* Select_Age(enum class EUINavigation Navigation);
	class UWidget* Select_Skin_Color(enum class EUINavigation Navigation);
	class UWidget* Select_Facial_Hair(enum class EUINavigation Navigation);
	class UWidget* Select_Hair(enum class EUINavigation Navigation);
	void Show_Details_Panel(class UUserWidget* Selector_Button, class UShapeCategoryWidget* Panel_Widget);
	void Set_Shape_Visibility(enum class ESlateVisibility Visibility);
	void Update_Icon(class UInputActionImage* Input_Image, const struct FGameplayTag& CallFunc_GetInputAction_ReturnValue, class UTexture2D* CallFunc_GetControllerIconByEventName_ReturnValue);
	class UWidget* GetDesiredFocusTarget(bool CallFunc_IsValid_ReturnValue);
	void OnCinematicEnd();
	void BP_PanelActivated();
	void BP_PanelDeactivated();
	void OnRequestEditHead(enum class ECustomizationCategory Category, bool bShowPanel);
	void BndEvt__WBP_Head_Customization_General_HeadShape_K2Node_ComponentBoundEvent_2_OnRequestEditHead__DelegateSignature();
	void BndEvt__WBP_Head_Customization_Root_Button_K2Node_ComponentBoundEvent_18_OnButtonClick__DelegateSignature();
	void BndEvt__WBP_Head_Customization_W_BottomBarButton_K2Node_ComponentBoundEvent_19_OnButtonActionComplete__DelegateSignature();
	void BP_RandomizeCharacter();
	void BndEvt__W_Head_Customization_FacialHair_Selector_K2Node_ComponentBoundEvent_1_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void BndEvt__W_Head_Customization_Hair_Selector_K2Node_ComponentBoundEvent_21_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void BP_StopShapeCustomization();
	void BndEvt__W_Head_Customization_General_HeadShape_K2Node_ComponentBoundEvent_3_OnRequestChangeHeadPreset__DelegateSignature(enum class EHeadPresetLocation Location);
	void BndEvt__W_Head_Customization_Button_Face_K2Node_ComponentBoundEvent_0_OnButtonClick__DelegateSignature();
	void On_HeadPreset_Clicked(class UObject* Item, class UHexListView* List);
	void On_HeadPreset_Hovered(class UObject* Item, bool Is_Hovered, class UHexListView* List);
	void BndEvt__W_Head_Customization_Presets_Head_Left_K2Node_ComponentBoundEvent_4_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__W_Head_Customization_Presets_Head_Left_K2Node_ComponentBoundEvent_6_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__W_Head_Customization_Presets_Head_Top_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__W_Head_Customization_Presets_Head_Top_K2Node_ComponentBoundEvent_8_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__W_Head_Customization_Presets_Head_Right_K2Node_ComponentBoundEvent_9_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__W_Head_Customization_Presets_Head_Right_K2Node_ComponentBoundEvent_10_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__W_Head_Customization_Presets_Head_Left_K2Node_ComponentBoundEvent_5_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void On_ItemSelection_Change(class UObject* Item, bool Is_Selected, class UHexListView* List);
	void BndEvt__W_Head_Customization_Presets_Head_Top_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__W_Head_Customization_Presets_Head_Right_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__W_Head_Customization_SkinColor_Selector_K2Node_ComponentBoundEvent_0_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void ExecuteUbergraph_W_Head_Customization(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class APawn* CallFunc_GetPlayerPawn_ReturnValue, class ALOTF2Character* K2Node_DynamicCast_AsLOTF2Character, bool K2Node_DynamicCast_bSuccess, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, class ALOTF2Character* K2Node_DynamicCast_AsLOTF2Character_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsArmorSlotVisible_ReturnValue, enum class ECustomizationCategory K2Node_Event_category, bool K2Node_Event_bShowPanel, int32 CallFunc_PostEventAtLocation_ReturnValue, int32 CallFunc_PostEventAtLocation_ReturnValue_1, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category_2, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category_1, bool CallFunc_IsValid_ReturnValue, enum class EHeadPresetLocation K2Node_ComponentBoundEvent_location, class UObject* K2Node_CustomEvent_Item_2, class UHexListView* K2Node_CustomEvent_List_2, int32 CallFunc_PostEventAtLocation_ReturnValue_2, TArray<class UObject*>& CallFunc_GetListItems_ReturnValue, class UUserWidget* CallFunc_GetWidgetFromItem_ReturnValue, class UObject* CallFunc_Array_Get_Item, class UW_HeadPresetWidget_list_C* K2Node_DynamicCast_AsW_Head_Preset_Widget_List, bool K2Node_DynamicCast_bSuccess_2, class UUserWidget* CallFunc_GetWidgetFromItem_ReturnValue_1, class UW_HeadPresetWidget_list_C* K2Node_DynamicCast_AsW_Head_Preset_Widget_List_1, bool K2Node_DynamicCast_bSuccess_3, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class UObject* K2Node_CustomEvent_Item_1, bool K2Node_CustomEvent_Is_Hovered, class UHexListView* K2Node_CustomEvent_List_1, class UObject* K2Node_ComponentBoundEvent_Item_8, class UUserWidget* CallFunc_GetWidgetFromItem_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_1, class UW_HeadPresetWidget_list_C* K2Node_DynamicCast_AsW_Head_Preset_Widget_List_2, bool K2Node_DynamicCast_bSuccess_4, class UObject* K2Node_ComponentBoundEvent_Item_7, bool K2Node_ComponentBoundEvent_bIsHovered_2, class UObject* K2Node_ComponentBoundEvent_Item_6, class UObject* K2Node_ComponentBoundEvent_Item_5, bool K2Node_ComponentBoundEvent_bIsHovered_1, class UObject* K2Node_ComponentBoundEvent_Item_4, class UObject* K2Node_ComponentBoundEvent_Item_3, bool K2Node_ComponentBoundEvent_bIsHovered, class UObject* K2Node_ComponentBoundEvent_Item_2, bool K2Node_ComponentBoundEvent_bIsSelected_2, class UObject* K2Node_CustomEvent_Item, bool K2Node_CustomEvent_Is_Selected, class UHexListView* K2Node_CustomEvent_List, class UUserWidget* CallFunc_GetWidgetFromItem_ReturnValue_3, class UW_HeadPresetWidget_list_C* K2Node_DynamicCast_AsW_Head_Preset_Widget_List_3, bool K2Node_DynamicCast_bSuccess_5, class UObject* K2Node_ComponentBoundEvent_Item_1, bool K2Node_ComponentBoundEvent_bIsSelected_1, class UObject* K2Node_ComponentBoundEvent_Item, bool K2Node_ComponentBoundEvent_bIsSelected, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category);
};

}


