#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x30 (0x2D0 - 0x2A0)
// Class LOTF2.AbilitySystemActor
class AAbilitySystemActor : public AActor
{
public:
	uint8                                        Pad_252B[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x2B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilitySystemComponent*               ExternalAbilitySystemComponent;                    // 0x2C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGenericTeamId                        CachedTeamId;                                      // 0x2C8(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_252C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAbilitySystemActor* GetDefaultObj();

};

// 0x8 (0x118 - 0x110)
// Class LOTF2.AbilityTask_DynamicKnockback
class UAbilityTask_DynamicKnockback : public UAbilityTask_ApplyRootMotionConstantForce
{
public:
	float                                        KnockbackWaitTime;                                 // 0x110(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_252F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_DynamicKnockback* GetDefaultObj();

	class UAbilityTask_DynamicKnockback* ApplyDynamicKnockbackForce(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& KnockbackWorldDirection, float KnockbackAmountInCM, float KnockbackWait, float KnockbackDuration, class UCurveFloat* StrengthOverTimeCurve);
};

// 0x58 (0xD8 - 0x80)
// Class LOTF2.AbilityTask_HexAIMoveFacingTarget
class UAbilityTask_HexAIMoveFacingTarget : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2532[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                TargetActor;                                       // 0xA8(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2533[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          MontageToUse;                                      // 0xC0(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2534[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_HexAIMoveFacingTarget* GetDefaultObj();

	class UAbilityTask_HexAIMoveFacingTarget* CreateMoveFacingTargetTask(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& MoveDirectionRelativeToTarget, class AActor* TargetActor, float MoveAngle, float DistanceToReachNear, float DistanceToReachFar, class UAnimMontage* MontageToUse, bool bStopMontageWhenTaskEnds, bool bOrientTowardsMovement);
};

// 0x30 (0xB0 - 0x80)
// Class LOTF2.AbilityTask_HexWaitDirectionalDistanceAround
class UAbilityTask_HexWaitDirectionalDistanceAround : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        DirectionToCheck;                                  // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseDefaultObstacleMask;                           // 0x94(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2547[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ObstaclesToConsider;                               // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EDirectionValidationMode          DirectionValidationMode;                           // 0x9C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EDirectionCheckMode               DirectionCheckMode;                                // 0x9D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2548[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DistanceToCheck_Meters;                            // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MovementTimeToCheck_Seconds;                       // 0xA4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseWalkingSpeed;                                  // 0xA8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bEnableVisLogDebug;                                // 0xA9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2549[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_HexWaitDirectionalDistanceAround* GetDefaultObj();

	bool HasDirectionalDistanceAround();
	class UAbilityTask_HexWaitDirectionalDistanceAround* CreateWaitNotEnoughDirectionalDistanceAround(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, float DistanceToCheck_Meters, enum class EDirectionValidationMode DirectionValidationMode, enum class EDirectionCheckMode DirectionCheckMode, int32 ObstaclesToConsider, bool bUseDefaultObstacleMask, int32 DirectionToCheck, bool bUseWalkingSpeed, float MovementTimeToCheck_Seconds, bool bEnableVisLogDebug);
	class UAbilityTask_HexWaitDirectionalDistanceAround* CreateWaitDirectionalDistanceAround(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, float DistanceToCheck_Meters, enum class EDirectionValidationMode DirectionValidationMode, enum class EDirectionCheckMode DirectionCheckMode, int32 ObstaclesToConsider, bool bUseDefaultObstacleMask, int32 DirectionToCheck, bool bUseWalkingSpeed, float MovementTimeToCheck_Seconds, bool bEnableVisLogDebug);
};

// 0x58 (0xD8 - 0x80)
// Class LOTF2.AbilityTask_HexWaitFacingTarget
class UAbilityTask_HexWaitFacingTarget : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EHexTurnToTargetMode              TurnMode;                                          // 0x90(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2553[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                TargetActor;                                       // 0x98(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               TargetLocation;                                    // 0xA0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               TargetDirection;                                   // 0xB8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        JudgeAngle;                                        // 0xD0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2554[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_HexWaitFacingTarget* GetDefaultObj();

	class UAbilityTask_HexWaitFacingTarget* CreateWaitFacingTargetTaskLocation(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& TargetLocation, float JudgeAngle);
	class UAbilityTask_HexWaitFacingTarget* CreateWaitFacingTargetTaskDirection(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& TargetDirection, float JudgeAngle);
	class UAbilityTask_HexWaitFacingTarget* CreateWaitFacingTargetTask(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class AActor* TargetActor, float JudgeAngle);
};

// 0x30 (0xB0 - 0x80)
// Class LOTF2.AbilityTask_HexWaitGameplayTags
class UAbilityTask_HexWaitGameplayTags : public UAbilityTask
{
public:
	uint8                                        Pad_2559[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAbilitySystemComponent*               OptionalExternalTarget;                            // 0xA0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_255A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_HexWaitGameplayTags* GetDefaultObj();

	void GameplayTagCallback(const struct FGameplayTag& Tag, int32 NewCount);
};

// 0x10 (0xC0 - 0xB0)
// Class LOTF2.AbilityTask_HexWaitGameplayTagsAdded
class UAbilityTask_HexWaitGameplayTagsAdded : public UAbilityTask_HexWaitGameplayTags
{
public:
	FMulticastInlineDelegateProperty_            Added;                                             // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAbilityTask_HexWaitGameplayTagsAdded* GetDefaultObj();

	class UAbilityTask_HexWaitGameplayTagsAdded* WaitGameplayTagsAdd(class UGameplayAbility* OwningAbility, const struct FGameplayTagContainer& Tags, class AActor* InOptionalExternalTarget, bool bOnlyTriggerOnce);
};

// 0x18 (0xC8 - 0xB0)
// Class LOTF2.AbilityTask_HexWaitGameplayTagsRemoved
class UAbilityTask_HexWaitGameplayTagsRemoved : public UAbilityTask_HexWaitGameplayTags
{
public:
	FMulticastInlineDelegateProperty_            Removed;                                           // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2567[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_HexWaitGameplayTagsRemoved* GetDefaultObj();

	class UAbilityTask_HexWaitGameplayTagsRemoved* WaitGameplayTagsRemove(class UGameplayAbility* OwningAbility, const struct FGameplayTagContainer& Tags, class AActor* InOptionalExternalTarget, bool bOnlyTriggerOnce, bool bSendRemovedEventForNotPresentTagsOnActivated);
};

// 0x20 (0xA0 - 0x80)
// Class LOTF2.AbilityTask_HexWaitReachTarget
class UAbilityTask_HexWaitReachTarget : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x90(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceToReach;                                   // 0x98(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_256D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_HexWaitReachTarget* GetDefaultObj();

	class UAbilityTask_HexWaitReachTarget* CreateWaitReachTargetTask(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class AActor* TargetActor, float NewDistanceToReach);
};

// 0x50 (0xD0 - 0x80)
// Class LOTF2.AbilityTask_RepositionActor
class UAbilityTask_RepositionActor : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnRepositionActorCompleted;                        // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2579[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ALOTF2Character*                       Character;                                         // 0xC8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAbilityTask_RepositionActor* GetDefaultObj();

	class UAbilityTask_RepositionActor* RepositionActor(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& Location, const struct FRotator& Rotation, float InterpolationTime, bool bShouldEaseIn, bool bShouldEaseOut, bool bShouldForceShortestPath);
	void OnMoveComponentToCompleted();
};

// 0x18 (0x98 - 0x80)
// Class LOTF2.AbilityTask_Tick
class UAbilityTask_Tick : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnTick;                                            // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_257D[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_Tick* GetDefaultObj();

	class UAbilityTask_Tick* CreateTickTask(class UGameplayAbility* OwningAbility, class FName TaskInstanceName);
};

// 0x50 (0xD0 - 0x80)
// Class LOTF2.AbilityTask_Timeline
class UAbilityTask_Timeline : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnTimelineTick;                                    // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTimelineEnd;                                     // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2584[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_Timeline* GetDefaultObj();

	class UAbilityTask_Timeline* AbilityTask_Timeline(class UGameplayAbility* OwningAbility, class UCurveFloat* Curve, class UCurveFloat* Curve2, class UCurveFloat* Curve3, class UCurveFloat* Curve4, bool bPlayReversed);
};

// 0x20 (0xA0 - 0x80)
// Class LOTF2.AbilityTask_TurnTowardsTarget
class UAbilityTask_TurnTowardsTarget : public UAbilityTask
{
public:
	class AActor*                                TargetActor;                                       // 0x80(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               TargetLocation;                                    // 0x88(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAbilityTask_TurnTowardsTarget* GetDefaultObj();

	class UAbilityTask_TurnTowardsTarget* CreateTurnTowardsTargetLocationTask(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& TargetLocation);
	class UAbilityTask_TurnTowardsTarget* CreateTurnTowardsTargetActorTask(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class AActor* TargetActor);
};

// 0x18 (0x98 - 0x80)
// Class LOTF2.AbilityTask_WaitCustomNetworkedEvent
class UAbilityTask_WaitCustomNetworkedEvent : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnEvent;                                           // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2592[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitCustomNetworkedEvent* GetDefaultObj();

	class UAbilityTask_WaitCustomNetworkedEvent* WaitCustomEvent(class UGameplayAbility* OwningAbility, enum class EAbilityGenericReplicatedEvent Event, bool bOnlyTriggerOnce);
	void TriggerEvent();
};

// 0x10 (0x90 - 0x80)
// Class LOTF2.AbilityTask_WaitDelayOneFrame
class UAbilityTask_WaitDelayOneFrame : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnFinish;                                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAbilityTask_WaitDelayOneFrame* GetDefaultObj();

	class UAbilityTask_WaitDelayOneFrame* WaitDelayOneFrame(class UGameplayAbility* OwningAbility);
};

// 0x38 (0xB8 - 0x80)
// Class LOTF2.AbilityTask_WaitDelayWithProgress
class UAbilityTask_WaitDelayWithProgress : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnFinish;                                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnProgressChanged;                                 // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2594[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitDelayWithProgress* GetDefaultObj();

	class UAbilityTask_WaitDelayWithProgress* WaitDelayWithProgress(class UGameplayAbility* OwningAbility, float Time);
};

// 0x18 (0x98 - 0x80)
// Class LOTF2.AbilityTask_WaitForVelocityLower
class UAbilityTask_WaitForVelocityLower : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnVelocityIsLowerThanThreshold;                    // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2596[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitForVelocityLower* GetDefaultObj();

	class UAbilityTask_WaitForVelocityLower* WaitForVelocityLowerThanThreshold(class UGameplayAbility* OwningAbility, float PercentageOfCurrentMaxSpeedThreshold);
};

// 0x18 (0xC0 - 0xA8)
// Class LOTF2.AbilityTask_WaitGameplayTagChanged
class UAbilityTask_WaitGameplayTagChanged : public UAbilityTask_WaitGameplayTag
{
public:
	FMulticastInlineDelegateProperty_            OnChanged;                                         // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2597[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitGameplayTagChanged* GetDefaultObj();

	class UAbilityTask_WaitGameplayTagChanged* WaitGameplayTagChanged(class UGameplayAbility* OwningAbility, const struct FGameplayTag& Tag, class AActor* InOptionalExternalTarget);
};

// 0x80 (0x100 - 0x80)
// Class LOTF2.AbilityTask_WaitInputAction
class UAbilityTask_WaitInputAction : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            InputEventReceived;                                // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UInputAction*                          InputActionToWait;                                 // 0x90(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_259A[0x68];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitInputAction* GetDefaultObj();

	class UAbilityTask_WaitInputAction* WaitInputActionEx(class UGameplayAbility* OwningAbility, class UInputAction* InputAction, TSet<enum class ETriggerEvent> TriggerEvents, bool OnlyTriggerOnce);
	class UAbilityTask_WaitInputAction* WaitInputAction(class UGameplayAbility* OwningAbility, class UInputAction* InputAction, enum class ETriggerEvent TriggerEvent, bool OnlyTriggerOnce);
	void OnInputActionEvent(struct FInputActionInstance& InputActionInstance);
};

// 0x28 (0xA8 - 0x80)
// Class LOTF2.AbilityTask_WaitInputAction_Replicated
class UAbilityTask_WaitInputAction_Replicated : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            InputEventReceived;                                // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UInputAction*                          InputActionToWait;                                 // 0x90(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_259C[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitInputAction_Replicated* GetDefaultObj();

	class UAbilityTask_WaitInputAction_Replicated* WaitInputAction(class UGameplayAbility* OwningAbility, class UInputAction* InputAction, enum class ETriggerEvent TriggerEvent, bool OnlyTriggerOnce);
	void OnInputActionReceivedCallback();
	void OnInputActionEvent(struct FInputActionInstance& InputActionInstance);
};

// 0x40 (0x68 - 0x28)
// Class LOTF2.AchievementOnlineInterface
class UAchievementOnlineInterface : public UObject
{
public:
	uint8                                        Pad_259D[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAchievementOnlineInterface* GetDefaultObj();

};

// 0xD0 (0x100 - 0x30)
// Class LOTF2.AchievementSubsystem
class UAchievementSubsystem : public UGameInstanceSubsystem
{
public:
	uint8                                        Pad_259E[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAchievementOnlineInterface*           OnlineInterface;                                   // 0x48(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAchievementSubsystemConfig           AchievementSubsystemConfig;                        // 0x50(0x8)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UAchievementTracker*> Trackers;                                          // 0x58(0x50)(Protected, NativeAccessSpecifierProtected)
	class UAchievementTrackerFactory*            TrackerFactory;                                    // 0xA8(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, float>                     TrackerProgress;                                   // 0xB0(0x50)(SaveGame, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAchievementSubsystem* GetDefaultObj();

};

// 0xB8 (0xE0 - 0x28)
// Class LOTF2.AchievementTracker
class UAchievementTracker : public UObject
{
public:
	uint8                                        Pad_259F[0xB8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAchievementTracker* GetDefaultObj();

};

// 0x0 (0xE0 - 0xE0)
// Class LOTF2.AchievementTrackerAllAchievement
class UAchievementTrackerAllAchievement : public UAchievementTracker
{
public:

	static class UClass* StaticClass();
	static class UAchievementTrackerAllAchievement* GetDefaultObj();

};

// 0x0 (0xE0 - 0xE0)
// Class LOTF2.AchievementTrackerCoopBossKill
class UAchievementTrackerCoopBossKill : public UAchievementTracker
{
public:

	static class UClass* StaticClass();
	static class UAchievementTrackerCoopBossKill* GetDefaultObj();

};

// 0x0 (0xE0 - 0xE0)
// Class LOTF2.AchievementTrackerDonateCoin
class UAchievementTrackerDonateCoin : public UAchievementTracker
{
public:

	static class UClass* StaticClass();
	static class UAchievementTrackerDonateCoin* GetDefaultObj();

};

// 0x50 (0x78 - 0x28)
// Class LOTF2.AchievementTrackerFactory
class UAchievementTrackerFactory : public UObject
{
public:
	TMap<enum class EAchievementTrackerType, TSubclassOf<class UAchievementTracker>> AchievementTrackerClassOfType;                     // 0x28(0x50)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAchievementTrackerFactory* GetDefaultObj();

};

// 0x0 (0xE0 - 0xE0)
// Class LOTF2.AchievementTrackerPvpKill
class UAchievementTrackerPvpKill : public UAchievementTracker
{
public:

	static class UClass* StaticClass();
	static class UAchievementTrackerPvpKill* GetDefaultObj();

};

// 0x8 (0xE8 - 0xE0)
// Class LOTF2.AchievementTrackerQuest
class UAchievementTrackerQuest : public UAchievementTracker
{
public:
	class UQuest*                                Quest;                                             // 0xE0(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAchievementTrackerQuest* GetDefaultObj();

	void UnbindQuest();
	void OnQuestStatusChanged(class UQuest* Quest);
	void BindQuest();
};

// 0x0 (0xE0 - 0xE0)
// Class LOTF2.AchievementTrackerSummonCoop
class UAchievementTrackerSummonCoop : public UAchievementTracker
{
public:

	static class UClass* StaticClass();
	static class UAchievementTrackerSummonCoop* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class LOTF2.ActionsContext
class UActionsContext : public UObject
{
public:
	class UInputMappingContext*                  InputMappingContext;                               // 0x28(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FInputActionGameplayEventMapping> InputActions;                                      // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FComboInputsMapping>           ComboInputs;                                       // 0x40(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UActionsContext* GetDefaultObj();

};

// 0x40 (0x70 - 0x30)
// Class LOTF2.ActivitySubsystem
class UActivitySubsystem : public UGameInstanceSubsystem
{
public:
	class UActivitySubsystemConfig*              ActivitySubsystemConfig;                           // 0x30(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25A0[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActivitySubsystem* GetDefaultObj();

	void OnGameFinished();
};

// 0x20 (0x50 - 0x30)
// Class LOTF2.ActivitySubsystemConfig
class UActivitySubsystemConfig : public UDataAsset
{
public:
	class FString                                ResumeGameActivityId;                              // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                        PresenceActivityIds;                               // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActivitySubsystemConfig* GetDefaultObj();

};

// 0x8 (0xB8 - 0xB0)
// Class LOTF2.ActorCollisionReplicationComponent
class UActorCollisionReplicationComponent : public UActorComponent
{
public:
	bool                                         bActorEnableCollision;                             // 0xB0(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25A1[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActorCollisionReplicationComponent* GetDefaultObj();

	void OnRep_ActorEnableCollision();
};

// 0x0 (0x28 - 0x28)
// Class LOTF2.ActorRedirectInterface
class IActorRedirectInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IActorRedirectInterface* GetDefaultObj();

	class AActor* GetActorRedirect();
};

// 0x18 (0x2B8 - 0x2A0)
// Class LOTF2.LOTF2UserWidget
class ULOTF2UserWidget : public UCommonUserWidget
{
public:
	class UEventNameBasedControllerIcons*        EventNameBasedControllerIconsClass;                // 0x2A0(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25A2[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ULOTF2UserWidget* GetDefaultObj();

	void UpdateControllerIcons(enum class ECommonInputType NewInputMethod);
	void OnInputMethodChanged(enum class ECommonInputType NewInputMethod);
	void ListenForAxisEvent(class FName Axis, FDelegateProperty_ Func);
	class APlayerCharacterController* GetOwningPlayerCharacterController();
	class UTexture2D* GetControllerIconByEventName(struct FGameplayTag& Action);
};

// 0x18 (0x2D0 - 0x2B8)
// Class LOTF2.ActorWidget
class UActorWidget : public ULOTF2UserWidget
{
public:
	class AActor*                                OwningActor;                                       // 0x2B8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnOwningActorChanged;                              // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActorWidget* GetDefaultObj();

	void SetOwningActor(class AActor* NewOwner);
};

// 0x10 (0x6D0 - 0x6C0)
// Class LOTF2.ActorWidgetComponent
class UActorWidgetComponent : public UWidgetComponent
{
public:
	bool                                         bShouldClampWidgetInsideViewport;                  // 0x6C0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25A3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       OffsetFromBorder;                                  // 0x6C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActorWidgetComponent* GetDefaultObj();

};

// 0x30 (0xE0 - 0xB0)
// Class LOTF2.AdaptiveTriggerComponent
class UAdaptiveTriggerComponent : public UActorComponent
{
public:
	struct FGameplayTagContainer                 DisabledByTags;                                    // 0xB0(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          MeleeChargingTag;                                  // 0xD0(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RangedFullyChargedTag;                             // 0xD8(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAdaptiveTriggerComponent* GetDefaultObj();

	void OnRangedStanceChanged(enum class ERangedStance OldRangedStance, enum class ERangedStance NewRangedStance);
};

// 0x30 (0xE0 - 0xB0)
// Class LOTF2.HexApplySpawnConfigComponent
class UHexApplySpawnConfigComponent : public UActorComponent
{
public:
	uint8                                        Pad_25A4[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UHexApplySpawnConfigComponent* GetDefaultObj();

};

// 0x28 (0x108 - 0xE0)
// Class LOTF2.AddInventoryItemPostSpawn
class UAddInventoryItemPostSpawn : public UHexApplySpawnConfigComponent
{
public:
	TArray<TSoftClassPtr<class UItemData>>       Items;                                             // 0xE0(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25A5[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ALOTF2Character*                       TargetCharacter;                                   // 0x100(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAddInventoryItemPostSpawn* GetDefaultObj();

	void OnItemDataLoaded();
};

// 0x70 (0x120 - 0xB0)
// Class LOTF2.AggroComponent
class UAggroComponent : public UActorComponent
{
public:
	TSubclassOf<class UGameplayEffect>           AggroGE;                                           // 0xB0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAkAnathemaEvent                      AggroAkEvent;                                      // 0xB8(0x50)(Edit, NativeAccessSpecifierPublic)
	class UHexStateTreeComponent*                StateTreeComponent;                                // 0x108(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ABaseAIController*                     OwnerController;                                   // 0x110(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*               CurrentTargetASC;                                  // 0x118(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAggroComponent* GetDefaultObj();

	void OnStateBegin(struct FGameplayTagContainer& StateChangePayload, class UHexStateTreeComponent* OwnerStateTreeComponent);
	void HandleDeath(class AActor* InstigatorActor, struct FGameplayTagContainer& InstigatorTags, bool bDeathWasObserved);
	struct FAkAnathemaEvent GetAggroAkEvent();
};

// 0xA8 (0xD0 - 0x28)
// Class LOTF2.CharacterAction
class UCharacterAction : public UObject
{
public:
	uint8                                        Pad_25A7[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnActionInterruptTagReceivedAndNoWaitingActions;   // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_25A8[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActionName;                                        // 0x58(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          InterruptTypeTag;                                  // 0x60(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldInteruptOthers;                             // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanBeInterruptedByOthers;                         // 0x69(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAbortOnFailure;                                   // 0x6A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25A9[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Timeout;                                           // 0x6C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25AA[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ActionPriority;                                    // 0x7C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25AB[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          TimeoutTimerHandle;                                // 0x88(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABaseAIController*                     AIController;                                      // 0x90(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABaseAICharacter*                      Character;                                         // 0x98(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25AC[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCharacterAction* GetDefaultObj();

	void OnTimeout();
	bool IsComplete();
	bool HasFailed();
	struct FGameplayTag GetActionType();
	enum class EeAnathemaAIActionState GetActionState();
	class FName GetActionName();
	void EndAction(bool bSuccess);
	void BP_UpdateAction(float DeltaTime);
	void BP_RunSetup();
	void BP_EndAction(bool bWasSuccessfull);
	void BP_BeginAction();
};

// 0x0 (0xD0 - 0xD0)
// Class LOTF2.AIActionApproachFlex
class UAIActionApproachFlex : public UCharacterAction
{
public:

	static class UClass* StaticClass();
	static class UAIActionApproachFlex* GetDefaultObj();

};

// 0x28 (0xF8 - 0xD0)
// Class LOTF2.AIActionMovementBase
class UAIActionMovementBase : public UCharacterAction
{
public:
	uint8                                        Pad_25AD[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionMovementBase* GetDefaultObj();

};

// 0x28 (0x120 - 0xF8)
// Class LOTF2.AIActionApproachPlayer
class UAIActionApproachPlayer : public UAIActionMovementBase
{
public:
	float                                        DesiredDistance;                                   // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldRun;                                        // 0xFC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldGuard;                                      // 0xFD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsePathfinding;                                   // 0xFE(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreCharacterCapsuleRadius;                     // 0xFF(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAITask_MoveTo*                        PMoveToAITask;                                     // 0x100(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                          PMovementMontage;                                  // 0x108(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25AF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeToFullRotation;                                // 0x118(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25B0[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionApproachPlayer* GetDefaultObj();

	class UAIActionApproachPlayer* AIActionApproachPlayer(class UObject* WorldContextObject, float NewTimeout, float NewDesiredDistance, bool ShouldRun);
};

// 0x48 (0x118 - 0xD0)
// Class LOTF2.AIActionPlayMontage
class UAIActionPlayMontage : public UCharacterAction
{
public:
	uint8                                        Pad_25B5[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          M_pMontage;                                        // 0xF0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AnimationTag;                                      // 0xF8(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseGameplayAbilities;                             // 0x100(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25B6[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bUseDistanceAbortCondition;                        // 0x102(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25B7[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AbortDistance;                                     // 0x104(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseAngleAbortCondition;                           // 0x108(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25B8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AbortAngle;                                        // 0x10C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseStaminaAbortCondition;                         // 0x110(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25B9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AbortStaminaRate;                                  // 0x114(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIActionPlayMontage* GetDefaultObj();

	void OnMontageEnded(class UAnimMontage* AnimMontage, bool bInterrupted);
	void OnMontageBlendOut(class UAnimMontage* AnimMontage, bool bInterrupted);
	class UAIActionPlayMontage* AIActionPlayMontage(class UObject* WorldContextObject, const struct FGameplayTag& InterruptTag, float NewTimeout, class UAnimMontage* NewMontage, bool bNewInterrupt);
};

// 0x0 (0x118 - 0x118)
// Class LOTF2.AIActionAttackBase
class UAIActionAttackBase : public UAIActionPlayMontage
{
public:

	static class UClass* StaticClass();
	static class UAIActionAttackBase* GetDefaultObj();

};

// 0x0 (0x118 - 0x118)
// Class LOTF2.AIActionAttack
class UAIActionAttack : public UAIActionAttackBase
{
public:

	static class UClass* StaticClass();
	static class UAIActionAttack* GetDefaultObj();

};

// 0x0 (0x118 - 0x118)
// Class LOTF2.AIActionCombo
class UAIActionCombo : public UAIActionPlayMontage
{
public:

	static class UClass* StaticClass();
	static class UAIActionCombo* GetDefaultObj();

};

// 0x0 (0x118 - 0x118)
// Class LOTF2.AIActionDodge
class UAIActionDodge : public UAIActionPlayMontage
{
public:

	static class UClass* StaticClass();
	static class UAIActionDodge* GetDefaultObj();

};

// 0x0 (0x118 - 0x118)
// Class LOTF2.AIActionEndure
class UAIActionEndure : public UAIActionPlayMontage
{
public:

	static class UClass* StaticClass();
	static class UAIActionEndure* GetDefaultObj();

};

// 0x10 (0x108 - 0xF8)
// Class LOTF2.AIActionInvestigate
class UAIActionInvestigate : public UAIActionMovementBase
{
public:
	float                                        DesiredDistance;                                   // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldRun;                                        // 0xFC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25BB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAITask_MoveTo*                        PMoveToAITask;                                     // 0x100(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAIActionInvestigate* GetDefaultObj();

	void OnMoveRequestFailed();
	void OnMoveFinished(enum class EPathFollowingResult Result, class AAIController* PAIController);
};

// 0x8 (0x100 - 0xF8)
// Class LOTF2.AIActionLeavePlayer
class UAIActionLeavePlayer : public UAIActionMovementBase
{
public:
	float                                        DesiredDistance;                                   // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldGuard;                                      // 0xFC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldRun;                                        // 0xFD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25BC[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionLeavePlayer* GetDefaultObj();

	class UAIActionLeavePlayer* AIActionLeavePlayer(class UObject* WorldContextObject, float NewTimeout, float NewDesiredDistance);
};

// 0x28 (0xD8 - 0xB0)
// Class LOTF2.AIActionManager
class UAIActionManager : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnAllActionsFinished;                              // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_25BD[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCharacterAction*                      ActiveAction;                                      // 0xC8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25BE[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionManager* GetDefaultObj();

	void OnActionFinished(enum class EeAnathemaAIActionState ActionState);
	void AddActionByClass(TSubclassOf<class UCharacterAction> PAction);
	void AddAction(class UCharacterAction* PAction);
	void AbortAllActions();
};

// 0x8 (0x100 - 0xF8)
// Class LOTF2.AIActionMoveSideways
class UAIActionMoveSideways : public UAIActionMovementBase
{
public:
	bool                                         bMoveRight;                                        // 0xF8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldGuard;                                      // 0xF9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25C0[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Angle;                                             // 0xFC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIActionMoveSideways* GetDefaultObj();

	class UAIActionMoveSideways* AIActionMoveSideways(class UObject* WorldContextObject, float NewTimeout, bool ShouldMoveRight);
};

// 0x8 (0xD8 - 0xD0)
// Class LOTF2.AIActionSwitchContext
class UAIActionSwitchContext : public UCharacterAction
{
public:
	enum class EeAIContextType                   NewContextType;                                    // 0xD0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSetAsNewMainContext;                              // 0xD1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25C2[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionSwitchContext* GetDefaultObj();

	class UAIActionSwitchContext* AIActionSwitchContext(class UObject* WorldContextObject, enum class EeAIContextType ContextType, bool bSetAsMainContext);
};

// 0x18 (0x130 - 0x118)
// Class LOTF2.AIActionTurn
class UAIActionTurn : public UAIActionPlayMontage
{
public:
	float                                        JudgeAngle;                                        // 0x118(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TurnSpeed;                                         // 0x11C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EeAITurnDirection                 TurnDirection;                                     // 0x120(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25C3[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionTurn* GetDefaultObj();

	class UAIActionTurn* AIActionTurn(class UObject* WorldContextObject, float NewTimeout, float JudgeAngle);
};

// 0x0 (0xD0 - 0xD0)
// Class LOTF2.AIActionWait
class UAIActionWait : public UCharacterAction
{
public:

	static class UClass* StaticClass();
	static class UAIActionWait* GetDefaultObj();

};

// 0x10 (0xE0 - 0xD0)
// Class LOTF2.AIActionWaitGameplayEvent
class UAIActionWaitGameplayEvent : public UCharacterAction
{
public:
	struct FGameplayTag                          GameplayEventTag;                                  // 0xD0(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25C4[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionWaitGameplayEvent* GetDefaultObj();

	class UAIActionWaitGameplayEvent* AIActionWaitGameplayEvent(class UObject* WorldContextObject, const struct FGameplayTag& GameplayEventTagToWait);
};

// 0x0 (0x28 - 0x28)
// Class LOTF2.AIAnimatedBodyUserInterface
class IAIAnimatedBodyUserInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAIAnimatedBodyUserInterface* GetDefaultObj();

};

// 0x90 (0x448 - 0x3B8)
// Class LOTF2.AnathemaGameplayAbility
class UAnathemaGameplayAbility : public UGameplayAbility
{
public:
	bool                                         bActivateAbilityOnGranted;                         // 0x3B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25C5[0x1F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          AbilityIdentifierTag;                              // 0x3D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 WhiteListForCancelAbilitiesWithTag;                // 0x3E0(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 WhiteListForBlockAbilitiesWithTag;                 // 0x400(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UGameplayEffect>>   GameplayEffectsAppliedWhileActive;                 // 0x420(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                         bShouldClearInterruptsOnActivate;                  // 0x430(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25C6[0x17];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaGameplayAbility* GetDefaultObj();

	struct FMontageToPlay GetMontageToPlayFromAnimationSource(struct FAnimationSource& AnimSource);
};

// 0x20 (0x468 - 0x448)
// Class LOTF2.AIPlayMontageAbility
class UAIPlayMontageAbility : public UAnathemaGameplayAbility
{
public:
	uint8                                        Pad_25C7[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIPlayMontageAbility* GetDefaultObj();

	void OnMontageCompleted(enum class EOnMontageDoneReason DoneReason);
};

// 0x0 (0x468 - 0x468)
// Class LOTF2.AIAttackAbility
class UAIAttackAbility : public UAIPlayMontageAbility
{
public:

	static class UClass* StaticClass();
	static class UAIAttackAbility* GetDefaultObj();

};

// 0x70 (0xA0 - 0x30)
// Class LOTF2.AICombatManagerSubsystem
class UAICombatManagerSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_25C9[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSet<struct FSerializationId>                SpawnersAlreadyInCombatWithThePlayer;              // 0x50(0x50)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAICombatManagerSubsystem* GetDefaultObj();

	void StopAICombatManager();
	void StartAICombatManager();
	void RecalculateEnemyCombatRoles();
	float GetAggroScoreForTarget(class ALOTF2Character* RequestingActor, class ALOTF2Character* TargetActor);
};

// 0x20 (0x48 - 0x28)
// Class LOTF2.AIConsideration
class UAIConsideration : public UObject
{
public:
	float                                        Multiplier;                                        // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Bonus;                                             // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Rank;                                              // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25CA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bTimeBarrier;                                      // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25CB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Cooldown;                                          // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACharacter*                            Character;                                         // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAIConsideration* GetDefaultObj();

	void SetCooldown(float FSeconds);
	void Reset();
	float InternalScoreBP();
	float InternalScore();
};

// 0x10 (0x58 - 0x48)
// Class LOTF2.AIConsiderationInterruption
class UAIConsiderationInterruption : public UAIConsideration
{
public:
	enum class EeInterruptionType                InterruptionType;                                  // 0x48(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25CC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Score;                                             // 0x4C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          EffectTagToCheck;                                  // 0x50(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIConsiderationInterruption* GetDefaultObj();

};

// 0x50 (0x100 - 0xB0)
// Class LOTF2.AICustomizationComponent
class UAICustomizationComponent : public UActorComponent
{
public:
	TArray<TSoftObjectPtr<class USkeletalMesh>>  MeshVariations;                                    // 0xB0(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_25CD[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class USkeletalMesh>          SelectedMesh;                                      // 0xD0(0x30)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAICustomizationComponent* GetDefaultObj();

	void GenerateRandomCustomization();
};

// 0x0 (0x468 - 0x468)
// Class LOTF2.AIDodgeAbility
class UAIDodgeAbility : public UAIPlayMontageAbility
{
public:

	static class UClass* StaticClass();
	static class UAIDodgeAbility* GetDefaultObj();

};

// 0x70 (0x98 - 0x28)
// Class LOTF2.AIEnvironment
class UAIEnvironment : public UObject
{
public:
	TArray<TSubclassOf<class UDecisionContext>>  AvailableContextsClasses;                          // 0x28(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UDecisionContext>>  ForbiddenContextsClasses;                          // 0x38(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_25CE[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIEnvironment* GetDefaultObj();

};

// 0x8 (0x2A8 - 0x2A0)
// Class LOTF2.AIEnvironmentActionSequenceActor
class AAIEnvironmentActionSequenceActor : public AActor
{
public:
	class UAIEnvironmentConfigComponent*         AIEnvironmentConfigComponent;                      // 0x2A0(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAIEnvironmentActionSequenceActor* GetDefaultObj();

};

// 0x48 (0xF8 - 0xB0)
// Class LOTF2.AIEnvironmentBehaviorComponent
class UAIEnvironmentBehaviorComponent : public UActorComponent
{
public:
	struct FEnvironmentActionsData               EnvironmentActions;                                // 0xB0(0x30)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25CF[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIEnvironmentBehaviorComponent* GetDefaultObj();

};

// 0x10 (0xC0 - 0xB0)
// Class LOTF2.AIEnvironmentComponent
class UAIEnvironmentComponent : public UActorComponent
{
public:
	TSubclassOf<class UAIEnvironment>            AIEnvironmentClass;                                // 0xB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIEnvironment*                        AIEnvironment;                                     // 0xB8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAIEnvironmentComponent* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class LOTF2.EnvironmentActionData
class UEnvironmentActionData : public UObject
{
public:
	TWeakObjectPtr<class UGameplayEffect>        ActionEffect;                                      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAutoInsertWaitAfter;                              // 0x30(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25D0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WaitTime;                                          // 0x34(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UEnvironmentActionData* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class LOTF2.EnvironmentAnimationActionData
class UEnvironmentAnimationActionData : public UEnvironmentActionData
{
public:
	struct FGameplayTag                          AnimationTag;                                      // 0x38(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        Duration;                                          // 0x40(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25D1[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEnvironmentAnimationActionData* GetDefaultObj();

};

// 0x20 (0x58 - 0x38)
// Class LOTF2.EnvironmentTurnActionData
class UEnvironmentTurnActionData : public UEnvironmentActionData
{
public:
	enum class ETurnEnvironmentActionMode        TurnActionMode;                                    // 0x38(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25D2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                ReferenceActor;                                    // 0x40(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        Degrees;                                           // 0x48(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bRelative;                                         // 0x4C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25D3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DegreesBase;                                       // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TurnSpeed;                                         // 0x54(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UEnvironmentTurnActionData* GetDefaultObj();

};

// 0x30 (0x60 - 0x30)
// Class LOTF2.EnvironmentActionsDataAsset
class UEnvironmentActionsDataAsset : public UDataAsset
{
public:
	struct FEnvironmentActionsData               ActionsData;                                       // 0x30(0x30)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UEnvironmentActionsDataAsset* GetDefaultObj();

};

// 0x38 (0xE8 - 0xB0)
// Class LOTF2.AIEnvironmentConfigComponent
class UAIEnvironmentConfigComponent : public UActorComponent
{
public:
	struct FEnvironmentActionsInfo               Actions;                                           // 0xB0(0x38)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIEnvironmentConfigComponent* GetDefaultObj();

};

// 0x60 (0x110 - 0xB0)
// Class LOTF2.AIFactionComponent
class UAIFactionComponent : public UActorComponent
{
public:
	uint8                                        Pad_25D7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EHexAITeams                       AIFactionTeam;                                     // 0xB8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25D8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EHexAIFactions, enum class ETeamAttitude> TargetFactionAttitudeOverride;                     // 0xC0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAIFactionComponent* GetDefaultObj();

	void SetFactionTeamId(enum class EHexAITeams TeamID);
	void OverrideFactionAttitude(enum class EHexAIFactions Faction, enum class ETeamAttitude NewAttitude);
	bool IsNeutral(class AActor* Actor);
	bool IsHostile(class AActor* Actor);
	bool IsFriendly(class AActor* Actor);
	enum class EHexAITeams GetFactionTeamId();
	enum class EHexAIFactions GetCharacterFaction();
};

// 0x0 (0xC0 - 0xC0)
// Class LOTF2.AIGlobalEnvironment
class UAIGlobalEnvironment : public UAIEnvironmentComponent
{
public:

	static class UClass* StaticClass();
	static class UAIGlobalEnvironment* GetDefaultObj();

	void OnAIControllerSpawned(class ABaseAIController* AIController);
};

// 0xA0 (0x150 - 0xB0)
// Class LOTF2.AILogicManagerComponent
class UAILogicManagerComponent : public UActorComponent
{
public:
	enum class EeAIContextType                   DefaultContextType;                                // 0xB0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25D9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          AnimInterruptTag;                                  // 0xB4(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          CooldownGETag;                                     // 0xBC(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseBehaviorTreeLogic;                             // 0xC4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoStartLogicOnPossess;                          // 0xC5(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25DA[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnInterruptTagReceivedAndNoWaitingActions;         // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_25DB[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCharacterAction*                      HitReactAction;                                    // 0x110(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDecision*                             CurrentDecision;                                   // 0x118(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ABaseAIController*                     AIController;                                      // 0x120(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAIActionManager*                      AIActionManagerComponent;                          // 0x128(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAITargetSystemComponent*              AITargetSystemComponent;                           // 0x130(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x138(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnathemaBehaviorTreeComponent*        MainBehaviorComponent;                             // 0x140(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAIBehaviorEnvironment*                BehaviorEnvironment;                               // 0x148(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAILogicManagerComponent* GetDefaultObj();

	void StopLogic();
	void StartLogic();
	void SetNewContext(enum class EeAIContextType NewContextToSet);
	void SetDefaultContextType(enum class EeAIContextType NewContextToSet);
	void RunMainBehavior(class UBehaviorTree* BTAsset);
	void RunCurrentDecision();
	void QueueContextChange(enum class EeAIContextType NewContextToSet);
	void OnTargetVisualLost();
	void OnTargetPerceived();
	void OnTargetLost();
	void OnTargetDetected();
	void OnTargetChanged(class AActor* NewTarget);
	void OnTargetAcquired();
	void OnInterruption(enum class EeInterruptionType NewInterruptionType);
	void OnActionsFinished();
	bool IsLogicActive();
	void InterruptGameplayTagCallback(const struct FGameplayTag& Tag, int32 NewCount);
	void ClearInterruptions();
};

// 0x1E8 (0x4A0 - 0x2B8)
// Class LOTF2.AimTargetWidget
class UAimTargetWidget : public ULOTF2UserWidget
{
public:
	struct FGameplayAttribute                    AttributeToTrack;                                  // 0x2B8(0x38)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAttribute                    MaxValueAttributeToTrack;                          // 0x2F0(0x38)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ScaleValue;                                        // 0x328(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinScaleValue;                                     // 0x32C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxScaleValue;                                     // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25DC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 SoulFlayInvalidTagContainer;                       // 0x338(0x20)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UTargetComponent>       CurrentTarget;                                     // 0x358(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    RadialProgressBarMaterialInterface;                // 0x360(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SizeBox_TargetContainer;                           // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                              Container_Aim;                                     // 0x370(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                              Container_PostureDanger;                           // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_RadialProgressBar;                           // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Icon;                                        // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_SoulflayableTarget;                          // 0x390(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_StabAvailable;                               // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      FlickerPoiseDamage;                                // 0x3A0(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      StaggeredAnimationFeedback;                        // 0x3A8(0x8)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*              DynMaterialInstance;                               // 0x3B0(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUMGSequencePlayer*                    FlickerAnimHandle;                                 // 0x3B8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25DD[0xE0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAimTargetWidget* GetDefaultObj();

	void OnTargetHealthChanged(float FOldHealth, float FNewHealth);
	void OnStaggerStart();
	void OnStaggerEnd();
	void OnSetTarget(class UTargetComponent* InTargetComponent);
	void OnHUDVisibilityChange(bool bVisible);
	void BP_PlayStopStagger();
	void BP_PlayStartStagger();
};

// 0x48 (0xF8 - 0xB0)
// Class LOTF2.AIParasiteTetheringComponent
class UAIParasiteTetheringComponent : public UActorComponent
{
public:
	TWeakObjectPtr<class ALOTF2Character>        LinkedCharacter;                                   // 0xB0(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayEffectsWithParamsContainer   GameplayEffectsToApply;                            // 0xB8(0x10)(Transient, NativeAccessSpecifierPrivate)
	struct FHexBattleEffectIdentifierContainer   BattleEffectsToApply;                              // 0xC8(0x10)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25E0[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIParasiteTetheringComponent* GetDefaultObj();

	void OnStoppedTethering_BP();
	void OnStartedTethering_BP();
	void OnRep_LinkedCharacter();
	void OnOwnerDeath(class AActor* InstigatorActor, struct FGameplayTagContainer& InstigatorTags, bool bDeathWasObserved);
	void OnLinkedCharacterDeath(class AActor* InstigatorActor, struct FGameplayTagContainer& InstigatorTags, bool bDeathWasObserved);
	class ALOTF2Character* GetLinkedCharacter();
};

// 0x50 (0x100 - 0xB0)
// Class LOTF2.AIPatrollingComponent
class UAIPatrollingComponent : public UActorComponent
{
public:
	uint8                                        Pad_25E1[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class USplineComponent*                      PathSplineComponent;                               // 0xD0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25E2[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPatrolPointInfo>              PatrolPath;                                        // 0xE0(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25E3[0xE];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bFirstPatrolPointAssigned;                         // 0xFE(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25E4[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIPatrollingComponent* GetDefaultObj();

};

// 0x8 (0xB8 - 0xB0)
// Class LOTF2.AIPerceptionModifierComponent
class UAIPerceptionModifierComponent : public UActorComponent
{
public:
	uint8                                        Pad_25F5[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIPerceptionModifierComponent* GetDefaultObj();

	bool K2_OverrideTouchStimulus(class APawn* ObserverPawn, class AController* ObserverController, struct FVector& InstigatorLocation, bool& IsTouched);
	bool K2_OverrideSightStimulus(class APawn* ObserverPawn, class AController* ObserverController, struct FVector& InstigatorLocation, bool& IsVisible);
	bool K2_OverrideNearHitStimulus(class APawn* ObserverPawn, class AController* ObserverController, struct FVector& InstigatorLocation, struct FVector& NearHitLocation, bool& IsNearHited);
	bool K2_OverrideHearingStimulus(class APawn* ObserverPawn, class AController* ObserverController, struct FVector& InstigatorLocation, struct FVector& NoiseLocation, bool& IsAudible);
	bool K2_OverrideESPStimulus(class APawn* ObserverPawn, class AController* ObserverController, struct FVector& InstigatorLocation, bool& IsSensed);
	bool K2_OverrideDamageStimulus(class APawn* ObserverPawn, class AController* ObserverController, struct FVector& InstigatorLocation, struct FVector& HitLocation, bool& IsDamaged);
	bool K2_ModifyTouchStimulus(class APawn* InstigatorPawn, class AController* InstigatorController, struct FVector& InstigatorLocation, struct FVector& TargetLocation, bool& Ignore);
	bool K2_ModifySightStimulus(class APawn* InstigatorPawn, class AController* InstigatorController, struct FVector& InstigatorLocation, struct FVector& TargetVisibleLocation, bool& Ignore, float& CloseSightRadius, float& DistantSightRadius, float& LoseSightRadius, float& PeripheralHorizAngle, float& PeripheralVertAngle);
	bool K2_ModifyNearHitStimulus(class APawn* InstigatorPawn, class AController* InstigatorController, struct FVector& InstigatorLocation, struct FVector& TargetLocation, bool& Ignore, struct FVector& NearHitLocation, struct FAISenseAffiliationFilter& AffiliationFilter);
	bool K2_ModifyHearingStimulus(class APawn* InstigatorPawn, class AController* InstigatorController, struct FVector& InstigatorLocation, struct FVector& NoiseLocation, bool& Ignore, float& HearingRange, struct FAISenseAffiliationFilter& AffiliationFilter);
	bool K2_ModifyESPStimulus(class APawn* InstigatorPawn, class AController* InstigatorController, struct FVector& InstigatorLocation, struct FVector& TargetLocation, bool& Ignore);
	bool K2_ModifyDamageStimulus(class APawn* InstigatorPawn, class AController* InstigatorController, struct FVector& InstigatorLocation, struct FVector& TargetLocation, bool& Ignore, struct FVector& HitLocation, struct FAISenseAffiliationFilter& AffiliationFilter);
};

// 0x0 (0x28 - 0x28)
// Class LOTF2.AIPerceptionModifierInterface
class IAIPerceptionModifierInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAIPerceptionModifierInterface* GetDefaultObj();

};

// 0xA8 (0x158 - 0xB0)
// Class LOTF2.AirStateComponent
class UAirStateComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnFellIntoTheVoid;                                 // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFallingStart;                                    // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFallingEnd;                                      // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        MinimumFallHeightToApplyFallDamage;                // 0xE0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaximumFallHeightToApplyFallDamage;                // 0xE4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ZeroEncumbranceDamageRatio;                        // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinimumFallHeightToAllowPlungeAttack;              // 0xEC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinimumForwardProjectedSpeedToRollOnLanding;       // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ForwardProjectedSpeedToAddFromInput;               // 0xF4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FallHeightToTransitionToKnockedDownFall;           // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25F7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FLandingAnimationInfo>         LandingAnimations;                                 // 0x100(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        FlinchIntensityOnSuperSoftLandingRunning;          // 0x110(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FlinchIntensityOnSuperSoftLandingSprinting;        // 0x114(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FlinchIntensityOnJumpStop;                         // 0x118(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimationSource                      LandingToRollAnimationSource;                      // 0x11C(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_25F8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ALOTF2Character*                       OwnerCharacter;                                    // 0x130(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25F9[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAirStateComponent* GetDefaultObj();

	void ResetFallenIntoTheVoidState();
	void OnMovementModeChanged(class ACharacter* Character, enum class EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnLandedEvent(struct FHitResult& Hit);
	bool HasFallenIntoTheVoid();
};

// 0x8 (0x2F0 - 0x2E8)
// Class LOTF2.VoidVolume
class AVoidVolume : public AKillZVolume
{
public:
	class ULOTF2SerializationComponent*          SerializationComponent;                            // 0x2E8(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AVoidVolume* GetDefaultObj();

};

// 0x28 (0xD8 - 0xB0)
// Class LOTF2.AIRubberBandingComponent
class UAIRubberBandingComponent : public UActorComponent
{
public:
	uint8                                        Pad_25FA[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBlackboardComponent*                  Blackboard;                                        // 0xD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAIRubberBandingComponent* GetDefaultObj();

};

// 0x0 (0x468 - 0x468)
// Class LOTF2.AIShieldAbility
class UAIShieldAbility : public UAIPlayMontageAbility
{
public:

	static class UClass* StaticClass();
	static class UAIShieldAbility* GetDefaultObj();

};

// 0x8 (0x2B0 - 0x2A8)
// Class LOTF2.AISphereEnvironmentActionSequenceActor
class AAISphereEnvironmentActionSequenceActor : public AAIEnvironmentActionSequenceActor
{
public:
	class USphereComponent*                      SequenceTrigger;                                   // 0x2A8(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AAISphereEnvironmentActionSequenceActor* GetDefaultObj();

	void OnActivationBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
};

// 0xB0 (0xD8 - 0x28)
// Class LOTF2.AITarget
class UAITarget : public UObject
{
public:
	uint8                                        Pad_260F[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        IsAttacking : 1;                                   // Mask: 0x1, PropSize: 0x10x38(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        IsBlocking : 1;                                    // Mask: 0x2, PropSize: 0x10x38(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        IsParried : 1;                                     // Mask: 0x4, PropSize: 0x10x38(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        IsDodging : 1;                                     // Mask: 0x8, PropSize: 0x10x38(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        IsExhausted : 1;                                   // Mask: 0x10, PropSize: 0x10x38(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        IsStunned : 1;                                     // Mask: 0x20, PropSize: 0x10x38(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        GatingEnabled : 1;                                 // Mask: 0x40, PropSize: 0x10x38(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_202 : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2610[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LastDodgeTime;                                     // 0x3C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastExhaustTime;                                   // 0x40(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastStunTime;                                      // 0x44(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAITargetSystemThreatType         Threat;                                            // 0x48(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAITargetSystemConfirmationType   Confirmation;                                      // 0x49(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2611[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Location;                                          // 0x50(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               StandingLocation;                                  // 0x68(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               Facing;                                            // 0x80(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               Velocity;                                          // 0x98(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                 Actor;                                             // 0xB0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AAITargetMarkerActor*                  MarkerActor;                                       // 0xB8(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerCharacterCameraMarkerActor*     PerceivedViewMarkerActor;                          // 0xC0(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerCharacterCameraMarkerActor*     RealViewMarkerActor;                               // 0xC8(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UAITargetAssociatedSet> AssociatedSet;                                     // 0xD0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAITarget* GetDefaultObj();

	void RequestGateLock(class ABaseAIController* LockingAIController);
	void OnTargetAttackParried(class ALOTF2Character* Character, class AActor* ParriedBy);
	void OnTargetAttackDeflected(class ALOTF2Character* Character, class AActor* DeflectedBy, struct FHitResult& HitResult, struct FVector& HitDirection);
	void OnPlayerTargetStunStop(class APlayerCharacterController* PlayerController);
	void OnPlayerTargetStunStart(class APlayerCharacterController* PlayerController);
	void OnPlayerTargetExhaustedStop(class APlayerCharacterController* PlayerController);
	void OnPlayerTargetExhaustedStart(class APlayerCharacterController* PlayerController);
	void OnPlayerTargetDodged(class APlayerCharacterController* PlayerController, bool IsStarting, float InRelativeDodgeAngle);
	void OnAITargetStunStop(class ABaseAIController* AIController);
	void OnAITargetStunStart(class ABaseAIController* AIController);
	void OnAITargetParriedStopped(class ABaseAIController* AIController, bool IsInterrupted);
	void OnAITargetParriedStarted(class ABaseAIController* AIController);
	void OnAITargetExhaustedStop(class ABaseAIController* AIController);
	void OnAITargetExhaustedStart(class ABaseAIController* AIController);
	void OnAITargetBlockStopped(class ABaseAIController* AIController, bool IsInterrupted);
	void OnAITargetBlockStarted(class ABaseAIController* AIController);
	bool IsVisible();
	bool IsValid();
	bool IsRecentlyVisible(float DeltaTime);
	bool IsRecentlyTouched(float DeltaTime, bool IncludeESP);
	bool IsRecentlyHeard(float DeltaTime);
	bool IsRecentlyAttacked(float DeltaTime, bool IncludeNearHits);
	bool IsInParryableWindow();
	bool IsInDamageWindow();
	bool IsGateLockingAIController(class ABaseAIController* InController);
	bool IsGateLockable();
	bool IsActor(class AActor* OtherActor);
	bool HasGateLockingAIController();
	class APlayerCharacterCameraMarkerActor* GetViewMarkerActor(bool* OutIsValid);
	struct FVector GetVelocity();
	float GetTimeUntilParryable();
	float GetTimeUntilDamage();
	enum class EAITargetSystemThreatType GetThreat();
	class UAITargetGatingComponent* GetTargetGatingComponent();
	struct FVector GetStandingLocation();
	struct FVector GetProjectedStandingLocation(float Time);
	struct FVector GetProjectedNavLocation(class UObject* WorldContextObject, class AController* Querier, float Radius, float Time);
	struct FVector GetProjectedLocation(float Time);
	class APlayerCharacterCameraMarkerActor* GetPerceivedViewMarkerActor(bool* OutIsValid);
	class ABaseAIController* GetOwnerController();
	struct FVector GetNavLocation(class UObject* WorldContextObject, class AController* Querier, float Radius);
	class AAITargetMarkerActor* GetMarkerActor(bool* OutIsValid);
	struct FVector GetLocation();
	float GetLastStunTime();
	float GetLastExhaustedTime();
	bool GetIsStunned();
	bool GetIsRecentlyStunned(float DeltaTime);
	bool GetIsRecentlyExhausted(float DeltaTime);
	bool GetIsParried();
	bool GetIsExhausted();
	bool GetIsDodging();
	bool GetIsBlocking();
	bool GetIsAttacking();
	class ABaseAIController* GetGateLockingAIController();
	struct FVector GetFacing();
	bool GetEnvelopeState(enum class EAITargetEnvelopeType Type, struct FAITargetEnvelopeState* OutState);
	enum class EAITargetSystemConfirmationType GetConfirmation();
	class AActor* GetActor();
};

// 0x78 (0xA0 - 0x28)
// Class LOTF2.AITargetAssociatedSet
class UAITargetAssociatedSet : public UObject
{
public:
	TWeakObjectPtr<class AActor>                 Target;                                            // 0x28(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAITargetEnvelope*>             Envelopes;                                         // 0x30(0x10)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	enum class ECombatRole                       CombatRole;                                        // 0x40(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2612[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TargetSetScore;                                    // 0x44(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2613[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAITargetAssociatedSet* GetDefaultObj();

};

// 0x90 (0xB8 - 0x28)
// Class LOTF2.AITargetEnvelope
class UAITargetEnvelope : public UObject
{
public:
	enum class EAITargetEnvelopeType             Type;                                              // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2614[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Scale;                                             // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastActiveValue;                                   // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeSinceLastStimulus;                             // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeSinceLastStateChange;                          // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAITargetEnvelopeConfig               Config;                                            // 0x3C(0x1C)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FAITargetEnvelopeState                State;                                             // 0x58(0x58)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bIsSensed;                                         // 0xB0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTargetUpdateForgetState;                          // 0xB1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2615[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAITargetEnvelope* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class LOTF2.AITargetEnvelopeConfigSettings
class UAITargetEnvelopeConfigSettings : public UObject
{
public:
	TArray<struct FAITargetDefaultEnvelopeConfig> DefaultEnvelopes;                                  // 0x28(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAITargetEnvelopeConfigSettings* GetDefaultObj();

};

// 0x68 (0x308 - 0x2A0)
// Class LOTF2.AITargetGatingActiveLocation
class AAITargetGatingActiveLocation : public AActor
{
public:
	uint8                                        IsPaused : 1;                                      // Mask: 0x1, PropSize: 0x10x2A0(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        StrafeDirection : 1;                               // Mask: 0x2, PropSize: 0x10x2A0(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_203 : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2616[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BaseStickDistance;                                 // 0x2A4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StrafeAngle;                                       // 0x2A8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StrafeTimer;                                       // 0x2AC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloseInTimer;                                      // 0x2B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2617[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RelativeWorldLocation;                             // 0x2B8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               StickAxis;                                         // 0x2D0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAITargetGatingActiveLocationSettings Settings;                                          // 0x2E8(0x20)(NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAITargetGatingActiveLocation* GetDefaultObj();

};

// 0xE8 (0x198 - 0xB0)
// Class LOTF2.AITargetGatingComponent
class UAITargetGatingComponent : public UActorComponent
{
public:
	uint8                                        GateLockRecentlyChanged : 1;                       // Mask: 0x1, PropSize: 0x10xB0(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        GateLockEnabled : 1;                               // Mask: 0x2, PropSize: 0x10xB0(0x1)(Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        GateLockAllowAny : 1;                              // Mask: 0x4, PropSize: 0x10xB0(0x1)(Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_204 : 5;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_261B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GateLockOwnerMaxDistance;                          // 0xB4(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GateLockOwnerForgetDistance;                       // 0xB8(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GateLockOwnerIgnoreCenternessDistance;             // 0xBC(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GateLockOwnerMinCenterness;                        // 0xC0(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GateLockOwnerMaxSpeed;                             // 0xC4(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SortingDistanceScoreDistance;                      // 0xC8(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SortingDistanceScore;                              // 0xCC(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SortingCenternessScore;                            // 0xD0(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinWaitingLocationUpdateDist;                      // 0xD4(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               LastWaitingLocationUpdatePoint;                    // 0xD8(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ABaseAIController>      OwnerCurrentTarget;                                // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ABaseAIController>      GateLockOwner;                                     // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class ABaseAIController>> LockRequests;                                      // 0x100(0x10)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class ABaseAIController>> DebugLastLockRequests;                             // 0x110(0x10)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class AAITargetGatingActiveLocation*         ActiveLocation;                                    // 0x120(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAITargetGatingInterceptLocationEntry> InterceptLocations;                                // 0x128(0x10)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAITargetGatingWaitingLocationEntry> WaitingLocations;                                  // 0x138(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_261C[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAITargetGatingComponent* GetDefaultObj();

	void OnPlayerOwnerTargetChanged(class APlayerCharacterController* PlayerController, class UTargetComponent* PrevTarget, class UTargetComponent* NewTarget);
	void OnGateLockOwnerDeath(class ABaseAIController* AIController);
	struct FVector GetWaitingWorldLocation(class ABaseAIController* InWaitingController);
	class AAITargetGatingWaitingLocation* GetWaitingLocationActor(class ABaseAIController* InWaitingController, bool* OutIsValid);
	struct FVector GetInterceptWorldLocation(class ABaseAIController* InInterceptingController);
	class AAITargetGatingInterceptLocation* GetInterceptLocationActor(class ABaseAIController* InInterceptingController, bool* OutIsValid);
	struct FVector GetActiveWorldLocation();
	class AAITargetGatingActiveLocation* GetActiveLocationActor(bool* OutIsValid);
};

// 0x20 (0x2C0 - 0x2A0)
// Class LOTF2.AITargetGatingInterceptLocation
class AAITargetGatingInterceptLocation : public AActor
{
public:
	float                                        VelocityScale;                                     // 0x2A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_261D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CachedVelocity;                                    // 0x2A8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAITargetGatingInterceptLocation* GetDefaultObj();

};

// 0x10 (0x2B0 - 0x2A0)
// Class LOTF2.AITargetGatingTicker
class AAITargetGatingTicker : public AActor
{
public:
	TArray<TWeakObjectPtr<class UAITargetGatingComponent>> AITargetGatingComponents;                          // 0x2A0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAITargetGatingTicker* GetDefaultObj();

	void OnPlayerControllerCreated(class APlayerCharacterController* PlayerController);
	void OnAIControllerCreated(class ABaseAIController* AIController);
};

// 0x78 (0x318 - 0x2A0)
// Class LOTF2.AITargetGatingWaitingLocation
class AAITargetGatingWaitingLocation : public AActor
{
public:
	uint8                                        IsValidLocation : 1;                               // Mask: 0x1, PropSize: 0x10x2A0(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        IsValidOnNavMesh : 1;                              // Mask: 0x2, PropSize: 0x10x2A0(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_205 : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_261E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinDistance;                                       // 0x2A4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x2A8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_261F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               AxisVector;                                        // 0x2B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2620[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAITargetGatingWaitingLocation* GetDefaultObj();

};

// 0x0 (0x2A0 - 0x2A0)
// Class LOTF2.AITargetMarkerActor
class AAITargetMarkerActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class AAITargetMarkerActor* GetDefaultObj();

};

// 0x148 (0x1F8 - 0xB0)
// Class LOTF2.AITargetSystemComponent
class UAITargetSystemComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnTargetPerceived;                                 // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTargetDetected;                                  // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTargetAcquired;                                  // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTargetLost;                                      // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTargetChanged;                                   // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTargetVisualLost;                                // 0x100(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        HighThreatValue;                                   // 0x110(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MediumThreatValue;                                 // 0x114(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LowThreatValue;                                    // 0x118(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2627[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAITargetAssociatedSet*                TemplateAssociatedSet;                             // 0x120(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class AActor>, class UAITargetAssociatedSet*> Targets;                                           // 0x128(0x50)(Edit, ExportObject, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class AActor*                                GoalTargetActor;                                   // 0x178(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAITarget*                             GoalTarget;                                        // 0x180(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAITarget*                             AttentionTarget;                                   // 0x188(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                 PreviousActiveTargetActor;                         // 0x190(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAIPerceptionComponent*                M_pPerceptionComponent;                            // 0x198(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2628[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AggroRequiredPercentageIncreaseToChangeTarget;     // 0x1B4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2629[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnStimulusProcessedDelegate;                       // 0x1C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_262A[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAITargetSystemComponent* GetDefaultObj();

	void SetGoalTarget(class AActor* Target, bool bShouldClearOnTargetLost, float GoalTargetTimeout, bool bShouldPriorizeGoalTarget);
	void PushTargetChangeDisabledLock();
	void PopTargetChangeDisabledLock();
	void OnStimulusProcessed(class AActor* Target, const struct FAIStimulus& Stimulus);
	void OnStateEnd(struct FGameplayTagContainer& StateChangePayload, class UHexStateTreeComponent* OwnerStateTreeComponent);
	void OnStateBegin(struct FGameplayTagContainer& StateChangePayload, class UHexStateTreeComponent* OwnerStateTreeComponent);
	void OnReceiveAlert(class AActor* PNewTargetToAssign);
	void OnGoalTargetTimerCompleted();
	bool IsTargetPerceived(class AActor* Target);
	bool GetTargetEnvelopeState(class AActor* Target, enum class EAITargetEnvelopeType EnvelopeType, struct FAITargetEnvelopeState* OutState);
	enum class ECombatRole GetCombatRoleOfCurrentTarget();
	enum class ECombatRole GetCombatRoleByTarget(class AActor* DesiredActor);
	enum class EAITargetSystemThreatType GetAttentionTargetThreat();
	enum class EAITargetSystemConfirmationType GetAttentionTargetConfirmation();
};

// 0x78 (0x128 - 0xB0)
// Class LOTF2.AIWaitFirstEncounterSystemComp
class UAIWaitFirstEncounterSystemComp : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnFirstEncounterTriggered;                         // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_262B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTree*                         InitialActionBehaviorTree;                         // 0xD0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_262C[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAITargetSystemComponent*              AITargetSystemComponent;                           // 0xF0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_262D[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIWaitFirstEncounterSystemComp* GetDefaultObj();

	void TriggerFirstEncounter(class AActor* OverlappedActor, class AActor* OtherActor);
	bool ShouldRunTowardsTarget();
	struct FGameplayTag GetWaitFirstEncounterAnimationTag();
	struct FGameplayTag GetTriggerFirstEncounterAnimationTag();
	bool GetShouldIgnoreSenses();
	float GetDistanceToTriggerActionInMeters();
};

// 0x50 (0x4F0 - 0x4A0)
// Class LOTF2.AkAnathemaComponent
class UAkAnathemaComponent : public UAkComponent
{
public:
	uint8                                        Pad_262F[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAkAnathemaComponent* GetDefaultObj();

	int32 PostAkAnathemaEvent(struct FAkAnathemaEvent& AkAnathemaEvent);
};

// 0x20 (0x50 - 0x30)
// Class LOTF2.AmmoAttributeSet
class UAmmoAttributeSet : public UAttributeSet
{
public:
	struct FGameplayAttributeData                Ammo;                                              // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                MaxAmmo;                                           // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAmmoAttributeSet* GetDefaultObj();

	void OnRep_MaxAmmo(struct FGameplayAttributeData& OldMaxAmmo);
	void OnRep_Ammo(struct FGameplayAttributeData& OldAmmo);
};

// 0xC8 (0x368 - 0x2A0)
// Class LOTF2.AmmoBarWidget
class UAmmoBarWidget : public UCommonUserWidget
{
public:
	class UPanelWidget*                          Ammo_Container;                                    // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonUserWidget>         AmmoChargeClass;                                   // 0x2A8(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          AmmoCostTag;                                       // 0x2B0(0x8)(Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAttribute                    Attribute;                                         // 0x2B8(0x38)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAttribute                    MaxAttribute;                                      // 0x2F0(0x38)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilitySystemComponent*               PlayerAsc;                                         // 0x328(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEquipmentManagerComponent*            EquipmentManagerComponent;                         // 0x330(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerCharacter*                      PlayerCharacter;                                   // 0x338(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurrentAmmo;                                       // 0x340(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxAmmo;                                           // 0x344(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurrentAmmoCost;                                   // 0x348(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2630[0x1C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAmmoBarWidget* GetDefaultObj();

	void UseAmmo(int32 AmmoToUse, int32 AmmoCost);
	void UpdateStatsInternal(float CurrentAmmoValue, float MaxAmmoValue);
	void UpdateStats(float CurrentAmmoValue, float MaxAmmoValue);
	void UpdateCachedPlayerInfo(class APawn* OlsPawn, class APawn* NewPawn);
	void UpdateAmmoCost(int32 AmmoCost);
	void UpdateAmmo(int32 AmmoCost);
	void ResetAmmoSlots();
	void OnEquipmentChanged();
	void OnConfigInit();
	void OnAmmoRangedSlotChanged(enum class EFEquipmentSlot RangedAmmoUsedSlot);
	void CreateAmmoSlots(int32 Slots);
	void BP_UpdateAmmo(int32 CurrentAmmo);
	void BP_PlayFailAbilityFeedback();
};

// 0x448 (0x478 - 0x30)
// Class LOTF2.ItemData
class UItemData : public UPrimaryDataAsset
{
public:
	TSubclassOf<class UInventoryItem>            InventoryItemClass;                                // 0x30(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UItemActivationPrecondition>> ItemActivationPreconditions;                       // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UAnimMontage*                          ItemUseAnimation;                                  // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FItemUseAnimationData                 ItemUseAnimationData;                              // 0x50(0x20)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UTexture2D*                            ItemIcon;                                          // 0x70(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>             HDIcon;                                            // 0x78(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  ItemName;                                          // 0xA8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	class FText                                  CustomizationItemName;                             // 0xC0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	class FText                                  ItemShortDescription;                              // 0xD8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	class FText                                  ItemDescription;                                   // 0xF0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class AActor>                  ItemVisual;                                        // 0x108(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        ItemPropertyFlags;                                 // 0x138(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bItemHidden;                                       // 0x139(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bBossItem;                                         // 0x13A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsUniqueForAccount;                               // 0x13B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bShouldRemoveOnNewGamePlus;                        // 0x13C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsHostOnly;                                       // 0x13D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bShouldAlwaysLoot;                                 // 0x13E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanBeDropped;                                     // 0x13F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowUseMultipleInstances;                        // 0x140(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bRequiresActivatedAnchor;                          // 0x141(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bConsumedOnUsage;                                  // 0x142(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDropAlternative;                                  // 0x143(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDontRemoveFromUniquesList;                        // 0x144(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanDisplayInLoadingScreenTips;                    // 0x145(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2632[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxStackSize;                                      // 0x148(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        MaxItemLevel;                                      // 0x14C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          ItemCategory;                                      // 0x150(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUsableAutoEquipOnPickup;                          // 0x158(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2633[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterGameplayAbilitiesConfig     OnItemUsedGameplayAbilitiesConfig;                 // 0x160(0xE8)(Edit, NativeAccessSpecifierPublic)
	struct FCharacterGameplayAbilitiesConfig     OnItemAddedToTheInventoryGameplayAbilitiesConfig;  // 0x248(0xE8)(Edit, NativeAccessSpecifierPublic)
	enum class EDLCName                          DLC;                                               // 0x330(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2634[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UItemData*, int32>                BuildCostMap;                                      // 0x338(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	class FText                                  InspectionDetails;                                 // 0x388(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	float                                        Mass;                                              // 0x3A0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        UseQuantityCost;                                   // 0x3A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UItemData*, int32>                AdditionalUseCostMap;                              // 0x3A8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                     DropOnDeathQuery;                                  // 0x3F8(0x48)(Edit, NativeAccessSpecifierPrivate)
	enum class EItemDevStatus                    ItemDevStatus;                                     // 0x440(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        RewardMultiplayerTargets;                          // 0x441(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bRewardUINotificationEnabled;                      // 0x442(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2635[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   ItemPriceRow;                                      // 0x448(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                 ItemTags;                                          // 0x458(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UItemData* GetDefaultObj();

	bool ShouldRemoveOnNewGamePlus();
	bool ShouldDropOnOwnerDeath(class ALOTF2Character* OwnerCharacter);
	bool ShouldDropAlternative();
	bool ShouldAlwaysLoot();
	void SetItemPropertyFlags(uint8 Value);
	bool RequiresActivatedAnchor();
	bool IsUsableInUmbral();
	bool IsUsableAutoEquipOnPickup();
	bool IsUsable();
	bool IsUnstackable();
	bool IsUnique();
	bool IsRefillable();
	bool IsQuestItem();
	bool IsInspectable();
	bool IsHostOnly();
	bool IsHidden();
	bool IsConsumedOnUsage();
	bool IsBossItem();
	bool IsAccountUnique();
	int32 GetUseQuantityCost();
	TMap<class UItemData*, int32> GetUseAdditionalCostMap();
	int32 GetMaxStackSize();
	int32 GetMaxItemLevel();
	float GetMass();
	struct FItemLoreStatRequirements GetLoreRequirements();
	TSoftClassPtr<class AActor> GetItemVisual();
	struct FItemUseAnimationData GetItemUseAnimationData();
	class UAnimMontage* GetItemUseAnimation();
	struct FGameplayTagContainer GetItemTags();
	class FText GetItemShortDescription();
	struct FItemPrice GetItemPrice();
	class FText GetItemName();
	class UTexture2D* GetItemIcon();
	enum class EItemDevStatus GetItemDevStatus();
	class FText GetItemDescription();
	struct FGameplayTag GetItemCategory();
	TArray<TSubclassOf<class UItemActivationPrecondition>> GetItemActivationPreconditions();
	TSubclassOf<class UInventoryItem> GetInventoryItemClass();
	class FText GetInspectionDetails();
	TSoftObjectPtr<class UTexture2D> GetHDIcon();
	class FText GetCustomizationItemName();
	TMap<class UItemData*, int32> GetBuildCostMap();
	int32 ClampToMaxStackSize(int32 Stack);
	bool CheckPropertyFlag(enum class EItemProperties Flag);
	bool CanDisplayInLoadingScreenTips();
	bool CanBeSold();
	bool CanBeRemovedFromUniquesList();
	bool CanBeDropped();
	bool AllowUseMultipleInstances();
};

// 0x210 (0x688 - 0x478)
// Class LOTF2.EquipementData
class UEquipementData : public UItemData
{
public:
	bool                                         bUseAttachmentRules;                               // 0x478(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EPropJoint                        AttachToJoint;                                     // 0x479(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2636[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               JointOffset;                                       // 0x480(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              JointRotationOffset;                               // 0x498(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	enum class EPropJoint                        HolsterJoint;                                      // 0x4B0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2637[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  HolsterPivotSocket;                                // 0x4B4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2638[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               HolsterJointOffset;                                // 0x4C0(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              HolsterJointRotationOffset;                        // 0x4D8(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	enum class EPropJoint                        SecondaryAttachToJoint;                            // 0x4F0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EPropJoint                        SecondaryHolsterJoint;                             // 0x4F1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2639[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SecondaryHolsterPivotSocket;                       // 0x4F4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_263A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               SecondaryJointOffset;                              // 0x500(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              SecondaryJointRotationOffset;                      // 0x518(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bUseEquippedOffsetsFromPrimary;                    // 0x530(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_263B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ShieldOffsetWhenHolsteredAtBack;                   // 0x534(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               JointOffsetSecondary;                              // 0x538(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              JointRotationOffsetSecondary;                      // 0x550(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FCharacterGameplayAbilitiesConfig     OnEquippedGameplayAbilitiesConfig;                 // 0x568(0xE8)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FAkSwitchesOnEquip>            AkSwitchesOnEquip;                                 // 0x650(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	enum class EFEquipmentSlot                   EquipmentSlot;                                     // 0x660(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_263C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   TriggerPropertyNormal;                             // 0x668(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   TriggerPropertyCharging;                           // 0x678(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UEquipementData* GetDefaultObj();

	struct FCharacterGameplayAbilitiesConfig GetEquippedGameplayAbilitiesConfig();
	enum class EFEquipmentSlot GetEquipmentSlot();
};

// 0x258 (0x8E0 - 0x688)
// Class LOTF2.AmmoData
class UAmmoData : public UEquipementData
{
public:
	struct FDataTableRowHandle                   StatsRow;                                          // 0x688(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	enum class EAmmoType                         AmmoTypeDefinition;                                // 0x698(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_263D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterGameplayAbilitiesConfig     OnSelectedGameplayAbilitiesConfig;                 // 0x6A0(0xE8)(Edit, NativeAccessSpecifierPrivate)
	TSubclassOf<class USubAutonomousAbilityData> SSAToTriggerWhenSimpleShot;                        // 0x788(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class USubAutonomousAbilityData> SSAToTriggerWhenChargedShot;                       // 0x790(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSpawnDefinition                      SpawnDefinition;                                   // 0x798(0x120)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                 GameplayCueTags;                                   // 0x8B8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          TagToCheckForDynamicCost;                          // 0x8D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAmmoData* GetDefaultObj();

	struct FGameplayTag GetTagToCheckForDynamicCost();
	TSubclassOf<class USubAutonomousAbilityData> GetSSAToTriggerWhenSimpleShot();
	TSubclassOf<class USubAutonomousAbilityData> GetSSAToTriggerWhenChargedShot();
	struct FSpawnDefinition GetSpawnDefinition();
	struct FGameplayTagContainer GetGameplayCueTags();
	float GetExtraStaminaCostWhenCharged();
	TMap<struct FGameplayTag, float> GetCost();
};

// 0x8 (0x2A8 - 0x2A0)
// Class LOTF2.ItemVisual
class AItemVisual : public AActor
{
public:
	enum class EPropJoint                        AttachedJoint;                                     // 0x2A0(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAssignReceivesDecalsToFalseOnEquip;               // 0x2A1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_263E[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AItemVisual* GetDefaultObj();

	void SetSimulatePhysics(bool bSimulatePhysics);
	void OnRep_AttachedJoint();
	void BP_OnAttached(enum class EPropJoint Joint);
};

// 0x0 (0x2A8 - 0x2A8)
// Class LOTF2.AmmoOnQuiverVisual
class AAmmoOnQuiverVisual : public AItemVisual
{
public:

	static class UClass* StaticClass();
	static class AAmmoOnQuiverVisual* GetDefaultObj();

	void UpdateAmmoAmount(float NewAmmo, float AmmoCost);
	void SetNewAmmoRemainingAmount(float NewAmmo, float AmmoCost);
};

// 0x0 (0x2A0 - 0x2A0)
// Class LOTF2.AmmoSlotWidget
class UAmmoSlotWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAmmoSlotWidget* GetDefaultObj();

	void SetAmmoAsUsed();
	void Reset();
	void PlayUseAmmo();
	void PlayTryUseAmmo();
	void PlayMarkAmmo();
	void PlayCantUseAmmo();
};

// 0x110 (0x4D8 - 0x3C8)
// Class LOTF2.HexActivatableWidget
class UHexActivatableWidget : public UCommonActivatableWidget
{
public:
	class UEventNameBasedControllerIcons*        EventNameBasedControllerIconsClass;                // 0x3C8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EHexWidgetInputMode               InputConfig;                                       // 0x3D0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EMouseCaptureMode                 GameMouseCaptureMode;                              // 0x3D1(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bGameIgnoreMovement;                               // 0x3D2(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bGameIgnoreLookAt;                                 // 0x3D3(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInterruptible;                                    // 0x3D4(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRestoreCursor;                                    // 0x3D5(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2642[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUIInteractionAnimationData           UIPlayerInteractionAnimationData;                  // 0x3D8(0x48)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FUIInteractionAnimationData> UIPlayerInteractionAnimationDataPerNPC;            // 0x420(0x50)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FUIInteractionAnimationData           UINPCInteractionAnimationData;                     // 0x470(0x48)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2643[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UHexActivatableWidget* GetDefaultObj();

	void OnUIInteractionAnimationDone();
	void OnPlayerTakeDamage(class AActor* DamagedActor, float Damage, const struct FGameplayTagContainer& AllAssetTags, class AActor* InstigatedBy, class AActor* DamageCauser, enum class EHexAttackTypeEffectivenes AttackTypeEffectiveness);
	void OnPlayerDeath(class AActor* InstigatorActor, struct FGameplayTagContainer& TagContainer, bool bDeathWasObserved);
	void OnInputMethodChanged(enum class ECommonInputType NewInputMethod);
	class UTexture2D* GetControllerIconByEventName(struct FGameplayTag& Action);
	void CloseWidget();
};

// 0xE8 (0x5C0 - 0x4D8)
// Class LOTF2.AmountSelectorWidget
class UAmountSelectorWidget : public UHexActivatableWidget
{
public:
	FMulticastInlineDelegateProperty_            OnAmountSelected;                                  // 0x4D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UFocusableButtonWidget*                Button_ReduceAmount;                               // 0x4E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_IncreaseAmount;                             // 0x4F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                          Container_ItemPrice;                               // 0x4F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  Text_Price;                                        // 0x500(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ItemName;                                     // 0x508(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Item;                                        // 0x510(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<enum class EInventoryInteractionActionType, class FText> Actions;                                           // 0x518(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Amount;                                       // 0x568(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ActionDescription;                            // 0x570(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          ReduceAmountActionTag;                             // 0x578(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          IncreaseAmountActionTag;                           // 0x580(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2644[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAmountSelectorWidget* GetDefaultObj();

	void OnReduceAmount();
	void OnIncreaseAmount();
	void OnConfirmAmount();
	void BP_OnReduceAmount();
	void BP_OnIncreaseAmount();
};

// 0xF8 (0x14B0 - 0x13B8)
// Class LOTF2.AnathemaAbilitySystemComponent
class UAnathemaAbilitySystemComponent : public UAbilitySystemComponent
{
public:
	uint8                                        Pad_264C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnathemaGameplayAbility*              InterruptibleAbility;                              // 0x13C8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_264D[0x80];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnAbilityFailedBP;                                 // 0x1450(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_264E[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 InitialTags;                                       // 0x1490(0x20)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnathemaAbilitySystemComponent* GetDefaultObj();

	void RemoveTagsForInterruptibleAbility(class UAnathemaGameplayAbility* AbilityToInterrupt, struct FGameplayTagContainer& IAmInterruptibleByTheseTags);
	bool IsTagInInterruptionSet(struct FGameplayTag& AbilityTag);
	bool IsAnyTagInInterruptionSet(struct FGameplayTagContainer& AbilityTags);
	class UAnathemaGameplayAbility* GetInterruptibleAbilityIfMatchesAnyInterruptionTag(struct FGameplayTagContainer& AbilityTags);
	float GetGameplayEffectTimeRemaining(TSubclassOf<class UGameplayEffect> SourceGameplayEffect);
	float GetGameplayEffectDuration(TSubclassOf<class UGameplayEffect> SourceGameplayEffect);
	struct FGameplayTagContainer GetCurrentInterruptionTags();
	class UAnathemaGameplayAbility* GetCurrentInterruptibleAbility();
	class UGameplayAbility* FindFirstPrimaryInstanceFromParentClass(TSubclassOf<class UGameplayAbility> InAbilityClass);
	class UGameplayAbility* FindAbilityPrimaryInstanceByClass(TSubclassOf<class UGameplayAbility> InAbilityClass);
	void DEBUG_ApplyGameplayEffectToSelf(class UGameplayEffect* GameplayEffect, float Level, struct FGameplayEffectContextHandle& EffectContext);
	void ClearInterrupts();
	bool BP_TriggerAbilityClassFromGameplayEvent(TSubclassOf<class UGameplayAbility> AbilityToActivate, const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload);
	class UAnimMontage* BP_GetCurrentAnimatingAbilityMontage();
	void BP_GetBlockedAbilityTags(struct FGameplayTagContainer* TagContainer);
	class UGameplayAbility* BP_GetAnimatingAbility();
	void BP_CancelAbilities(struct FGameplayTagContainer& WithTags, struct FGameplayTagContainer& WithoutTags, class UGameplayAbility* Ignore);
	bool BP_AreAbilityTagsBlocked(struct FGameplayTagContainer& Tags);
	void ApplyGameplayEffectSpecToSelfLocal(struct FGameplayEffectSpecHandle& SpecHandle);
	void AddTagsForInterruptibleAbility(class UAnathemaGameplayAbility* AbilityToInterrupt, struct FGameplayTagContainer& IAmInterruptibleByTheseTags);
};

// 0x20 (0xF0 - 0xD0)
// Class LOTF2.AnathemaAITurnAction
class UAnathemaAITurnAction : public UCharacterAction
{
public:
	float                                        JudgeAngle;                                        // 0xD0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TurnSpeed;                                         // 0xD4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                AbilityClass;                                      // 0xD8(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_264F[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaAITurnAction* GetDefaultObj();

};

// 0x0 (0x298 - 0x298)
// Class LOTF2.AnathemaBehaviorTreeComponent
class UAnathemaBehaviorTreeComponent : public UBehaviorTreeComponent
{
public:

	static class UClass* StaticClass();
	static class UAnathemaBehaviorTreeComponent* GetDefaultObj();

	class FString BP_GetDebugInfoString();
};

// 0x10 (0x458 - 0x448)
// Class LOTF2.AnathemaCharacterRepositionAbility
class UAnathemaCharacterRepositionAbility : public UAnathemaGameplayAbility
{
public:
	bool                                         bShouldOverrideExternalParameters;                 // 0x448(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldEaseIn;                                     // 0x449(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldEaseOut;                                    // 0x44A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldForceShortestPath;                          // 0x44B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        InterpolationTime;                                 // 0x44C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilityTask_RepositionActor*          RepositionPlayerTask;                              // 0x450(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAnathemaCharacterRepositionAbility* GetDefaultObj();

	void OnMoveComponentToCompleted();
};

// 0x8 (0x38 - 0x30)
// Class LOTF2.AnathemaFXManager
class UAnathemaFXManager : public UWorldSubsystem
{
public:
	bool                                         bDebugDisplayFXTraces;                             // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDebugDisplayFXTracesOnlyPlayer;                   // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDebugDisplayVFXDirection;                         // 0x32(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDebugDisplayVFXAttackType;                        // 0x33(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2656[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaFXManager* GetDefaultObj();

	class UNiagaraComponent* SpawnNiagaraSystemOnLocation(class UNiagaraSystem* NiagaraSystem, struct FVector& Location, struct FRotator& Rotation, struct FVector& Scale);
	class UNiagaraComponent* SpawnNiagaraSystemOnActor(class AActor* Actor, class UNiagaraSystem* NiagaraSystem, class FName SocketName, struct FRotator& Rotation);
	void SpawnNiagaraAttachedWithOffset(class UNiagaraSystem* NiagaraSystem, class USceneComponent* Mesh, class FName SocketName, struct FVector& PointLocation, bool ApplyOffset);
	void SpawnMultipleDecalsAtLocation(TArray<class UMaterialInterface*>& DecalMaterials, const struct FDecalRandomizationData& RandomizationData, struct FVector& Size, struct FVector& Location, struct FRotator& Rotation, float LifeSpan);
	void SpawnMultipleDecalsAroundActor(TArray<class UMaterialInterface*>& DecalMaterials, const struct FDecalRandomizationData& RandomizationData, class AActor* Actor, struct FVector& Size, struct FRotator& Rotation, float LifeSpan);
	class UDecalComponent* SpawnDecalAtLocation(class UMaterialInterface* DecalMaterial, const struct FDecalRandomizationData& RandomizationData, struct FVector& Size, struct FVector& Location, struct FRotator& Rotation, float LifeSpan);
	void NotifyDebug();
	bool GetDebugDisplayVFXDirection();
	bool GetDebugDisplayVFXAttackType();
	void DisplayHitDebugInfo(class AActor* CharacterActor, class AActor* Hitactor, struct FVector& TraceStart, struct FVector& TraceEnd, bool IsSphere, int32 Radius, class UPhysicalMaterial* PhysicalMaterial, struct FVector& ImpactPoint, const struct FColor& DebugColorLine);
};

// 0x10 (0x468 - 0x458)
// Class LOTF2.AnathemaGameplayCueNotify_Burst
class UAnathemaGameplayCueNotify_Burst : public UGameplayCueNotify_Burst
{
public:
	TArray<struct FAkAnathemaEvent>              AkAnathemaEvents;                                  // 0x458(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnathemaGameplayCueNotify_Burst* GetDefaultObj();

};

// 0x10 (0x780 - 0x770)
// Class LOTF2.AnathemaGameplayCueNotify_BurstLatent
class AAnathemaGameplayCueNotify_BurstLatent : public AGameplayCueNotify_BurstLatent
{
public:
	TArray<struct FAkAnathemaEvent>              AkAnathemaEvents;                                  // 0x770(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAnathemaGameplayCueNotify_BurstLatent* GetDefaultObj();

};

// 0xB0 (0x518 - 0x468)
// Class LOTF2.AnathemaGameplayCueNotify_EnvironmentHit
class UAnathemaGameplayCueNotify_EnvironmentHit : public UAnathemaGameplayCueNotify_Burst
{
public:
	struct FAkAnathemaEvent                      AkAnathemaEventEnvironment;                        // 0x468(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FAkAnathemaEvent                      AkAnathemaEventWeapon;                             // 0x4B8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UEnvironmentHitFXData*                 EnvironmentHitFXData;                              // 0x508(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAnathemaEnvironemntHitFXIntensity HitIntensity;                                      // 0x510(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2657[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaGameplayCueNotify_EnvironmentHit* GetDefaultObj();

};

// 0x58 (0x1310 - 0x12B8)
// Class LOTF2.AnathemaGameplayCueNotify_Looping
class AAnathemaGameplayCueNotify_Looping : public AGameplayCueNotify_Looping
{
public:
	TArray<struct FAkAnathemaEvent>              ApplicationAkAnathemaEvents;                       // 0x12B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAkAnathemaEvent>              LoopingAkAnathemaEvents;                           // 0x12C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAkAnathemaEvent>              RecurringAkAnathemaEvents;                         // 0x12D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAkAnathemaEvent>              RemovalAkAnathemaEvents;                           // 0x12E8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint32                                       TransitionDuration_ms;                             // 0x12F8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAkCurveInterpolation             EFadeCuve;                                         // 0x12FC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2658[0x13];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAnathemaGameplayCueNotify_Looping* GetDefaultObj();

	class UGameplayAbility* GetAbility(struct FGameplayCueParameters& Parameters);
};

// 0x0 (0x38 - 0x38)
// Class LOTF2.HexDeveloperSettings
class UHexDeveloperSettings : public UDeveloperSettings
{
public:

	static class UClass* StaticClass();
	static class UHexDeveloperSettings* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class LOTF2.AnathemaGameSystemsSettings
class UAnathemaGameSystemsSettings : public UHexDeveloperSettings
{
public:
	TSubclassOf<class UPickupFactory>            PickupFactoryClass;                                // 0x38(0x8)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UInventoryItemFactory>     InventoryItemFactoryClass;                         // 0x40(0x8)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnathemaGameSystemsSettings* GetDefaultObj();

};

// 0x30 (0x60 - 0x30)
// Class LOTF2.AnathemaGameSystems
class UAnathemaGameSystems : public UWorldSubsystem
{
public:
	class UPickupFactory*                        PickupFactory;                                     // 0x30(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInventoryItemFactory*                 InventoryItemFactory;                              // 0x38(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpawnDirector*                        SpawnDirector;                                     // 0x40(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULOTF2AI*                              LOTF2AI;                                           // 0x48(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPropSettings*                         PropSettings;                                      // 0x50(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2659[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaGameSystems* GetDefaultObj();

	void OnGameModeInitialized(class AGameModeBase* GameMode);
	class USpawnDirector* GetSpawnDirector();
	class UPropSettings* GetPropSettings();
	void FlushCurrentWorldStreaming();
};

// 0xD0 (0x518 - 0x448)
// Class LOTF2.AnathemaHitReactAbility
class UAnathemaHitReactAbility : public UAnathemaGameplayAbility
{
public:
	TArray<struct FHitReactData>                 HitReactions;                                      // 0x448(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FHitReactEventData> HitReactionEvents;                                 // 0x458(0x50)(Edit, NativeAccessSpecifierPublic)
	bool                                         ApplyAdditionalRotation;                           // 0x4A8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_265A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              AdditionalRotationCorrection;                      // 0x4B0(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UCurveFloat*                           DynamicKnockbackCurve;                             // 0x4C8(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequiresMontage;                                  // 0x4D0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_265B[0x27];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UHexAICharacterMovementComponent*      MovementComponent;                                 // 0x4F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_265C[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaHitReactAbility* GetDefaultObj();

	void OnProtoSecondaryInterruptsTimingArrived();
	void OnProtoPrimaryInterruptsTimingArrived();
	void OnMontageDone(enum class EOnMontageDoneReason DoneReason);
	class UAnimMontage* GetCustomAnimMontageByTag(struct FGameplayTag& AnimationTag);
};

// 0x20 (0x2C0 - 0x2A0)
// Class LOTF2.LOTF2GameplayActor
class ALOTF2GameplayActor : public AActor
{
public:
	uint8                                        Pad_265D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAbilitySystemComponentCreationPolicy AbilitySystemComponentCreationPolicy;              // 0x2A8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_265E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnathemaAbilitySystemComponent*       AbilitySystemComponent;                            // 0x2B0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnathemaAbilitySystemComponent*       ReplicatedAbilitySystemComponent;                  // 0x2B8(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ALOTF2GameplayActor* GetDefaultObj();

	void OnRep_ReplicatedAbilitySystemComponent();
};

// 0x98 (0x358 - 0x2C0)
// Class LOTF2.AnathemaSyncedInteractable
class AAnathemaSyncedInteractable : public ALOTF2GameplayActor
{
public:
	class USceneComponent*                       UIRootComponent;                                   // 0x2C0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractionComponent*                 InteractionComponent;                              // 0x2C8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHexSyncedAnimComponent*               SyncedAnimComponent;                               // 0x2D0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULOTF2SerializationComponent*          SerializationComponent;                            // 0x2D8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FInteractableState> InteractableStates;                                // 0x2E0(0x50)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FName                                  DefaultState;                                      // 0x330(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USkeletalMeshComponent*>        InteractableSkeletalMeshComponents;                // 0x338(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FInteractableCurrentState             CurrentState;                                      // 0x348(0xC)(BlueprintVisible, BlueprintReadOnly, Net, SaveGame, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_265F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAnathemaSyncedInteractable* GetDefaultObj();

	void TransitionToState(class FName NewState, class UInteractionContext* Context);
	void OnSyncedAnimationFinished();
	void OnStateTransitionStart(class FName State);
	void OnStateSet(class FName State);
	void OnRep_CurrentState();
	void OnInteraction(class UInteractionContext* InteractionContext);
	struct FInteractableCurrentState GetCurrentState();
};

// 0x150 (0x4A8 - 0x358)
// Class LOTF2.AnathemaInteractableDoor
class AAnathemaInteractableDoor : public AAnathemaSyncedInteractable
{
public:
	class ULockComponent*                        LockComponent;                                     // 0x358(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanOpen;                                          // 0x360(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2661[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class FName>               SlotsToIncorrectSideStates;                        // 0x368(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>               SlotsToOpenStates;                                 // 0x3B8(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>               SlotsToFailedToUnlockStates;                       // 0x408(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                         bIsOpen;                                           // 0x458(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2662[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class AAkAcousticPortal>      AcousticPortal;                                    // 0x460(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        AcousticPortalOpenDelaySeconds;                    // 0x490(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        AcousticPortalCloseDelaySeconds;                   // 0x494(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  KOpenStateName;                                    // 0x498(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  KOpenAltStateName;                                 // 0x4A0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AAnathemaInteractableDoor* GetDefaultObj();

	void Reset();
	bool IsOpen();
	void HandleOpen(const struct FDoorActionContext& DoorActionContext);
	class ULockComponent* GetLockComponent();
	class AAkAcousticPortal* GetAcousticPortal();
	bool CanInteract(class UInteractionContext* InteractionContext);
};

// 0x58 (0x3B0 - 0x358)
// Class LOTF2.AnathemaItemContainer
class AAnathemaItemContainer : public AAnathemaSyncedInteractable
{
public:
	class USphereComponent*                      InteractionTrigger;                                // 0x358(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UItemData*>                     Contents;                                          // 0x360(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<TSoftClassPtr<class UItemData>>       LootContent;                                       // 0x370(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   LootTable;                                         // 0x380(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bHasBeenOpened;                                    // 0x390(0x1)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAutoAddItemToInventory;                           // 0x391(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2664[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           CurrentInteractorController;                       // 0x398(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2665[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAnathemaItemContainer* GetDefaultObj();

	bool TryOpenInteraction(class AActor* Interactor);
	struct FDataTableRowHandle GetLootTable();
	bool GetHasBeenOpened();
	void AddItemToInventory();
};

// 0x60 (0x308 - 0x2A8)
// Class LOTF2.AnathemaLevelScript
class AAnathemaLevelScript : public ALevelScriptActor
{
public:
	uint8                                        Pad_2666[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AProxyManager*                         ProxyManager;                                      // 0x2F8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bShouldCreateWitherSubsystem;                      // 0x300(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2667[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAnathemaLevelScript* GetDefaultObj();

};

// 0xD8 (0x110 - 0x38)
// Class LOTF2.AnathemaSoundManagerSettings
class UAnathemaSoundManagerSettings : public UHexDeveloperSettings
{
public:
	class FString                                ControllerSpeakerBusName;                          // 0x38(0x10)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                MotionBusName;                                     // 0x48(0x10)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                Master_BusVolume;                                  // 0x58(0x10)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                SFX_BusVolume;                                     // 0x68(0x10)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                Music_BusVolume;                                   // 0x78(0x10)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                VO_BusVolume;                                      // 0x88(0x10)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                Environment_BusVolume;                             // 0x98(0x10)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                ControllerSpeaker_BusVolume;                       // 0xA8(0x10)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        HexOcclusionRefreshInterval;                       // 0xB8(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2668[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAkAnathemaEvent                      QuestItemAudio;                                    // 0xC0(0x50)(Edit, Config, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnathemaSoundManagerSettings* GetDefaultObj();

};

// 0x40 (0x70 - 0x30)
// Class LOTF2.AnathemaSoundManager
class UAnathemaSoundManager : public UWorldSubsystem
{
public:
	uint8                                        Pad_266F[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaSoundManager* GetDefaultObj();

	void SpawnAkEventAtLocationAndPostOnAkComponent(struct FAkAnathemaEvent& AkAnathemaEvent, const struct FVector& Location, const struct FRotator& Orientation, class UWorld* In_World, class UAkSwitchValue* AkSwitch);
	void SetSwitchOnPlayer(class FName Scope, class UAkSwitchValue* AkSwitch, int32 PlayerIndex);
	void SetSwitchOnAkComponent(class UAkComponent* AkComponent, class FName Scope, class UAkSwitchValue* AkSwitch);
	void SetSwitchOnActor(class AActor* Actor, class FName Scope, class UAkSwitchValue* AkSwitch);
	void SetRtpcOnPlayer(class UAkRtpc* RTPC, float Val, int32 InterpolationTimeMs, int32 PlayerIndex);
	void SetRtpcOnAkComponent(class UAkComponent* AkComponent, class UAkRtpc* RTPC, float Val, int32 InterpolationTimeMs);
	void SetRtpcOnActor(class AActor* Actor, class UAkRtpc* RTPC, float Val, int32 InterpolationTimeMs);
	void SetRtpcGlobal(const class FString& RtpcName, float Val);
	void PostAkAnathemaEventOnPlayer(struct FAkAnathemaEvent& AkAnathemaEvent, int32 PlayerIndex);
	void PostAkAnathemaEventOnLocation(struct FAkAnathemaEvent& AkAnathemaEvent, struct FVector& Location, struct FRotator& Rotation);
	void PostAkAnathemaEventOnAkComponent(struct FAkAnathemaEvent& AkAnathemaEvent, class UAkComponent* AkComponent);
	void PostAkAnathemaEventOnActor(struct FAkAnathemaEvent& AkAnathemaEvent, class AActor* PlayingActor);
	void PostAkAnathemaEventFromGameplayCueNotify(struct FAkAnathemaEvent& AkAnathemaEvent, class AActor* Target, bool ShouldAttachToTarget, class UObject* GcObjectForDebug);
	void OnAkPostEventCallback(enum class EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void MulticastPostAkAnathemaEventAtLocation(struct FAkAnathemaEvent& AkAnathemaEvent, struct FVector& Location, struct FRotator& Rotation, class UWorld* World);
	void GlobalMuteSwitch();
	void CallGlobalMuteSwitch();
};

// 0xD0 (0x150 - 0x80)
// Class LOTF2.AnathemaTask_PlayMontage
class UAnathemaTask_PlayMontage : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBlendOut;                                        // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnInterrupted;                                     // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCancelled;                                       // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDone;                                            // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNotifyBegin;                                     // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNotifyEnd;                                       // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAnimMontage*                          MontageToPlay;                                     // 0xF0(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Rate;                                              // 0xF8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  StartSection;                                      // 0xFC(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AnimRootMotionTranslationScale;                    // 0x104(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StartTimeSeconds;                                  // 0x108(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStopWhenAbilityEnds;                              // 0x10C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bForceDisableAutoBlendOut;                         // 0x10D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EHexFocusDirectionUpdateMode      FocusUpdateMode;                                   // 0x10E(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2697[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideBlendInTime;                               // 0x110(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2698[0x3C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaTask_PlayMontage* GetDefaultObj();

	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void OnAbilityCanceled();
	void HandleOnPlayMontageNotifyEnd(class FName NotifyName, struct FBranchingPointNotifyPayload& Payload);
	void HandleOnPlayMontageNotifyBegin(class FName NotifyName, struct FBranchingPointNotifyPayload& Payload);
	class UAnathemaTask_PlayMontage* CreatePlayMontageTask_Dynamic(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UAnimSequenceBase* AnimSequence, float PlayRate, class FName Slot, float BlendInTime, float BlendOutTime, int32 LoopCount, float BlendOutTriggerTime, float StartTime);
	class UAnathemaTask_PlayMontage* CreatePlayMontageTask_BlendSpaceDynamic(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UBlendSpace* BlendSpace, const struct FVector& BlendSpaceInput, float PlayRate, class FName Slot, float BlendInTime, float BlendOutTime, int32 LoopCount, float BlendOutTriggerTime, float StartTime);
	class UAnathemaTask_PlayMontage* CreatePlayMontageTask(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UAnimationAsset* Anim, float PlayRate, float BlendInTime, float BlendOutTime, class FName StartSection, const struct FVector& BlendSpaceInput);
	class UAnathemaTask_PlayMontage* CreatePlayMontageProxyGroupedParameters(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, struct FCreatePlayMontageProxyParameters& Parameters);
	class UAnathemaTask_PlayMontage* CreatePlayMontageProxy(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UAnimMontage* MontageToPlay, float Rate, class FName StartSection, bool bStopWhenAbilityEnds, enum class EHexFocusDirectionUpdateMode FocusUpdateMode, float AnimRootMotionTranslationScale, float StartTimeSeconds, bool bForceDisableAutoBlendOut, float OverrideBlendInTime);
};

// 0x30 (0x98 - 0x68)
// Class LOTF2.AnathemaTask_WaitGameplayEvent
class UAnathemaTask_WaitGameplayEvent : public UGameplayTask
{
public:
	FMulticastInlineDelegateProperty_            EventReceived;                                     // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                        Pad_269D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAbilitySystemComponent*               OptionalExternalTarget;                            // 0x80(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_269E[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaTask_WaitGameplayEvent* GetDefaultObj();

	class UAnathemaTask_WaitGameplayEvent* WaitGameplayEvent(class AActor* TargetActor, const struct FGameplayTag& EventTag, bool OnlyTriggerOnce, bool OnlyMatchExact);
};

// 0x8 (0x30 - 0x28)
// Class LOTF2.AnathemaTickableObject
class UAnathemaTickableObject : public UObject
{
public:
	uint8                                        Pad_269F[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnathemaTickableObject* GetDefaultObj();

};

// 0x0 (0x278 - 0x278)
// Class LOTF2.AnathamaWidget
class UAnathamaWidget : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAnathamaWidget* GetDefaultObj();

	void OnControllerNewPawn(class APawn* PPawn);
	void OnControllerEndPlay(class APawn* PPawn);
	void OnControllerBeginPlay(class APawn* PPawn);
};

// 0x8 (0x590 - 0x588)
// Class LOTF2.AnchorForbiddenAreaComponent
class UAnchorForbiddenAreaComponent : public UBoxComponent
{
public:
	uint8                                        Pad_26A2[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnchorForbiddenAreaComponent* GetDefaultObj();

};

// 0x0 (0x2D8 - 0x2D8)
// Class LOTF2.AnchorForbiddenVolume
class AAnchorForbiddenVolume : public AVolume
{
public:

	static class UClass* StaticClass();
	static class AAnchorForbiddenVolume* GetDefaultObj();

};

// 0x8 (0x590 - 0x588)
// Class LOTF2.AnchorForgingAreaComponent
class UAnchorForgingAreaComponent : public UBoxComponent
{
public:
	uint8                                        Pad_26A6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnchorForgingAreaComponent* GetDefaultObj();

	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
};

// 0x0 (0x2E8 - 0x2E8)
// Class LOTF2.AnchorForgingAreaVolume
class AAnchorForgingAreaVolume : public APhysicsVolume
{
public:

	static class UClass* StaticClass();
	static class AAnchorForgingAreaVolume* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class LOTF2.AnchorMenuInterface
class IAnchorMenuInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAnchorMenuInterface* GetDefaultObj();

};

// 0x260 (0x738 - 0x4D8)
// Class LOTF2.AnchorMenuWidget
class UAnchorMenuWidget : public UHexActivatableWidget
{
public:
	FMulticastInlineDelegateProperty_            OnAnchorMenuClosed;                                // 0x4D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAnchorMenuOpened;                                // 0x4E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonTextBlock*                      Text_FastTravel;                                   // 0x4F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          Button_Panel;                                      // 0x500(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBackgroundBlur*                       Blur;                                              // 0x508(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_UpgradeCharacter;                           // 0x510(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_UpgradeEquipment;                           // 0x518(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_Resurrect;                                  // 0x520(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_ResurrectPartner;                           // 0x528(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_FastTravel;                                 // 0x530(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_Multiplayer;                                // 0x538(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_LogIn;                                      // 0x540(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_LogIn;                                        // 0x548(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       MultiplayerSwitcher;                               // 0x550(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_StartMatchmaking;                           // 0x558(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_StopMatchmaking;                            // 0x560(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_InviteFriends;                              // 0x568(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_StartJoining;                               // 0x570(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_StopJoining;                                // 0x578(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_StartInvading;                              // 0x580(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_StopInvading;                               // 0x588(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_ProtoRunes;                                 // 0x590(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_NewGamePlus;                                // 0x598(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_NewGamePlus;                                  // 0x5A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableButtonWidget*                Button_Back;                                       // 0x5A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                              Container_ResurrectPartner;                        // 0x5B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UHexActivatableWidget>   Upgrade_Character_Widget;                          // 0x5B8(0x30)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UHexActivatableWidget>   Upgrade_Equipment_Widget;                          // 0x5E8(0x30)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UHexActivatableWidget>   Upgrade_HealthPotion_Widget;                       // 0x618(0x30)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UHexActivatableWidget>   Fast_Travel_Widget;                                // 0x648(0x30)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UOnlineLobbyScreenWidget> Online_Lobby_Widget;                               // 0x678(0x30)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UCommonActivatableWidget> Proto_RunesScreen_Widget;                          // 0x6A8(0x30)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  LoginFailedText;                                   // 0x6D8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  CreateSessionFailedText;                           // 0x6F0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_26C6[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnchorMenuWidget* GetDefaultObj();

	void ProcessOnlineButtonVisibilityDynamic(class ALOTF2WorldGameSession* GameSession);
	void OnUpgradeHealthPotion();
	void OnUpgradeEquipment();
	void OnUpgradeCharacter();
	void OnReturnToForgedAnchor();
	void OnResurrectPartner();
	void OnResurrect();
	void OnOpenProtoRunes();
	void OnInterrupted();
	void OnFastTravel();
	void OnCloseAnchorMenu();
	void OnAnchorMenuReady();
	void OnAnchorDestroyed(class AActor* DestroyedActor);
	bool IsReturnToForgedAnchorAvailable();
	void HandleStopMatchmaking();
	void HandleStopJoining();
	void HandleStopInvading();
	void HandleStartMatchmaking();
	void HandleStartJoining();
	void HandleStartInvading();
	void HandlePlayerStateAdded(class APlayerState* PlayerState);
	void HandleNewGamePlus();
	void HandleMultiplayerButton();
	void HandleLogInButton();
	void HandleInviteFriends();
	void HandleButtonBackMultiplayer();
	class ADualRealmAnchorActor* GetAnchorActor();
	void CloseMenu();
	void BP_LevelUpAvailable(bool bLevelUpAvailable);
};

// 0x18 (0x60 - 0x48)
// Class LOTF2.AngleConsideration
class UAngleConsideration : public UAIConsideration
{
public:
	class UCurveFloat*                           Curve;                                             // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EeAIDirection                     Direction;                                         // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26C7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AngleToCheck;                                      // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26C8[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAngleConsideration* GetDefaultObj();

};

// 0x38 (0x2E0 - 0x2A8)
// Class LOTF2.AnimatedImage
class UAnimatedImage : public UImage
{
public:
	FMulticastInlineDelegateProperty_            OnAnimationDone;                                   // 0x2A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        FramesPerSecond;                                   // 0x2B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurrentFrame;                                      // 0x2BC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        TotalFrames;                                       // 0x2C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bLoopAnimation;                                    // 0x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26C9[0x1B];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimatedImage* GetDefaultObj();

	void Stop();
	void SetTargetFrame(int32 Frame);
	void SetCurrentFrame(int32 Frame);
	void Play();
	int32 GetTotalFrames();
};

// 0x10 (0x40 - 0x30)
// Class LOTF2.AnimationAttributeSet
class UAnimationAttributeSet : public UAttributeSet
{
public:
	struct FGameplayAttributeData                AnimationPlayRate;                                 // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimationAttributeSet* GetDefaultObj();

	void OnRep_AnimationPlayRate(struct FGameplayAttributeData& OldPlayRate);
};

// 0x5D0 (0x600 - 0x30)
// Class LOTF2.AnimationData
class UAnimationData : public UPrimaryDataAsset
{
public:
	struct FCharacterAnimationsConfig            Animations;                                        // 0x30(0x5D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimationData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class LOTF2.AnimNotifyCustomBeginEndInterface
class IAnimNotifyCustomBeginEndInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAnimNotifyCustomBeginEndInterface* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class LOTF2.AnimNotifyState_ActionDirection
class UAnimNotifyState_ActionDirection : public UAnimNotifyState
{
public:
	class FName                                  WeaponSocketName;                                  // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEquipableInventoryWeapon*             WeaponToTrack;                                     // 0x38(0x8)(BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_26CC[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_ActionDirection* GetDefaultObj();

};

// 0xB8 (0xE8 - 0x30)
// Class LOTF2.AnimNotifyState_AkAnathemaEvent
class UAnimNotifyState_AkAnathemaEvent : public UAnimNotifyState
{
public:
	class FName                                  AttachName;                                        // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          AkAnathemaEventOverrideTagBegin;                   // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAkAnathemaEvent                      AkStartEvent;                                      // 0x40(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          AkAnathemaEventOverrideTagEnd;                     // 0x90(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAkAnathemaEvent                      AkEndEvent;                                        // 0x98(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_AkAnathemaEvent* GetDefaultObj();

};

// 0x70 (0xA0 - 0x30)
// Class LOTF2.AnimNotifyState_BaseConditionalTag
class UAnimNotifyState_BaseConditionalTag : public UAnimNotifyState
{
public:
	uint8                                        Pad_26D0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FConditionalTagNotifySettings         ConditionalTagSettings;                            // 0x38(0x60)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bAllowInstantCustomNotifiesOnFrameZero;            // 0x98(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26D1[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_BaseConditionalTag* GetDefaultObj();

	void StoreCustomData(class UObject* CustomData, class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, int32 MontageInstanceID);
	bool ShouldTriggerNotify(class USkeletalMeshComponent* MeshComp);
	class FName GetNotifyIdentifier(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	void BP_NotifyTickImplementation(class USkeletalMeshComponent* SkeletalMeshComponent, class UAnimSequenceBase* Animation, float FrameDeltaTime, class UObject* CustomData);
	void BP_NotifyEndImplementation(class USkeletalMeshComponent* SkeletalMeshComponent, class UAnimSequenceBase* Animation, class UObject* CustomData);
	void BP_NotifyBeginImplementation(class USkeletalMeshComponent* SkeletalMeshComponent, class UAnimSequenceBase* Animation, float TotalDuration, int32 MontageInstanceID);
};

// 0x10 (0xB0 - 0xA0)
// Class LOTF2.AnimNotifyState_AutonomousAbility
class UAnimNotifyState_AutonomousAbility : public UAnimNotifyState_BaseConditionalTag
{
public:
	struct FDataTableRowHandle                   AutonomousAbilityDefinitionHandle;                 // 0xA0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_AutonomousAbility* GetDefaultObj();

};

// 0x0 (0xA0 - 0xA0)
// Class LOTF2.AnimNotifyState_BaseGameplayEffect
class UAnimNotifyState_BaseGameplayEffect : public UAnimNotifyState_BaseConditionalTag
{
public:

	static class UClass* StaticClass();
	static class UAnimNotifyState_BaseGameplayEffect* GetDefaultObj();

	void BP_ModifySpecHandle(const struct FGameplayEffectSpecHandle& SpecHandle);
};

// 0x60 (0x198 - 0x138)
// Class LOTF2.AnimNotifyState_ConditionalTimedNiagaraEffectAdvanced
class UAnimNotifyState_ConditionalTimedNiagaraEffectAdvanced : public UAnimNotifyState_TimedNiagaraEffectAdvanced
{
public:
	struct FConditionalTagNotifySettings         ConditionalTagSettings;                            // 0x138(0x60)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_ConditionalTimedNiagaraEffectAdvanced* GetDefaultObj();

};

// 0x8 (0xA8 - 0xA0)
// Class LOTF2.AnimNotifyState_FacingAngleCorrection
class UAnimNotifyState_FacingAngleCorrection : public UAnimNotifyState_BaseGameplayEffect
{
public:
	float                                        FacingAngleCorrection;                             // 0xA0(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26D2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_FacingAngleCorrection* GetDefaultObj();

};

// 0x58 (0x88 - 0x30)
// Class LOTF2.AnimNotifyState_FrameTiming
class UAnimNotifyState_FrameTiming : public UAnimNotifyState
{
public:
	TMap<class FName, int32>                     SectionsFrameTimings;                              // 0x30(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bRealFrames;                                       // 0x80(0x1)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26D5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_FrameTiming* GetDefaultObj();

	bool IsRealFrames();
};

// 0x8 (0xA8 - 0xA0)
// Class LOTF2.AnimNotifyState_GameplayEffect
class UAnimNotifyState_GameplayEffect : public UAnimNotifyState_BaseGameplayEffect
{
public:
	TSubclassOf<class UGameplayEffect>           GameplayEffect;                                    // 0xA0(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_GameplayEffect* GetDefaultObj();

};

// 0x10 (0xB0 - 0xA0)
// Class LOTF2.AnimNotifyState_GameplayTag
class UAnimNotifyState_GameplayTag : public UAnimNotifyState_BaseConditionalTag
{
public:
	struct FGameplayTag                          GameplayTag;                                       // 0xA0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldRemoveOnEnd;                                // 0xA8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26D7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_GameplayTag* GetDefaultObj();

};

// 0x88 (0x128 - 0xA0)
// Class LOTF2.AnimNotifyState_NiagaraTrail
class UAnimNotifyState_NiagaraTrail : public UAnimNotifyState_BaseConditionalTag
{
public:
	struct FNiagaraSystem_WithParams             Template_WithParams;                               // 0xA0(0x58)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                  FirstSocketName;                                   // 0xF8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SecondSocketName;                                  // 0x100(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOffset;                                    // 0x108(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDestroyAtEnd;                                     // 0x120(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26DD[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_NiagaraTrail* GetDefaultObj();

	class UFXSystemComponent* GetSpawnedEffect(class UMeshComponent* MeshComp);
};

// 0x50 (0x80 - 0x30)
// Class LOTF2.AnimNotifyState_PropEffect
class UAnimNotifyState_PropEffect : public UAnimNotifyState
{
public:
	class UNiagaraSystem*                        Template;                                          // 0x30(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPropJoint                        PropJoint;                                         // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26E0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SocketName;                                        // 0x3C(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26E1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocationOffset;                                    // 0x48(0x18)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationOffset;                                    // 0x60(0x18)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bDestroyAtEnd;                                     // 0x78(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26E2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_PropEffect* GetDefaultObj();

};

// 0x8 (0x130 - 0x128)
// Class LOTF2.AnimNotifyState_PropNiagaraTrail
class UAnimNotifyState_PropNiagaraTrail : public UAnimNotifyState_NiagaraTrail
{
public:
	enum class EPropJoint                        PropJoint;                                         // 0x128(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFEquipmentSlot                   EquipmentSlot;                                     // 0x129(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26E4[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_PropNiagaraTrail* GetDefaultObj();

};

// 0x68 (0xC0 - 0x58)
// Class LOTF2.AnimNotifyState_PropTrail
class UAnimNotifyState_PropTrail : public UAnimNotifyState_Trail
{
public:
	enum class EPropJoint                        PropJoint;                                         // 0x58(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26E6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FConditionalTagNotifySettings         ConditionalTagSettings;                            // 0x60(0x60)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_PropTrail* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class LOTF2.AnimNotifyState_StopAILogic
class UAnimNotifyState_StopAILogic : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UAnimNotifyState_StopAILogic* GetDefaultObj();

};

// 0x120 (0x1C0 - 0xA0)
// Class LOTF2.AnimNotifyState_SubAutonomousAbilityBase
class UAnimNotifyState_SubAutonomousAbilityBase : public UAnimNotifyState_BaseConditionalTag
{
public:
	struct FSpawnDefinition                      SpawnDefinition;                                   // 0xA0(0x120)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_SubAutonomousAbilityBase* GetDefaultObj();

};

// 0x8 (0x1C8 - 0x1C0)
// Class LOTF2.AnimNotifyState_SubAutonomousAbility
class UAnimNotifyState_SubAutonomousAbility : public UAnimNotifyState_SubAutonomousAbilityBase
{
public:
	TSubclassOf<class USubAutonomousAbilityData> SubAutonomousAbilityData;                          // 0x1C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_SubAutonomousAbility* GetDefaultObj();

};

// 0x8 (0x1C8 - 0x1C0)
// Class LOTF2.AnimNotifyState_SAA_Projectile
class UAnimNotifyState_SAA_Projectile : public UAnimNotifyState_SubAutonomousAbilityBase
{
public:
	TSubclassOf<class USAA_ProjectileData>       SubAutonomousAbilityData;                          // 0x1C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_SAA_Projectile* GetDefaultObj();

};

// 0x60 (0x98 - 0x38)
// Class LOTF2.AnimNotify_BaseConditionalTag
class UAnimNotify_BaseConditionalTag : public UAnimNotify
{
public:
	struct FConditionalTagNotifySettings         ConditionalTagSettings;                            // 0x38(0x60)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_BaseConditionalTag* GetDefaultObj();

	void BP_NotifyImplementation(class USkeletalMeshComponent* SkeletalMeshComponent, class UAnimSequenceBase* Animation);
};

// 0xD0 (0x168 - 0x98)
// Class LOTF2.AnimNotify_AkAnathemaEvent
class UAnimNotify_AkAnathemaEvent : public UAnimNotify_BaseConditionalTag
{
public:
	class FName                                  AttachName;                                        // 0x98(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bFollow;                                           // 0xA0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26ED[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAkAnathemaEvent                      AkAnathemaSwitchEvent;                             // 0xA8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          AkAnathemaEventOverrideTag;                        // 0xF8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAkAnathemaEvent                      AkAnathemaEvent;                                   // 0x100(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                        VisualFX;                                          // 0x150(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  VisualAttachName;                                  // 0x158(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         ApplySwitchForWeaponHit;                           // 0x160(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFEquipmentSlot                   EquipmentSlot;                                     // 0x161(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTriggerSubtitles;                                 // 0x162(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26EF[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_AkAnathemaEvent* GetDefaultObj();

};

// 0x20 (0xB8 - 0x98)
// Class LOTF2.AnimNotify_AutonomousAbility
class UAnimNotify_AutonomousAbility : public UAnimNotify_BaseConditionalTag
{
public:
	struct FDataTableRowHandle                   AutonomousAbilityDefinitionHandle;                 // 0x98(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_26F4[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_AutonomousAbility* GetDefaultObj();

};

// 0x60 (0x180 - 0x120)
// Class LOTF2.AnimNotify_ConditionalNiagaraEffect
class UAnimNotify_ConditionalNiagaraEffect : public UAnimNotify_PlayNiagaraEffect
{
public:
	struct FConditionalTagNotifySettings         ConditionalTagSettings;                            // 0x120(0x60)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_ConditionalNiagaraEffect* GetDefaultObj();

};

// 0x18 (0x50 - 0x38)
// Class LOTF2.AnimNotify_DamageTarget
class UAnimNotify_DamageTarget : public UAnimNotify
{
public:
	struct FDataTableRowHandle                   AttackDamageDefinitionHandle;                      // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	enum class EFEquipmentSlot                   SlotToUse;                                         // 0x48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPropJoint                        PropToUse;                                         // 0x49(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EReferenceActor                   ActorToDamage;                                     // 0x4A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26F8[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_DamageTarget* GetDefaultObj();

};

// 0x38 (0x70 - 0x38)
// Class LOTF2.AnimNotify_EnvironmentHit
class UAnimNotify_EnvironmentHit : public UAnimNotify
{
public:
	struct FGameplayCueTag                       GameplayCue;                                       // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               HitOffset;                                         // 0x40(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HitTestRadius;                                     // 0x58(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  RootBoneName;                                      // 0x5C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26FA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPhysicalMaterial*                     PreviewPhysicsMaterial;                            // 0x68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_EnvironmentHit* GetDefaultObj();

};

// 0x28 (0x190 - 0x168)
// Class LOTF2.AnimNotify_FootstepEvent
class UAnimNotify_FootstepEvent : public UAnimNotify_AkAnathemaEvent
{
public:
	class FString                                NotifyName;                                        // 0x168(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFootstepEventData*                    FootstepData;                                      // 0x178(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bFindSurfaceByVolume;                              // 0x180(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26FB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FindSurfaceByVolumeRadius;                         // 0x184(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TraceLength;                                       // 0x188(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26FC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_FootstepEvent* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class LOTF2.AnimNotify_GameplayEffect
class UAnimNotify_GameplayEffect : public UAnimNotify_BaseConditionalTag
{
public:
	TSubclassOf<class UGameplayEffect>           GameplayEffect;                                    // 0x98(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_GameplayEffect* GetDefaultObj();

};

// 0x8 (0xA8 - 0xA0)
// Class LOTF2.AnimNotify_GameplayEffectToBBActor
class UAnimNotify_GameplayEffectToBBActor : public UAnimNotify_GameplayEffect
{
public:
	class FName                                  TargetActorBlackboardKey;                          // 0xA0(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_GameplayEffectToBBActor* GetDefaultObj();

};

// 0xB0 (0x148 - 0x98)
// Class LOTF2.AnimNotify_GameplayEvent
class UAnimNotify_GameplayEvent : public UAnimNotify_BaseConditionalTag
{
public:
	struct FGameplayEventData                    NotifyEvent;                                       // 0x98(0xB0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_GameplayEvent* GetDefaultObj();

};

// 0x50 (0xC8 - 0x78)
// Class LOTF2.AnimNotify_HexGameplayCue
class UAnimNotify_HexGameplayCue : public UAnimNotify_GameplayCue
{
public:
	struct FGameplayTagQuery                     OwnedTagsCondition;                                // 0x78(0x48)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bIgnoreConditionInEditorPreview;                   // 0xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26FE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_HexGameplayCue* GetDefaultObj();

	bool FulfillsCondition(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
};

// 0x50 (0xB8 - 0x68)
// Class LOTF2.AnimNotify_HexGameplayCueState
class UAnimNotify_HexGameplayCueState : public UAnimNotify_GameplayCueState
{
public:
	struct FGameplayTagQuery                     OwnedTagsCondition;                                // 0x68(0x48)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bIgnoreConditionInEditorPreview;                   // 0xB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2700[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_HexGameplayCueState* GetDefaultObj();

	bool FulfillsCondition(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
};

// 0x8 (0xA8 - 0xA0)
// Class LOTF2.AnimNotify_ScaleRootMotion
class UAnimNotify_ScaleRootMotion : public UAnimNotifyState_BaseConditionalTag
{
public:
	float                                        RootMotionScale;                                   // 0xA0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2701[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_ScaleRootMotion* GetDefaultObj();

};

// 0x18 (0xB8 - 0xA0)
// Class LOTF2.AnimNotify_ScaleRootMotionDynamic
class UAnimNotify_ScaleRootMotionDynamic : public UAnimNotifyState_BaseConditionalTag
{
public:
	struct FFloatRange                           RootMotionScaleLimits;                             // 0xA0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        OffsetDistanceToTarget;                            // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowDebug;                                        // 0xB4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2702[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_ScaleRootMotionDynamic* GetDefaultObj();

};

// 0x120 (0x1B8 - 0x98)
// Class LOTF2.AnimNotify_SubAutonomousAbilityBase
class UAnimNotify_SubAutonomousAbilityBase : public UAnimNotify_BaseConditionalTag
{
public:
	struct FSpawnDefinition                      SpawnDefinition;                                   // 0x98(0x120)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_SubAutonomousAbilityBase* GetDefaultObj();

};

// 0x8 (0x1C0 - 0x1B8)
// Class LOTF2.AnimNotify_SubAutonomousAbility
class UAnimNotify_SubAutonomousAbility : public UAnimNotify_SubAutonomousAbilityBase
{
public:
	TSubclassOf<class USubAutonomousAbilityData> SubAutonomousAbilityData;                          // 0x1B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_SubAutonomousAbility* GetDefaultObj();

};

// 0x8 (0x1C0 - 0x1B8)
// Class LOTF2.AnimNotify_SAA_Projectile
class UAnimNotify_SAA_Projectile : public UAnimNotify_SubAutonomousAbilityBase
{
public:
	TSubclassOf<class USAA_ProjectileData>       SubAutonomousAbilityData;                          // 0x1B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_SAA_Projectile* GetDefaultObj();

};

// 0x8 (0x1C0 - 0x1B8)
// Class LOTF2.AnimNotify_SAA_AreaOfEffect
class UAnimNotify_SAA_AreaOfEffect : public UAnimNotify_SubAutonomousAbilityBase
{
public:
	TSubclassOf<class USAA_AreaOfEffectData>     SubAutonomousAbilityData;                          // 0x1B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_SAA_AreaOfEffect* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class LOTF2.AnimNotify_SyncAnimAttach
class UAnimNotify_SyncAnimAttach : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_SyncAnimAttach* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class LOTF2.AnimNotify_WeaponHitFX
class UAnimNotify_WeaponHitFX : public UAnimNotify
{
public:
	enum class EFEquipmentSlot                   EquipmentSlot;                                     // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAnathemaHitFXType                WeaponHitFXType;                                   // 0x39(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EnableVFX;                                         // 0x3A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EnableSound;                                       // 0x3B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EnableEnvironmentVFX;                              // 0x3C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EnableEnvironmentSound;                            // 0x3D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2703[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EnvironmentHitRadiusSphereTrace;                   // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2704[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_WeaponHitFX* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class LOTF2.AnimTagFunctionLibrary
class UAnimTagFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAnimTagFunctionLibrary* GetDefaultObj();

	bool ChooseAnimSequence(class FName SourceEntryName, class UDataTable* AnimEntries, const struct FGameplayTag& DestTagId, struct FGameplayTagContainer& CurrentComboWindowTags, struct FGameplayTagContainer& AdditionalIdealTags, struct FGameplayTag& OverrideNextAttackType, class FName* EntryName, struct FTaggedAnimRow* Entry, int32* AnimIndex, struct FTaggedAnimRowAnim* Anim);
};

// 0x8 (0x30 - 0x28)
// Class LOTF2.CustomOverrideJointTransformData
class UCustomOverrideJointTransformData : public UObject
{
public:
	uint8                                        Pad_2707[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCustomOverrideJointTransformData* GetDefaultObj();

};

// 0x70 (0x110 - 0xA0)
// Class LOTF2.ANS_ApplyJointRelativeTransform
class UANS_ApplyJointRelativeTransform : public UAnimNotifyState_BaseConditionalTag
{
public:
	struct FTransform                            Transform;                                         // 0xA0(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPropJoint                        Joint;                                             // 0x100(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2708[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlendInTime;                                       // 0x104(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BlendOutTime;                                      // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2709[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_ApplyJointRelativeTransform* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class LOTF2.ANS_BufferWindow
class UANS_BufferWindow : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UANS_BufferWindow* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class LOTF2.ANS_ChangeMovementModeFlying
class UANS_ChangeMovementModeFlying : public UAnimNotifyState
{
public:
	enum class EMovementMode                     MovementModeOnExit;                                // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_270A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_ChangeMovementModeFlying* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class LOTF2.CustomHolsterData
class UCustomHolsterData : public UObject
{
public:
	uint8                                        Pad_270B[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCustomHolsterData* GetDefaultObj();

};

// 0x8 (0xA8 - 0xA0)
// Class LOTF2.ANS_CustomAnimHolster
class UANS_CustomAnimHolster : public UAnimNotifyState_BaseConditionalTag
{
public:
	bool                                         bHolstered;                                        // 0xA0(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EEquipHand                        bHand;                                             // 0xA1(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_270C[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_CustomAnimHolster* GetDefaultObj();

};

// 0x68 (0x98 - 0x30)
// Class LOTF2.ANS_DisableHitBoxesCollisions
class UANS_DisableHitBoxesCollisions : public UAnimNotifyState
{
public:
	TArray<class FName>                          BoneNames;                                         // 0x30(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	enum class ECollisionChannel                 Channel;                                           // 0x40(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_270D[0x57];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_DisableHitBoxesCollisions* GetDefaultObj();

};

// 0x8 (0xA8 - 0xA0)
// Class LOTF2.ANS_FullHolsterEquipment
class UANS_FullHolsterEquipment : public UAnimNotifyState_BaseConditionalTag
{
public:
	bool                                         bHolstered;                                        // 0xA0(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayAnimationAtStart;                             // 0xA1(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayAnimationAtEnd;                               // 0xA2(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_270E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PlayRate;                                          // 0xA4(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UANS_FullHolsterEquipment* GetDefaultObj();

};

// 0x8 (0xA8 - 0xA0)
// Class LOTF2.ANS_Guarding
class UANS_Guarding : public UAnimNotifyState_BaseGameplayEffect
{
public:
	bool                                         bIgnoreBlockReaction;                              // 0xA0(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_270F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_Guarding* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class LOTF2.ANS_HexAnimatePlayerPostProcessComponent
class UANS_HexAnimatePlayerPostProcessComponent : public UAnimNotifyState
{
public:
	struct FDataTableRowHandle                   OnStartAnimationDataHandle;                        // 0x30(0x10)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   OnEndAnimationDataHandle;                          // 0x40(0x10)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UANS_HexAnimatePlayerPostProcessComponent* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class LOTF2.ANS_HexLockFocusDirection
class UANS_HexLockFocusDirection : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UANS_HexLockFocusDirection* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class LOTF2.ANS_HexSetFocusDirectionToActorForward
class UANS_HexSetFocusDirectionToActorForward : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UANS_HexSetFocusDirectionToActorForward* GetDefaultObj();

};

// 0x10 (0xB0 - 0xA0)
// Class LOTF2.ANS_HexSetRotationRate
class UANS_HexSetRotationRate : public UAnimNotifyState_BaseConditionalTag
{
public:
	enum class EHexRotationRateMode              RotationMode;                                      // 0xA0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSnapToFocusDirectionAtEnd;                        // 0xA1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2712[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinRotationRateAngleLimits;                        // 0xA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxRotationRateAngleLimits;                        // 0xA8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2713[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_HexSetRotationRate* GetDefaultObj();

	float GetRotationRate();
};

// 0x8 (0xA8 - 0xA0)
// Class LOTF2.ANS_HolsterEquipmentBase
class UANS_HolsterEquipmentBase : public UAnimNotifyState_BaseConditionalTag
{
public:
	bool                                         bPlayAnimationAtStart;                             // 0xA0(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayAnimationAtEnd;                               // 0xA1(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2717[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PlayRate;                                          // 0xA4(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UANS_HolsterEquipmentBase* GetDefaultObj();

	bool GetShouldPlayAnimationAtStart(class USkeletalMeshComponent* MeshComp);
	bool GetShouldPlayAnimationAtEnd(class USkeletalMeshComponent* MeshComp);
};

// 0x8 (0xB0 - 0xA8)
// Class LOTF2.ANS_HolsterHandEquipment
class UANS_HolsterHandEquipment : public UANS_HolsterEquipmentBase
{
public:
	enum class EEquipHand                        EquipHand;                                         // 0xA8(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2718[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_HolsterHandEquipment* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class LOTF2.ANS_InterruptibleWindow
class UANS_InterruptibleWindow : public UAnimNotifyState
{
public:
	struct FGameplayTagContainer                 InterruptibleTags;                                 // 0x30(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bShouldTriggerInterruptEvent;                      // 0x50(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_271A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_InterruptibleWindow* GetDefaultObj();

};

// 0x0 (0xA0 - 0xA0)
// Class LOTF2.ANS_PlayerDisableWalkOffLedges
class UANS_PlayerDisableWalkOffLedges : public UAnimNotifyState_BaseConditionalTag
{
public:

	static class UClass* StaticClass();
	static class UANS_PlayerDisableWalkOffLedges* GetDefaultObj();

};

// 0x8 (0xB0 - 0xA8)
// Class LOTF2.ANS_SmartHolster
class UANS_SmartHolster : public UANS_HolsterEquipmentBase
{
public:
	enum class EHolsterGroup                     HolsterGroup;                                      // 0xA8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_271B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_SmartHolster* GetDefaultObj();

};

// 0x18 (0xC0 - 0xA8)
// Class LOTF2.ANS_TemporaryHolsterEquipment
class UANS_TemporaryHolsterEquipment : public UANS_HolsterEquipmentBase
{
public:
	bool                                         bUseHolsterableSlots;                              // 0xA8(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFEquipmentSlot                   EquipmentSlot;                                     // 0xA9(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EHolsterableSlot                  HolsterableSlot;                                   // 0xAA(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_271E[0x15];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_TemporaryHolsterEquipment* GetDefaultObj();

};

// 0x0 (0xC0 - 0xC0)
// Class LOTF2.ANS_TemporaryUnHolsterEquipment
class UANS_TemporaryUnHolsterEquipment : public UANS_TemporaryHolsterEquipment
{
public:

	static class UClass* StaticClass();
	static class UANS_TemporaryUnHolsterEquipment* GetDefaultObj();

};

// 0x8 (0xB0 - 0xA8)
// Class LOTF2.ANS_UnholsterLanternCosmetic
class UANS_UnholsterLanternCosmetic : public UANS_HolsterEquipmentBase
{
public:
	bool                                         bApplyCameraLogicChange;                           // 0xA8(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2720[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UANS_UnholsterLanternCosmetic* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class LOTF2.AN_HexSetFocusDirectionToActorForward
class UAN_HexSetFocusDirectionToActorForward : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAN_HexSetFocusDirectionToActorForward* GetDefaultObj();

};

// 0x28 (0x108 - 0xE0)
// Class LOTF2.ApplyEquipmentPostSpawn
class UApplyEquipmentPostSpawn : public UHexApplySpawnConfigComponent
{
public:
	TArray<TSoftClassPtr<class UEquipementData>> Equipment;                                         // 0xE0(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2721[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ALOTF2Character*                       TargetCharacter;                                   // 0x100(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UApplyEquipmentPostSpawn* GetDefaultObj();

	void OnEquipmentDataLoaded();
};

// 0x0 (0x4D8 - 0x4D8)
// Class LOTF2.HexGameDialog
class UHexGameDialog : public UHexActivatableWidget
{
public:

	static class UClass* StaticClass();
	static class UHexGameDialog* GetDefaultObj();

};

// 0x48 (0x520 - 0x4D8)
// Class LOTF2.HexConfirmationDialog
class UHexConfirmationDialog : public UHexGameDialog
{
public:
	TArray<class UHexConfirmationDialogButton*>  ActionButtons;                                     // 0x4D8(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Title;                                        // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x4F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2724[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UHexDialogDescriptor*                  Descriptor;                                        // 0x508(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UHexConfirmationDialogButton> ActionButtonClass;                                 // 0x510(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                          Panel_Buttons;                                     // 0x518(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UHexConfirmationDialog* GetDefaultObj();

	void OnConfirmationAction(class FName ActionId);
};

// 0x10 (0x530 - 0x520)
// Class LOTF2.ApplyRunesConfirmationDialog
class UApplyRunesConfirmationDialog : public UHexConfirmationDialog
{
public:
	class UPanelWidget*                          Panel_Runes;                                       // 0x520(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class URuneEquipItemWidget>      RuneEquipItemClass;                                // 0x528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UApplyRunesConfirmationDialog* GetDefaultObj();

	void SetRunes(bool bIsLantern, class UEquipableInventoryItem* AffectedItem, const TArray<class UHexRuneInventoryItem*>& OldRunes, const TArray<class UHexRuneInventoryItem*>& NewRunes);
};

// 0x238 (0x4F0 - 0x2B8)
// Class LOTF2.InGameMenuPanel
class UInGameMenuPanel : public ULOTF2UserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnSwitchPercentChanges;                            // 0x2B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestRefreshFocusEvent;                        // 0x2C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2727[0x78];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnQuitGameRequested;                               // 0x350(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2728[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UInGameBottomBarPanel*                 BottomBarPanel;                                    // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          CameraTransitionTag;                               // 0x3C8(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          PanelID;                                           // 0x3D0(0x8)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        NavigationOptions;                                 // 0x3D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOverrideSwitchAction;                             // 0x3D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2729[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  SwitchActionName;                                  // 0x3E0(0x18)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         bOverrideUnequipAction;                            // 0x3F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_272A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  UnequipActionName;                                 // 0x400(0x18)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         bOverrideSelectAction;                             // 0x418(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_272B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  SelectActionName;                                  // 0x420(0x18)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         bOverrideOkAction;                                 // 0x438(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_272C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OkActionName;                                      // 0x440(0x18)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         bAddCustomBottomBarActions;                        // 0x458(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_272D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<struct FGameplayTag, class FText>       CustomBottomBarActions;                            // 0x460(0x50)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         bOverrideTopBar;                                   // 0x4B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOverrideMenuSections;                             // 0x4B1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_272E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  OverridenMenuSections;                             // 0x4B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bCycleNavigation;                                  // 0x4C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowTopBar;                                       // 0x4C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowTopBarButtons;                                // 0x4CA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowTopBarNavigation;                             // 0x4CB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowTopBarTitle;                                  // 0x4CC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_272F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  TopBarTitle;                                       // 0x4D0(0x18)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         bCanSwitchCategories;                              // 0x4E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2730[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UInGameMenuPanel* GetDefaultObj();

	void SetNavigationEnabled(bool bEnabled);
	void RequestSwitchToNextPanel();
	void RequestPanelChange(const struct FGameplayTag& NewPanelSection);
	void RequestBack(bool byConfirm);
	class UWidget* GetDesiredFocusTarget();
	void BP_UnregisterInput();
	void BP_RegisterInput();
	void BP_PanelDeactivated();
	void BP_PanelActivated();
};

// 0x108 (0x5F8 - 0x4F0)
// Class LOTF2.ApplyTintPanel
class UApplyTintPanel : public UInGameMenuPanel
{
public:
	TArray<struct FInventoryCategoryElement>     InventoryCategories;                               // 0x4F0(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          Tag_MoveToPrevArmorSection;                        // 0x500(0x8)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          Tag_MoveToNextArmorSection;                        // 0x508(0x8)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          Tag_KeyboardPreviewKey;                            // 0x510(0x8)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  PreviewTintText;                                   // 0x518(0x18)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                  ApplyTintText;                                     // 0x530(0x18)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class UEquipmentCategoryRow*                 Row_Head;                                          // 0x548(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEquipmentCategoryRow*                 Row_Body;                                          // 0x550(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEquipmentCategoryRow*                 Row_Arms;                                          // 0x558(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEquipmentCategoryRow*                 Row_Legs;                                          // 0x560(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTintGrid*                             Tints_Grid;                                        // 0x568(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UInventoryGridItem*>            ArmorItems;                                        // 0x570(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UTintItemData*                         FocusedTint;                                       // 0x580(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2731[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EFEquipmentSlot, class UTintItemData*> AppliedTints;                                      // 0x590(0x50)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2732[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UApplyTintPanel* GetDefaultObj();

	void OnItemInteracted(class UObject* InteractedItem);
	void BP_SetTintName(class UTintItemData* TintItemData);
	void BP_RefreshTints();
};

// 0x18 (0x6A0 - 0x688)
// Class LOTF2.ArmorPieceData
class UArmorPieceData : public UEquipementData
{
public:
	struct FDataTableRowHandle                   StatsRow;                                          // 0x688(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	enum class EArmorType                        Type;                                              // 0x698(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2733[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UArmorPieceData* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class LOTF2.ArtBookAreasDataWrapper
class UArtBookAreasDataWrapper : public UObject
{
public:
	class FText                                  AreaName;                                          // 0x28(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                  ArtBookAreaRowName;                                // 0x40(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsUnlocked;                                       // 0x48(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasNewUnlocks;                                    // 0x49(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2734[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UArtBookAreasDataWrapper* GetDefaultObj();

};

// 0x50 (0x540 - 0x4F0)
// Class LOTF2.ArtBookAreasListWidget
class UArtBookAreasListWidget : public UInGameMenuPanel
{
public:
	class UDataTable*                            AreaDataTable;                                     // 0x4F0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UListView*                             AreasListView;                                     // 0x4F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ArtBookPanelTag;                                   // 0x500(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         HoverSound;                                        // 0x508(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         ClickSound;                                        // 0x510(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_273B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ULegendaryEditionManager*              LegendaryEditionManager;                           // 0x520(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_273C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                LoadOptions;                                       // 0x530(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UArtBookAreasListWidget* GetDefaultObj();

	void QuitArtbook();
	void OnAreaHovered(class UObject* Area, bool bIsHovered);
	void OnAreaClicked(class UObject* Area);
	void MarkAreaAsViewed(struct FGameplayTag& Tag, class UDataTable* ArtBookTable);
	bool HasNewUnlocks(struct FGameplayTag& Tag, class UDataTable* ArtBookTable);
	void ActionSelectArea();
};

// 0xC0 (0x5B0 - 0x4F0)
// Class LOTF2.ArtBookWidget
class UArtBookWidget : public UInGameMenuPanel
{
public:
	class UDataTable*                            ArtBookDataTable;                                  // 0x4F0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                ArtBookImage;                                      // 0x4F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                            ArtBookImageName;                                  // 0x500(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                            ArtBookImageDescription;                           // 0x508(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                              ArtBookOverlay;                                    // 0x510(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             ArtBookInitialImage;                               // 0x518(0x30)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      WidgetAnimationFadeOut;                            // 0x548(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      WidgetAnimationFadeIn;                             // 0x550(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          ArtBookAreasPanelTag;                              // 0x558(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2742[0x48];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ULegendaryEditionManager*              LegendaryEditionManager;                           // 0x5A8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UArtBookWidget* GetDefaultObj();

	void ResetArtData();
	void OnNewImageLoaded();
	void OnFadeOutFinished();
	void OnFadeInFinished();
	TArray<struct FArtBookDataAsset> GetUnlockedArt();
	void ForceFullscreenOff();
	void FadeChangeSlide();
	void ChangeSlide(int32 NewIndex);
	void ActionSlidesRight();
	void ActionSlidesLeft();
	void ActionFullscreen();
};

// 0x78 (0xA8 - 0x30)
// Class LOTF2.AsyncAction_PushContentToLayerForPlayer
class UAsyncAction_PushContentToLayerForPlayer : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            BeforePush;                                        // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            AfterPush;                                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2746[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAsyncAction_PushContentToLayerForPlayer* GetDefaultObj();

	bool IsActive();
	void Cancel();
	class UAsyncAction_PushContentToLayerForPlayer* AsyncPushContentToLayerForPlayer(class APlayerController* OwningPlayer, TSoftClassPtr<class UCommonActivatableWidget> WidgetClass, const struct FGameplayTag& LayerName, bool bSuspendInputUntilComplete);
};

// 0x98 (0xC8 - 0x30)
// Class LOTF2.AsyncAction_ShowConfirmationDialog
class UAsyncAction_ShowConfirmationDialog : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnResult;                                          // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2747[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnResultNamed;                                     // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2748[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnShown;                                           // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2749[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               WorldContextObject;                                // 0xA8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULocalPlayer*                          TargetLocalPlayer;                                 // 0xB0(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHexDialogDescriptor*                  Descriptor;                                        // 0xB8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_274A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAsyncAction_ShowConfirmationDialog* GetDefaultObj();

	class UAsyncAction_ShowConfirmationDialog* ShowConfirmationYesNo(class UObject* InWorldContextObject, class FText Title, class FText Message);
	class UAsyncAction_ShowConfirmationDialog* ShowConfirmationOkCancelCustomDialog(class UObject* InWorldContextObject, class FText Title, class FText Message, class FText Confirm, class FText Cancel, TSubclassOf<class UHexGameDialog> CustomDialog);
	class UAsyncAction_ShowConfirmationDialog* ShowConfirmationOkCancel(class UObject* InWorldContextObject, class FText Title, class FText Message);
	class UAsyncAction_ShowConfirmationDialog* ShowConfirmationOk(class UObject* InWorldContextObject, class FText Title, class FText Message);
	class UAsyncAction_ShowConfirmationDialog* ShowConfirmationCustom(class UObject* InWorldContextObject, class UHexDialogDescriptor* DialogDescriptor);
};

// 0x0 (0x28 - 0x28)
// Class LOTF2.AsyncBackAction
class IAsyncBackAction : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAsyncBackAction* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class LOTF2.AsyncDeactivation
class IAsyncDeactivation : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAsyncDeactivation* GetDefaultObj();

};

// 0x8 (0xB8 - 0xB0)
// Class LOTF2.AttachedActorComponent
class UAttachedActorComponent : public UActorComponent
{
public:
	float                                        ShieldOffsetWhenHolsteredAtBack;                   // 0xB0(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_274B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAttachedActorComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class LOTF2.InputActionPayloadFactory
class UInputActionPayloadFactory : public UObject
{
public:

	static class UClass* StaticClass();
	static class UInputActionPayloadFactory* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class LOTF2.AttackActionPayloadFactory
class UAttackActionPayloadFactory : public UInputActionPayloadFactory
{
public:
	class UInputAction*                          InputMovementAction;                               // 0x28(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAttackActionPayloadFactory* GetDefaultObj();

};

// 0x278 (0x2A0 - 0x28)
// Class LOTF2.HexDamageDefEffectData
class UHexDamageDefEffectData : public UObject
{
public:
	struct FAttackDamageDefinition               DamageDefinition;                                  // 0x28(0x270)(NativeAccessSpecifierPrivate)
	struct FGameplayTag                          AttackDirectionOverride;                           // 0x298(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UHexDamageDefEffectData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class LOTF2.HexDamageDefHelper
class UHexDamageDefHelper : public UObject
{
public:

	static class UClass* StaticClass();
	static class UHexDamageDefHelper* GetDefaultObj();

	void ApplyDamageDefinitionFromNameToActor(class AActor* InstigatorActor, class AActor* TargetActor, class FName DamageDefName, class AActor* PropToUse, class UObject* ExternalObject);
};

// 0xF0 (0x120 - 0x30)
// Class LOTF2.AttributesAttributeSet
class UAttributesAttributeSet : public UAttributeSet
{
public:
	struct FGameplayAttributeData                Strength;                                          // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                Agility;                                           // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                Faith;                                             // 0x50(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                Endurance;                                         // 0x60(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                Vitality;                                          // 0x70(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                Chaos;                                             // 0x80(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                InitialStrength;                                   // 0x90(0x10)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                InitialAgility;                                    // 0xA0(0x10)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                InitialFaith;                                      // 0xB0(0x10)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                InitialEndurance;                                  // 0xC0(0x10)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                InitialVitality;                                   // 0xD0(0x10)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                InitialChaos;                                      // 0xE0(0x10)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                Physique;                                          // 0xF0(0x10)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                Height;                                            // 0x100(0x10)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                ShouldUseAttributes;                               // 0x110(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAttributesAttributeSet* GetDefaultObj();

	void OnRep_Vitality(struct FGameplayAttributeData& OldVitality);
	void OnRep_Strength(struct FGameplayAttributeData& OldStrength);
	void OnRep_ShouldUseAttributes(struct FGameplayAttributeData& OldShouldUseAttributes);
	void OnRep_Faith(struct FGameplayAttributeData& OldFaith);
	void OnRep_Endurance(struct FGameplayAttributeData& OldEndurance);
	void OnRep_Chaos(struct FGameplayAttributeData& OldChaos);
	void OnRep_Agility(struct FGameplayAttributeData& OldAgility);
};

// 0x68 (0x118 - 0xB0)
// Class LOTF2.AttributeTrackerComponent
class UAttributeTrackerComponent : public UActorComponent
{
public:
	uint8                                        Pad_274C[0x68];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAttributeTrackerComponent* GetDefaultObj();

	void OnAnyEquipmentChanged();
};

// 0xA00 (0xAB0 - 0xB0)
// Class LOTF2.AutonomousAbilitiesComponent
class UAutonomousAbilitiesComponent : public UActorComponent
{
public:
	struct FDataTableRowHandle                   AutonomousAbilityDefinitionHandle;                 // 0xB0(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class USubAutonomousAbilityData*             SubAutonomousAbilityData;                          // 0xC0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2751[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAutonomousAbilityDefinition          AutonomousAbilityDefinitionData;                   // 0xE8(0x9C0)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2752[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAutonomousAbilitiesComponent* GetDefaultObj();

	void OnRep_SubAutonomousAbilityData();
	void OnLinkedAutonomousAbilityDestroyed(class AActor* Actor, enum class EEndPlayReason EndPlayReason);
	void OnAttachedParentDestroyed(class AActor* DestroyedActor, enum class EEndPlayReason EndPlayReason);
	void OnAreaTimedOut();
	void OnAreaOverlapValidActor(class AActor* TargetActor, struct FHitResult& HitResult, bool bBlockedAttack);
	void OnAreaOverlapEffectsAppliedActor(class AActor* TargetActor, struct FHitResult& HitResult, bool bBlockedAttack);
	void OnAreaHitCollison(class AActor* OtherActor, struct FHitResult& Hit);
	void OnAreaEndOverlapValidActor(class AActor* TargetActor);
