#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC1 (0x3C9 - 0x308)
// WidgetBlueprintGeneratedClass WBP_OnlineHUD.WBP_OnlineHUD_C
class UWBP_OnlineHUD_C : public UOnlineHUDWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x308(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                          AllyBox;                                           // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              AllyMatchmakingBox;                                // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              AllySearchingBox;                                  // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      CooperatorName;                                    // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       HealthSwitcher;                                    // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_5;                                           // 0x338(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_99;                                          // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_CooperatorLogo;                              // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_InvaderLogo;                                 // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              InvaderMatchmakingBox;                             // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      InvaderName;                                       // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              InvaderSearchingBox;                               // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        JoiningBox;                                        // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      JoiningText;                                       // 0x378(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        MatchmakingBox;                                    // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                          ProgressBar_Health;                                // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      ReturnText;                                        // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        ReturnToHostBox;                                   // 0x398(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        SearchingBox;                                      // 0x3A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                             Throbber;                                          // 0x3A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                             Throbber_0;                                        // 0x3B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                       CurrentHealth;                                     // 0x3B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MaxHealth;                                         // 0x3C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bTravelTimerSet;                                   // 0x3C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWBP_OnlineHUD_C* GetDefaultObj();

	void EnableInvaderElements(class ALOTF2PlayerState* PlayerState);
	void EnableClientElements(class ALOTF2PlayerState* PlayerState);
	void HideAllyBoxElements();
	enum class EHexMultiplayerRole GetLocalRole(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class ALOTF2PlayerState* K2Node_DynamicCast_AsLOTF2Player_State, bool K2Node_DynamicCast_bSuccess, enum class EHexMultiplayerRole CallFunc_GetMultiplayerRole_ReturnValue);
	void Changed_9B90EF504FE3D131A35262AB6F2DCFAA(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void Changed_3E4667524963FD368B0938BC7934215F(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void Construct();
	void OnPlayerStateAdded_Event_0(class APlayerState* PlayerState);
	void MatchmakingActiveChanged(class ALOTF2WorldGameSession* SelfRef);
	void SetHealthBar(bool Enabled);
	void SetupAllyWidget(enum class EHexMultiplayerRole Role);
	void OnLoadingFinished_Event_0();
	void HandleTravelTimerSet(class ALOTF2WorldGameSession* SelfRef);
	void UpdateTravelText();
	void HandlePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void SetupReturnWidget();
	void HandleReturnTimer(class UClientTetheringComponent* SelfRef);
	void UpdateReturnTimer();
	void ExecuteUbergraph_WBP_OnlineHUD(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, enum class ESlateVisibility Temp_byte_Variable, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable_1, enum class ESlateVisibility Temp_byte_Variable_2, bool Temp_bool_Variable_1, enum class ESlateVisibility Temp_byte_Variable_3, enum class ESlateVisibility Temp_byte_Variable_4, bool Temp_bool_Variable_2, enum class ESlateVisibility Temp_byte_Variable_5, enum class ESlateVisibility Temp_byte_Variable_6, bool Temp_bool_Variable_3, enum class ESlateVisibility Temp_byte_Variable_7, enum class ESlateVisibility Temp_byte_Variable_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool Temp_bool_Variable_4, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, int32 Temp_int_Variable, int32 Temp_int_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct FGameplayAttribute& K2Node_CustomEvent_Attribute_1, float K2Node_CustomEvent_NewValue_1, float K2Node_CustomEvent_OldValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class ALOTF2WorldGameSession* CallFunc_GetWorldGameSession_ReturnValue, bool CallFunc_GetLOTF2GameState_IsValid, class ALOTF2GameState* CallFunc_GetLOTF2GameState_GameState, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsLoadingScreenVisible_ReturnValue, enum class ESlateVisibility Temp_byte_Variable_9, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class ALOTF2PlayerState* K2Node_DynamicCast_AsLOTF2Player_State, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue_1, enum class EHexMultiplayerRole CallFunc_GetMultiplayerRole_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_GetLOTF2GameState_IsValid_1, class ALOTF2GameState* CallFunc_GetLOTF2GameState_GameState_1, bool CallFunc_Less_IntInt_ReturnValue, class APlayerState* K2Node_CustomEvent_PlayerState, class ALOTF2WorldGameSession* K2Node_CustomEvent_selfRef_2, bool CallFunc_IsSearchingForJoin_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, bool CallFunc_IsSearchingForInvasion_ReturnValue, enum class ESlateVisibility K2Node_Select_Default, bool CallFunc_BooleanOR_ReturnValue, enum class ESlateVisibility K2Node_Select_Default_1, bool CallFunc_IsMatchmakingActiveForInvasion_ReturnValue, bool CallFunc_IsDefaultMatchmakingActive_ReturnValue, enum class ESlateVisibility K2Node_Select_Default_2, enum class ESlateVisibility K2Node_Select_Default_3, bool CallFunc_BooleanOR_ReturnValue_1, bool K2Node_CustomEvent_Enabled, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, int32 K2Node_Select_Default_4, bool Temp_bool_Variable_5, enum class ESlateVisibility K2Node_Select_Default_5, enum class EHexMultiplayerRole K2Node_CustomEvent_Role, class ALOTF2WorldGameSession* CallFunc_GetWorldGameSession_ReturnValue_1, int32 Temp_int_Array_Index_Variable, class APlayerState* CallFunc_Array_Get_Item, class ALOTF2PlayerState* K2Node_DynamicCast_AsLOTF2Player_State_1, bool K2Node_DynamicCast_bSuccess_1, enum class EHexMultiplayerRole CallFunc_GetMultiplayerRole_ReturnValue_1, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class ALOTF2WorldGameSession* K2Node_CustomEvent_selfRef_1, class ALOTF2WorldGameSession* CallFunc_GetWorldGameSession_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_2, enum class EMatchmakingType CallFunc_GetTravelMatchmakingType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, float CallFunc_GetTimeLeftBeforeTravel_ReturnValue, int32 CallFunc_FCeil_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, int64 CallFunc_Conv_IntToInt64_ReturnValue_1, class FText CallFunc_Format_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, class APlayerState* K2Node_CustomEvent_Player, class APawn* K2Node_CustomEvent_NewPawn, class APawn* K2Node_CustomEvent_OldPawn, class ALOTF2PlayerState* K2Node_DynamicCast_AsLOTF2Player_State_2, bool K2Node_DynamicCast_bSuccess_2, class UAbilityAsync_WaitAttributeChanged* CallFunc_WaitForAttributeChanged_ReturnValue, class UAbilityAsync_WaitAttributeChanged* CallFunc_WaitForAttributeChanged_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_5, bool CallFunc_GetGameplayAttributeValue_bFound, float CallFunc_GetGameplayAttributeValue_ReturnValue, bool CallFunc_GetGameplayAttributeValue_bFound_1, float CallFunc_GetGameplayAttributeValue_ReturnValue_1, class UClientTetheringComponent* K2Node_CustomEvent_selfRef, bool CallFunc_IsReturnToHostPending_ReturnValue, float CallFunc_GetTimerTimeRemaining_ReturnValue, int32 CallFunc_FCeil_ReturnValue_1, int64 CallFunc_Conv_IntToInt64_ReturnValue_2, int32 CallFunc_Max_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, bool CallFunc_EqualEqual_IntInt_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, class FText CallFunc_Format_ReturnValue_2, const struct FGameplayAttribute& Temp_struct_Variable, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, float Temp_real_Variable, class UClientTetheringComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_IsServer_ReturnValue, float Temp_real_Variable_1, const struct FGameplayAttribute& K2Node_CustomEvent_Attribute, float K2Node_CustomEvent_NewValue, float K2Node_CustomEvent_OldValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, enum class EHexMultiplayerRole CallFunc_GetLocalRole_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, enum class EHexMultiplayerRole CallFunc_GetLocalRole_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, enum class ESlateVisibility Temp_byte_Variable_10, enum class ESlateVisibility Temp_byte_Variable_11, enum class EHexMultiplayerRole CallFunc_GetLocalRole_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_2, enum class EHexMultiplayerRole CallFunc_GetLocalRole_ReturnValue_3, bool CallFunc_EqualEqual_ByteByte_ReturnValue_4, bool Temp_bool_Variable_6, enum class ESlateVisibility K2Node_Select_Default_6, const struct FGameplayAttribute& Temp_struct_Variable_1, float Temp_real_Variable_2, enum class EHexMultiplayerRole CallFunc_GetLocalRole_ReturnValue_4, bool CallFunc_EqualEqual_ByteByte_ReturnValue_5, bool CallFunc_EqualEqual_ByteByte_ReturnValue_6, bool CallFunc_BooleanOR_ReturnValue_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, float Temp_real_Variable_3, enum class EHexMultiplayerRole CallFunc_GetLocalRole_ReturnValue_5, bool CallFunc_NotEqual_ByteByte_ReturnValue_1, float CallFunc_SetPercent_InPercent_ImplicitCast, double CallFunc_FCeil_A_ImplicitCast, double K2Node_VariableSet_MaxHealth_ImplicitCast, double K2Node_VariableSet_CurrentHealth_ImplicitCast, double CallFunc_FCeil_A_ImplicitCast_1, double K2Node_VariableSet_MaxHealth_ImplicitCast_1, double K2Node_VariableSet_CurrentHealth_ImplicitCast_1);
};

}


