#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EMatchmakingType : uint8
{
	Default                        = 0,
	Invasion                       = 1,
	AllyForInvasion                = 2,
	EMatchmakingType_MAX           = 3,
};

enum class EOnMontageDoneReason : uint8
{
	Completed                      = 0,
	BlendOut                       = 1,
	Interrupted                    = 2,
	Cancelled                      = 3,
	EOnMontageDoneReason_MAX       = 4,
};

enum class ECharacterBodyType : uint8
{
	Male                           = 0,
	Female                         = 1,
	ECharacterBodyType_MAX         = 2,
};

enum class EDialogueEndReason : uint8
{
	Normal                         = 0,
	Forced                         = 1,
	EDialogueEndReason_MAX         = 2,
};

enum class EForgedAnchorState : uint8
{
	None                           = 0,
	Placing                        = 1,
	ForgeInProgress                = 2,
	Forged                         = 3,
	Ancient                        = 4,
	Destroyed                      = 5,
	EForgedAnchorState_MAX         = 6,
};

enum class EDualRealmAnchorState : uint8
{
	Inactive                       = 0,
	Active                         = 1,
	SoulBound                      = 2,
	Deactivated                    = 3,
	EDualRealmAnchorState_MAX      = 4,
};

enum class EActivateRealmReason : uint8
{
	Resurrect                      = 0,
	Shifting                       = 1,
	ForcedTranscend                = 2,
	EActivateRealmReason_MAX       = 3,
};

enum class EGameRealm : uint8
{
	Real                           = 0,
	Umbral                         = 1,
	None                           = 2,
	Limbo                          = 3,
	EGameRealm_MAX                 = 4,
};

enum class ERealmDetectionState : uint8
{
	None                           = 0,
	Axiom                          = 1,
	Umbral                         = 2,
	Dual                           = 3,
	ERealmDetectionState_MAX       = 4,
};

enum class EHexAttackTypeEffectivenes : uint8
{
	Default                        = 0,
	Effective                      = 1,
	Ineffective                    = 2,
	EHexAttackTypeEffectivenes_MAX = 3,
};

enum class EInputType : uint8
{
	Unset                          = 0,
	Keyboard                       = 1,
	Mouse                          = 2,
	Gamepad                        = 3,
	EInputType_MAX                 = 4,
};

enum class EMessagingResult : uint8
{
	Confirmed                      = 0,
	Declined                       = 1,
	Killed                         = 2,
	Unknown                        = 3,
	EMessagingResult_MAX           = 4,
};

enum class EAnswerType : uint8
{
	Undefined                      = 0,
	Yes                            = 1,
	No                             = 2,
	GenericAnswer1                 = 3,
	GenericAnswer2                 = 4,
	GenericAnswer3                 = 5,
	GenericAnswer4                 = 6,
	EAnswerType_MAX                = 7,
};

enum class EeAnathemaAIActionState : uint8
{
	EIdle                          = 0,
	EReady                         = 1,
	EActive                        = 2,
	EPaused                        = 3,
	EFailed                        = 4,
	EFinished                      = 5,
	EAnathemaAIActionState_MAX     = 6,
};

enum class EFEquipmentSlot : uint8
{
	PrimaryWeapon                  = 0,
	SoulsLantern                   = 1,
	RangedWeapon                   = 2,
	SecondaryWeapon                = 3,
	Magic1                         = 4,
	Magic2                         = 5,
	Magic3                         = 6,
	Magic4                         = 7,
	Magic5                         = 8,
	RangedAmmo1                    = 9,
	RangedAmmo2                    = 10,
	RangedAmmo3                    = 11,
	Character                      = 12,
	HeadArmor                      = 13,
	BodyArmor                      = 14,
	ArmsArmor                      = 15,
	LegsArmor                      = 16,
	Accessories                    = 17,
	UmbralTumor                    = 18,
	UmbralTumor2                   = 19,
	UmbralTumor3                   = 20,
	UmbralTumor4                   = 21,
	Ring1                          = 22,
	Ring2                          = 23,
	Amulet                         = 24,
	MAX                            = 25,
	Undefined                      = 255,
};

enum class EPropJoint : uint8
{
	LeftHand                       = 0,
	RightHand                      = 1,
	LeftElbow                      = 2,
	RightElbow                     = 3,
	LeftLeg                        = 4,
	RightLeg                       = 5,
	LeftKnee                       = 6,
	RightKnee                      = 7,
	Tail                           = 8,
	Head                           = 9,
	LeftHandPommel                 = 10,
	RightHandPommel                = 11,
	PropElbow                      = 12,
	PrimaryWeapon                  = 13,
	SoulsLantern                   = 14,
	PrimaryWeaponHolster           = 15,
	RangedWeaponHolster            = 16,
	ThrowableWeaponHolster         = 17,
	LeftProp                       = 18,
	LeftShieldProp                 = 19,
	Neck                           = 20,
	ThrowableHand                  = 21,
	SecondaryWeaponHolster         = 22,
	ShieldHolster                  = 23,
	Quiver                         = 24,
	QuiverAmmo1                    = 25,
	QuiverAmmo2                    = 26,
	QuiverAmmo3                    = 27,
	SmallPrimaryWeaponHolster      = 28,
	SmallSecondaryWeaponHolster    = 29,
	LargeThrowableWeaponHolster    = 30,
	CatalystHolster                = 31,
	None                           = 32,
	MAX                            = 33,
};

enum class ECharCreationMode : uint8
{
	Home                           = 0,
	ClassSelection                 = 1,
	Presets                        = 2,
	CharCustomization              = 3,
	HeadCustomization              = 4,
	Review                         = 5,
	ShapeCustomization             = 6,
	Undefined                      = 7,
	ECharCreationMode_MAX          = 8,
};

enum class EBodyShapeAttributeType : uint8
{
	Undefined                      = 0,
	BodyShape_Muscular             = 1,
	BodyShape_Thin                 = 2,
	BodyShape_Large                = 3,
	Head_Size                      = 4,
	Head_Width                     = 5,
	Head_Height                    = 6,
	Head_Depth                     = 7,
	Skin_Color                     = 8,
	Muscular                       = 9,
	Age                            = 10,
	Brows                          = 11,
	Brows_Ridge                    = 12,
	Brows_Height                   = 13,
	Brows_Color                    = 14,
	Eyes_Spacing                   = 15,
	Eyes_Height                    = 16,
	Eyes_Depth                     = 17,
	Eyes_Iris_Primary_Color        = 18,
	Eyes_Iris_Secondary_Color      = 19,
	Eyes_Glow                      = 20,
	Ears_Angle                     = 21,
	Ears_Height                    = 22,
	Ears_Depth                     = 23,
	Nose_Width                     = 24,
	Nose_Height                    = 25,
	Nose_Depth                     = 26,
	Nose_Bridge                    = 27,
	Mouth_Width                    = 28,
	Mouth_Height                   = 29,
	Mouth_Depth                    = 30,
	Jaw_Cleft_Chin                 = 31,
	Jaw_Width                      = 32,
	Jaw_Height                     = 33,
	Jaw_Depth                      = 34,
	Jaw_Cheekbones                 = 35,
	Teeth_Shape                    = 36,
	Teeth_Color                    = 37,
	Hair_Style                     = 38,
	Primary_Hair_Color             = 39,
	Secondary_Hair_Color           = 40,
	Facial_Hair                    = 41,
	Primary_Facial_Hair_Color      = 42,
	Secondary_Facial_Hair_Color    = 43,
	Face                           = 44,
	Face_Paint                     = 45,
	Face_Scars                     = 46,
	Face_Paint_Color               = 47,
	Face_Scars_Color               = 48,
	Body_Posture                   = 49,
	Body_Type                      = 50,
	Voice                          = 51,
	Tattoo_Chest_Color             = 52,
	Tattoo_Chest_Intensity         = 53,
	Tattoo_Chest_Opacity           = 54,
	Tattoo_Back_Color              = 55,
	Tattoo_Back_Intensity          = 56,
	Tattoo_Back_Opacity            = 57,
	Tattoo_LeftArm_Color           = 58,
	Tattoo_LeftArm_Intensity       = 59,
	Tattoo_LeftArm_Opacity         = 60,
	Tattoo_RightArm_Color          = 61,
	Tattoo_RightArm_Intensity      = 62,
	Tattoo_RightArm_Opacity        = 63,
	Tattoo_LeftLeg_Color           = 64,
	Tattoo_LeftLeg_Intensity       = 65,
	Tattoo_LeftLeg_Opacity         = 66,
	Tattoo_RightLeg_Color          = 67,
	Tattoo_RightLeg_Intensity      = 68,
	Tattoo_RightLeg_Opacity        = 69,
	Tattoo_Forehead_Color          = 70,
	Tattoo_Forehead_Intensity      = 71,
	Tattoo_Forehead_Opacity        = 72,
	Tattoo_LeftCheek_Color         = 73,
	Tattoo_LeftCheek_Intensity     = 74,
	Tattoo_LeftCheek_Opacity       = 75,
	Tattoo_RightCheek_Color        = 76,
	Tattoo_RightCheek_Intensity    = 77,
	Tattoo_RightCheek_Opacity      = 78,
	Tattoo_NoseAndEyes_Color       = 79,
	Tattoo_NoseAndEyes_Intensity   = 80,
	Tattoo_NoseAndEyes_Opacity     = 81,
	Tattoo_Mouth_Color             = 82,
	Tattoo_Mouth_Intensity         = 83,
	Tattoo_Mouth_Opacity           = 84,
	Skin_Color_Intensity           = 85,
	Skin_Color_Mask                = 86,
	Body_Normal_Type               = 87,
	Face_Type                      = 88,
	Tattoo_Chest_Tint              = 89,
	Tattoo_Back_Tint               = 90,
	Tattoo_LeftArm_Tint            = 91,
	Tattoo_RightArm_Tint           = 92,
	Tattoo_LeftLeg_Tint            = 93,
	Tattoo_RightLeg_Tint           = 94,
	Tattoo_Forehead_Tint           = 95,
	Tattoo_LeftCheek_Tint          = 96,
	Tattoo_RightCheek_Tint         = 97,
	Tattoo_NoseAndEyes_Tint        = 98,
	Tattoo_Mouth_Tint              = 99,
	EBodyShapeAttributeType_MAX    = 100,
};

enum class ECustomizationCategory : uint8
{
	Undefined                      = 0,
	Body                           = 1,
	Skin_Color                     = 2,
	Generic_Color                  = 3,
	Head                           = 4,
	Brows                          = 5,
	Eyes                           = 6,
	Ears                           = 7,
	Nose                           = 8,
	Mouth                          = 9,
	Teeth                          = 10,
	Jaw                            = 11,
	Hair                           = 12,
	Facial_Hair                    = 13,
	Face                           = 14,
	Scars                          = 15,
	Tattoos                        = 16,
	Voice                          = 17,
	ECustomizationCategory_MAX     = 18,
};

enum class EEnergyType : uint8
{
	Stamina                        = 0,
	Magic                          = 1,
	Ammo                           = 2,
	ProvisionalDamage              = 3,
	MAX                            = 4,
};

enum class ELocomotionState : uint8
{
	Idle                           = 0,
	SlowWalk                       = 1,
	Walk                           = 2,
	Run                            = 3,
	Sprint                         = 4,
	ELocomotionState_MAX           = 5,
};

enum class EMeleeOption : uint8
{
	Primary                        = 0,
	Secondary                      = 1,
	Count                          = 2,
	EMeleeOption_MAX               = 3,
};

enum class EMeleeStance : uint8
{
	OneHanded                      = 0,
	TwoHanded                      = 1,
	DualWield                      = 2,
	Count                          = 3,
	EMeleeStance_MAX               = 4,
};

enum class ERagdollState : uint8
{
	Inactive                       = 0,
	Active                         = 1,
	EndedInRestingPose             = 2,
	ERagdollState_MAX              = 3,
};

enum class ERangedOption : uint8
{
	None                           = 0,
	Ranged                         = 1,
	Lantern                        = 2,
	Count                          = 3,
	ERangedOption_MAX              = 4,
};

enum class ERangedStance : uint8
{
	None                           = 0,
	Ranged                         = 1,
	Magic                          = 2,
	Lantern                        = 3,
	Count                          = 4,
	ERangedStance_MAX              = 5,
};

enum class EHeadPresetLocation : uint8
{
	Top                            = 0,
	Left                           = 1,
	Right                          = 2,
	EHeadPresetLocation_MAX        = 3,
};

enum class EBodyShapeCamera : uint8
{
	Undefined                      = 0,
	Body_Front                     = 1,
	Body_Back                      = 2,
	Face_Front                     = 3,
	Face_Side                      = 4,
	Class_Selection                = 5,
	Review                         = 6,
	EBodyShapeCamera_MAX           = 7,
};

enum class EStanceType : uint8
{
	None                           = 0,
	Primary                        = 1,
	Secondary                      = 2,
	DualWield                      = 3,
	Ranged                         = 4,
	Magic                          = 5,
	Lantern                        = 6,
	Count                          = 7,
	EStanceType_MAX                = 8,
};

enum class EAITargetEnvelopeType : uint8
{
	Unset                          = 0,
	Visual                         = 1,
	Audio                          = 2,
	Touch                          = 3,
	Sense                          = 4,
	Damage                         = 5,
	EAITargetEnvelopeType_MAX      = 6,
};

enum class ENavigationBoxOptions : uint8
{
	NONE                           = 0,
	Select                         = 1,
	Ok                             = 2,
	Switch                         = 4,
	SwitchCycle                    = 8,
	Return                         = 16,
	Unequip                        = 32,
	UnequipCycle                   = 64,
	RotateAndZoom                  = 128,
	Everything                     = 255,
	ENavigationBoxOptions_MAX      = 256,
};

enum class EHolsterState : uint8
{
	None                           = 0,
	Holstered                      = 1,
	Unholstered                    = 2,
	EHolsterState_MAX              = 3,
};

enum class EHolsterableSlot : uint8
{
	PrimaryWeapon                  = 0,
	SecondaryWeapon                = 1,
	SoulsLantern                   = 2,
	RangedWeapon                   = 3,
	RangedAmmo1                    = 4,
	RangedAmmo2                    = 5,
	RangedAmmo3                    = 6,
	PrimaryWeaponSecondaryVisual   = 7,
	MAX                            = 8,
	Undefined                      = 255,
};

enum class EDualRealmWhisperState : uint8
{
	Unavailable                    = 0,
	Available                      = 1,
	Activated                      = 2,
	Completed                      = 3,
	Disappeared                    = 4,
	EDualRealmWhisperState_MAX     = 5,
};

enum class EWorldResetReason : uint8
{
	Undefined                      = 0,
	TrueDeath                      = 1,
	AnchorResurrect                = 2,
	AnchorFastTravel               = 3,
	EWorldResetReason_MAX          = 4,
};

enum class EAchievementTrackerType : uint8
{
	None                           = 0,
	Quest                          = 1,
	SummonCoopPartner              = 2,
	PvpKillEnemy                   = 3,
	CoopKillBoss                   = 4,
	DonateTotalSocialCoins         = 5,
	UnlockAllAchievements          = 6,
	EAchievementTrackerType_MAX    = 7,
};

enum class EAdaptiveTriggerButton : uint8
{
	LeftTrigger                    = 0,
	RightTrigger                   = 1,
	EAdaptiveTriggerButton_MAX     = 2,
};

enum class EAdaptiveTriggerMode : uint8
{
	Off                            = 0,
	Weapon                         = 1,
	Vibration                      = 2,
	MultiplePositionVibration      = 3,
	Feedback                       = 4,
	MultiplePositionFeedback       = 5,
	SlopeFeedback                  = 6,
	EAdaptiveTriggerMode_MAX       = 7,
};

enum class EeAITurnDirection : uint8
{
	TowardsTarget                  = 0,
	AwayFromTarget                 = 1,
	EAITurnDirection_MAX           = 2,
};

enum class ETurnEnvironmentActionMode : uint8
{
	TurnEnvironmentActionMode_PatrolPoint = 0,
	TurnEnvironmentActionMode_Actor = 1,
	TurnEnvironmentActionMode_Degrees = 2,
	TurnEnvironmentActionMode_MAX  = 3,
};

enum class EAIFactionTeams : uint8
{
	AIFACTION_UNDEFINED            = 0,
	AIFACTION_PLAYER               = 1,
	AIFACTION_RHOGAR               = 2,
	AIFACTION_RHOGARRIENDLY        = 3,
	AIFACTION_PLAYERHOST           = 4,
	AIFACTION_PLAYERCOOP           = 5,
	AIFACTION_PLAYERINVADER        = 6,
	AIFACTION_ENEMY                = 7,
	AIFACTION_ENEMYBIG             = 8,
	AIFACTION_ENEMYRHOGAR          = 9,
	AIFACTION_ENEMYRHOGARBIG       = 10,
	AIFACTION_ENEMYATTESTANT       = 11,
	AIFACTION_ENEMYATTESTANTBIG    = 12,
	AIFACTION_ENEMYUMBRIE          = 13,
	AIFACTION_ENEMYUMBRIEBIG       = 14,
	AIFACTION_ENEMYNATIVE          = 15,
	AIFACTION_ENEMYNATIVEBIG       = 16,
	AIFACTION_FRIEND               = 17,
	AIFACTION_FRIENDANGRY          = 18,
	AIFACTION_FRIENDCOOP           = 19,
	AIFACTION_INVADERCOOP          = 20,
	AIFACTION_COUNT                = 21,
	AIFACTION_MAX                  = 22,
};

enum class EHexAITeams : uint8
{
	Undefined                      = 0,
	PlayerHost                     = 1,
	PlayerCoop                     = 2,
	PlayerInvader                  = 3,
	Enemy                          = 4,
	EnemyRhogar                    = 5,
	EnemyAttestant                 = 6,
	EnemyUmbrie                    = 7,
	EnemyNative                    = 8,
	Friend                         = 9,
	FriendCoop                     = 10,
	InvaderCoop                    = 11,
	EnemyUmbralParasite            = 12,
	HEXAITEAMS_COUNT               = 13,
	EHexAITeams_MAX                = 14,
};

enum class EHexAIFactions : uint8
{
	Undefined                      = 0,
	Player                         = 1,
	Invader                        = 2,
	Enemy                          = 3,
	EnemyRhogar                    = 4,
	EnemyAttestant                 = 5,
	EnemyUmbrie                    = 6,
	EnemyNative                    = 7,
	Friend                         = 8,
	HEXAIFACTIONS_COUNT            = 9,
	EHexAIFactions_MAX             = 10,
};

enum class EPatrolMode : uint8
{
	FullLoop                       = 0,
	LoopBackwards                  = 1,
	NoLoop                         = 2,
	EPatrolMode_MAX                = 3,
};

enum class EPatrolSpeed : uint8
{
	Walk                           = 0,
	Run                            = 1,
	EPatrolSpeed_MAX               = 2,
};

enum class EAITargetSystemThreatType : uint8
{
	High                           = 0,
	Medium                         = 1,
	Low                            = 2,
	None                           = 3,
	EAITargetSystemThreatType_MAX  = 4,
};

enum class EAITargetSystemConfirmationType : uint8
{
	Unconfirmed                    = 0,
	Visual                         = 1,
	Memory                         = 2,
	EAITargetSystemConfirmationType_MAX = 3,
};

enum class EAITargetEnvelopeState : uint8
{
	Uninitialized                  = 0,
	WarmUp                         = 1,
	Active                         = 2,
	Inactive                       = 3,
	EAITargetEnvelopeState_MAX     = 4,
};

enum class ETriggerFirstEncounterCondition : uint8
{
	None                           = 0,
	Hit                            = 1,
	Trigger                        = 2,
	Distance                       = 3,
	ETriggerFirstEncounterCondition_MAX = 4,
};

enum class EAnathemaMultiplayerType : uint8
{
	AMPT_Undefined                 = 0,
	AMPT_Local                     = 1,
	AMPT_Pvp                       = 2,
	AMPT_Coop                      = 3,
	AMPT_MAX                       = 4,
};

enum class EAmmoType : uint8
{
	Arrow                          = 0,
	Bolt                           = 1,
	Throwable                      = 2,
	Undefined                      = 3,
	AmmoType_MAX                   = 4,
};

enum class EAnathemaHitReactionBSInputMode : uint8
{
	None                           = 0,
	ShotYaw                        = 1,
	ShotYawSnappedTo90s            = 2,
	ShotYawPitchClamped            = 3,
	EAnathemaHitReactionBSInputMode_MAX = 4,
};

enum class EDoorOpenRule : uint8
{
	Both                           = 0,
	Front                          = 1,
	Back                           = 2,
	EDoorOpenRule_MAX              = 3,
};

enum class EDoorAxis : uint8
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	EDoorAxis_MAX                  = 3,
};

enum class EAnathemaQuerySystem : uint8
{
	PlayerHost                     = 0,
	PlayerClientAlly               = 1,
	PlayerClientInvader            = 2,
	QuestDirector                  = 3,
	QuestStateReached              = 4,
	QuestStateComplete             = 5,
	NPCInteraction                 = 6,
	QuestStateActivated            = 7,
	EAnathemaQuerySystem_MAX       = 8,
};

enum class EConditionMode : uint8
{
	Simple                         = 0,
	Advanced                       = 1,
	EConditionMode_MAX             = 2,
};

enum class EHexRotationRateMode : uint8
{
	Default                        = 0,
	FocusUsesRotationRate          = 1,
	RotateBetweenAngles            = 2,
	EHexRotationRateMode_MAX       = 3,
};

enum class EHolsterGroup : uint8
{
	Melee1H                        = 0,
	Melee2H                        = 1,
	MeleeDW                        = 2,
	Lantern                        = 3,
	RangedWeapon                   = 4,
	Throwable                      = 5,
	MAX                            = 6,
	Undefined                      = 255,
};

enum class EArmorType : uint8
{
	Helmet                         = 0,
	Brestplate                     = 1,
	Gloves                         = 2,
	Boots                          = 3,
	Accessories                    = 4,
	EArmorType_MAX                 = 5,
};

enum class ETargetToApply : uint8
{
	All                            = 0,
	Allies                         = 1,
	AlliesAndMe                    = 2,
	Me                             = 3,
	Enemies                        = 4,
	EnemiesAndSmallAllies          = 5,
	AlliesAndNeutral               = 6,
	ETargetToApply_MAX             = 7,
};

enum class EHexDamageDefinitionBehavior : uint8
{
	Damage                         = 0,
	Grab                           = 1,
	TriggerReaction                = 2,
	None                           = 3,
	EHexDamageDefinitionBehavior_MAX = 4,
};

enum class EHexDamageMultipliersSource : uint8
{
	Default                        = 0,
	SpellPower                     = 1,
	EHexDamageMultipliersSource_MAX = 2,
};

enum class EAttributeBonusType : uint8
{
	None                           = 0,
	Positive                       = 1,
	Negative                       = 2,
	EAttributeBonusType_MAX        = 3,
};

enum class EAIBodyStance : uint8
{
	InactiveGuarder                = 0,
	InactivePatroller              = 1,
	InactiveAmbusher               = 2,
	Investigate                    = 3,
	Combat                         = 4,
	EAIBodyStance_MAX              = 5,
};

enum class EAIMoveStyle : uint8
{
	Walk                           = 0,
	Run                            = 1,
	Sprint                         = 2,
	EAIMoveStyle_MAX               = 3,
};

enum class ETargetProximityStatus : uint8
{
	Unreachable                    = 0,
	Close                          = 1,
	Distant                        = 2,
	ETargetProximityStatus_MAX     = 3,
};

enum class EHexCardinalDirection : uint8
{
	Forward                        = 0,
	Backward                       = 1,
	Left                           = 2,
	Right                          = 3,
	EHexCardinalDirection_MAX      = 4,
};

enum class EEquipAnimationType : uint8
{
	None                           = 0,
	Top                            = 1,
	BackCenter                     = 2,
	BackCenterRanged               = 3,
	Bottom                         = 4,
	BottomCrossed                  = 5,
	BottomCrossedLantern           = 6,
	EEquipAnimationType_MAX        = 7,
};

enum class EEquipAnimationState : uint8
{
	NotActive                      = 0,
	Active                         = 1,
	EEquipAnimationState_MAX       = 2,
};

enum class EArmorTintAttributeType : uint8
{
	Undefined                      = 0,
	Head_Metal                     = 1,
	Head_Leather                   = 2,
	Head_Fabric                    = 3,
	Head_Intensity                 = 4,
	Arms_Metal                     = 5,
	Arms_Leather                   = 6,
	Arms_Fabric                    = 7,
	Arms_Intensity                 = 8,
	Body_Metal                     = 9,
	Body_Leather                   = 10,
	Body_Fabric                    = 11,
	Body_Intensity                 = 12,
	Legs_Metal                     = 13,
	Legs_Leather                   = 14,
	Legs_Fabric                    = 15,
	Legs_Intensity                 = 16,
	EArmorTintAttributeType_MAX    = 17,
};

enum class ETattooType : uint8
{
	BodyPaint                      = 0,
	Scarification                  = 1,
	Tattoo                         = 2,
	Scar                           = 3,
	Undefined                      = 4,
	ETattooType_MAX                = 5,
};

enum class ETattooLocation : uint8
{
	Head_Forehead                  = 0,
	Head_LeftEye                   = 1,
	Head_RightEye                  = 2,
	Head_Nose                      = 3,
	Head_Mouth                     = 4,
	Body_Front                     = 5,
	Body_Back                      = 6,
	Body_LeftArm                   = 7,
	Body_RightArm                  = 8,
	Body_LeftLeg                   = 9,
	Body_RightLeg                  = 10,
	Undefined                      = 11,
	ETattooLocation_MAX            = 12,
};

enum class EAngleCheckMode : uint8
{
	Direction                      = 0,
	Range                          = 1,
	EAngleCheckMode_MAX            = 2,
};

enum class EeAIDirection : uint8
{
	Forward                        = 0,
	Back                           = 1,
	Left                           = 2,
	Right                          = 3,
	EAIDirection_MAX               = 4,
};

enum class EReactionType : uint8
{
	Caution                        = 0,
	Search                         = 1,
	EReactionType_MAX              = 2,
};

enum class EHexBlackBoardEntryComparison : uint8
{
	Equal                          = 0,
	NotEqual                       = 1,
	Greater                        = 2,
	Less                           = 3,
	EHexBlackBoardEntryComparison_MAX = 4,
};

enum class EHexAttributeOperation : uint8
{
	Single                         = 0,
	Ratio                          = 1,
	EHexAttributeOperation_MAX     = 2,
};

enum class EHexNavLinkProperty : uint8
{
	Direction                      = 0,
	Height                         = 1,
	Length                         = 2,
	EHexNavLinkProperty_MAX        = 3,
};

enum class EHexNavLinkDistanceCheckOperationType : uint8
{
	Min                            = 0,
	Max                            = 1,
	Range                          = 2,
};

enum class ECooldownComparison : uint8
{
	NotInCooldown                  = 0,
	Greater                        = 1,
	Less                           = 2,
	CooldownComparison_MAX         = 3,
};

enum class EeSamplingConsiderationParam : uint8
{
	Dummy                          = 0,
	DistanceToTarget               = 1,
	HorizontalDistanceToTarget     = 2,
	OwnerHealthRate                = 3,
	TargetHealthRate               = 4,
	OwnerStaminaRate               = 5,
	TargetStaminaRate              = 6,
	OwnerMPRate                    = 7,
	TargetMPRate                   = 8,
	ESamplingConsiderationParam_MAX = 9,
};

enum class EHexConditionMode : uint8
{
	TimeBased                      = 0,
	DistanceWalkedToGoalBased      = 1,
	None                           = 2,
	EHexConditionMode_MAX          = 3,
};

enum class EHexWindowState : uint8
{
	None                           = 0,
	Running                        = 1,
	Done                           = 2,
	EHexWindowState_MAX            = 3,
};

enum class EHexOverrideFocusMode : uint8
{
	DoNotOverride                  = 0,
	Snap                           = 1,
	RotateAtRate                   = 2,
	Locked                         = 3,
	EHexOverrideFocusMode_MAX      = 4,
};

enum class EHexOverrideFocusType : uint8
{
	Actor                          = 0,
	Location                       = 1,
	Always                         = 2,
	EHexOverrideFocusType_MAX      = 3,
};

enum class EActionNodeState : uint8
{
	None                           = 0,
	Waiting                        = 1,
	Running                        = 2,
	EActionNodeState_MAX           = 3,
};

enum class EAIDodgeDirection : uint8
{
	Forward                        = 0,
	Back                           = 1,
	Left                           = 2,
	Right                          = 3,
	EAIDodgeDirection_MAX          = 4,
};

enum class EMoveSidewaysDirection : uint8
{
	Random                         = 0,
	Left                           = 1,
	Right                          = 2,
	EMoveSidewaysDirection_MAX     = 3,
};

enum class EWaitFirstEncounterAnimationToPlay : uint8
{
	WaitFirstEncounterAnimation    = 0,
	TriggerFirstEncounterAnimation = 1,
	EWaitFirstEncounterAnimationToPlay_MAX = 2,
};

enum class EChangeEquipmentAction : uint8
{
	Equip                          = 0,
	Unequip                        = 1,
	EChangeEquipmentAction_MAX     = 2,
};

enum class ECharacterClassUnlockType : uint8
{
	None                           = 0,
	EndGame                        = 1,
	DLC                            = 2,
	EndGameOrDLC                   = 3,
	ECharacterClassUnlockType_MAX  = 4,
};

enum class ECharacterTickState : uint8
{
	ENeedsEvaluation               = 0,
	EEnabled                       = 1,
	ESkippingFrames                = 2,
	ERealmDisabled                 = 3,
	EDead                          = 4,
	EMaxDistanceDisabled           = 5,
	EBudgetDisabled                = 6,
	ECharacterTickState_MAX        = 7,
};

enum class ELodAISense : uint8
{
	None                           = 0,
	Sight                          = 1,
	Hearing                        = 2,
	ELodAISense_MAX                = 3,
};

enum class ECharCreationCameraMode : uint8
{
	Rotate_Zoom                    = 0,
	Rotate_Zoom_Trace              = 1,
	Rotate                         = 2,
	ECharCreationCameraMode_MAX    = 3,
};

enum class EClientDisconnectReason : uint8
{
	ConnectionLost                 = 0,
	KickedByHost                   = 1,
	ClientInitiatedLeave           = 2,
	FinalizingInvasion             = 3,
	FinalizingInvasionByDeath      = 4,
	PlayerRemovedFromSession       = 5,
	NoSaveGameData                 = 6,
	EClientDisconnectReason_MAX    = 7,
};

enum class ECollisionMaskFilter : uint8
{
	IgnoredByPlayerMove            = 0,
	ECollisionMaskFilter_MAX       = 1,
};

enum class ESubsteppedTraceMode : uint8
{
	None                           = 0,
	StrippedTrace                  = 1,
	MontageSampling                = 2,
	ESubsteppedTraceMode_MAX       = 3,
};

enum class EShowStreamingLevelsSortMode : uint8
{
	None                           = 0,
	StaticMeshMemory               = 1,
	TileMemory                     = 2,
	StaticMeshCount                = 3,
	TileCount                      = 4,
	ActorCount                     = 5,
	First                          = 0,
	Last                           = 5,
	EShowStreamingLevelsSortMode_MAX = 6,
};

enum class EDialogueType : uint8
{
	Undefined                      = 0,
	Welcome                        = 1,
	Normal                         = 2,
	Question                       = 3,
	Vendor                         = 4,
	Subtitles                      = 5,
	Farewell                       = 6,
	EDialogueType_MAX              = 7,
};

enum class EDLCStatus : uint8
{
	DLCNone                        = 0,
	DLCAvailable                   = 1,
	DLCNotAvailable                = 2,
	OnlyDLCLicenseAvailable        = 3,
	OnlyDLCReceiptsAvailable       = 4,
	EDLCStatus_MAX                 = 5,
};

enum class EDLCName : uint8
{
	None                           = 0,
	DeluxeDLC                      = 1,
	DarkCrusaderDLC                = 2,
	StartingBoostDLC               = 3,
	ShadersPackDLC                 = 4,
	EDLCName_MAX                   = 5,
};

enum class EForgeAnchorFailReason : uint8
{
	Unknown                        = 0,
	InsufficientResources          = 1,
	InsideForbiddenArea            = 2,
	EnemiesTooNear                 = 3,
	NavMeshNotFound                = 4,
	CollisionWithWorld             = 5,
	EForgeAnchorFailReason_MAX     = 6,
};

enum class EDualRealmState : uint8
{
	Real                           = 0,
	Umbral                         = 1,
	Both                           = 2,
	None                           = 3,
	EDualRealmState_MAX            = 4,
};

enum class EEnergyUseRule : uint8
{
	FullRequired                   = 0,
	AboveZero                      = 1,
	MAX                            = 2,
};

enum class ERegenEnergyState : uint8
{
	Normal                         = 0,
	Exhausted                      = 1,
	WasExhausted                   = 2,
	Tired                          = 3,
	WasTired                       = 4,
	MAX                            = 5,
};

enum class EAnathemaEnvironemntHitFXIntensity : uint8
{
	Default                        = 0,
	Low                            = 1,
	Mid                            = 2,
	High                           = 3,
	EAnathemaEnvironemntHitFXIntensity_MAX = 4,
};

enum class EEquipHand : uint8
{
	Left                           = 0,
	Right                          = 1,
	EEquipHand_MAX                 = 2,
};

enum class EHexEquipmentLoadTier : uint8
{
	Light                          = 0,
	Medium                         = 1,
	Heavy                          = 2,
	Encumbered                     = 3,
	EHexEquipmentLoadTier_MAX      = 4,
};

enum class EStatComparisonDirection : uint8
{
	Undefined                      = 0,
	BiggerIsBetter                 = 1,
	SmallerIsBetter                = 2,
	EStatComparisonDirection_MAX   = 3,
};

enum class EStatComparisonResult : uint8
{
	Undefined                      = 0,
	Equal                          = 1,
	Better                         = 2,
	Worse                          = 3,
	EStatComparisonResult_MAX      = 4,
};

enum class ESupportedPlatforms : uint8
{
	ESP_DEFAULT                    = 0,
	ESP_WINDOWS                    = 1,
	ESP_PS5                        = 2,
	ESP_XBOX                       = 3,
	ESP_MAX                        = 4,
};

enum class EAnathemaHitFXDamageIntensity : uint8
{
	ADL_None                       = 0,
	ADL_Low                        = 1,
	ADL_Mid                        = 2,
	ADL_High                       = 3,
	ADL_Epic                       = 4,
	ADL_MAX                        = 5,
};

enum class EAnathemaUnarmed : uint8
{
	AU_None                        = 0,
	AU_Kick                        = 1,
	AU_Punch                       = 2,
	AU_Head                        = 3,
	AU_MAX                         = 4,
};

enum class EAnathemaHitFXType : uint8
{
	AWHFX_Hit                      = 0,
	AWHFX_Block                    = 1,
	AWHFX_MAX                      = 2,
};

enum class EDamageAmount : uint8
{
	None                           = 0,
	SuperLight                     = 1,
	Light                          = 2,
	Medium                         = 3,
	Heavy                          = 4,
	SuperHeavy                     = 5,
	EDamageAmount_MAX              = 6,
};

enum class ESelectedRangedOption : uint8
{
	Lantern                        = 0,
	Ranged                         = 1,
	ESelectedRangedOption_MAX      = 2,
};

enum class ESensesActivationReaction : uint8
{
	ApproachSource                 = 0,
	WaitBattleStartDistance        = 1,
	LookAtSource                   = 2,
	RunToSource                    = 3,
	StartBattleAI                  = 4,
	ESensesActivationReaction_MAX  = 5,
};

enum class EDamageLevel : uint8
{
	None                           = 0,
	NoStagger                      = 1,
	ShortStagger                   = 2,
	LongStagger                    = 3,
	StaggerToFloor                 = 4,
	StaggerBackwards               = 5,
	FacePlant                      = 6,
	AirJuggleStagger               = 7,
	Push                           = 8,
	EDamageLevel_MAX               = 9,
};

enum class EAttackAttribute : uint8
{
	None                           = 0,
	Slash                          = 1,
	Strike                         = 2,
	Thrust                         = 3,
	Standard                       = 4,
	EAttackAttribute_MAX           = 5,
};

enum class EWeaponCategory : uint8
{
	Sword                          = 0,
	Mace                           = 1,
	Shield                         = 2,
	EWeaponCategory_MAX            = 3,
};

enum class EGuardMovesetCategory : uint8
{
	Weapon                         = 0,
	Shield                         = 1,
	EGuardMovesetCategory_MAX      = 2,
};

enum class ELadderDirection : uint8
{
	None                           = 0,
	Up                             = 1,
	Down                           = 2,
	ELadderDirection_MAX           = 3,
};

enum class EInventoryInteractionActionType : uint8
{
	Use                            = 0,
	Leave                          = 1,
	Destroy                        = 2,
	Donate                         = 3,
	Sell                           = 4,
	Buy                            = 5,
	EInventoryInteractionActionType_MAX = 6,
};

enum class EShotCurrentState : uint8
{
	None                           = 0,
	Reloading                      = 1,
	StartingNotEquipped            = 2,
	Equipped                       = 3,
	Charging                       = 4,
	ChargedLoop                    = 5,
	Shooting                       = 6,
	Failed                         = 7,
	EShotCurrentState_MAX          = 8,
};

enum class ERelativeFlightMovementType : uint8
{
	None                           = 0,
	RelativeToTargetHeight         = 1,
	RelativeToTarget               = 2,
	ERelativeFlightMovementType_MAX = 3,
};

enum class EHexWidgetInputMode : uint8
{
	Default                        = 0,
	GameAndMenu                    = 1,
	Game                           = 2,
	Menu                           = 3,
	Custom                         = 4,
	EHexWidgetInputMode_MAX        = 5,
};

enum class EAlertType : uint8
{
	AlertType_OnCombat             = 0,
	AlertType_OnEvent              = 1,
	AlertType_MAX                  = 2,
};

enum class EApproachMode : int32
{
	TargetActor                    = 0,
	Location                       = 1,
	EApproachMode_MAX              = 2,
};

enum class EHexWalkOffLedgesRequestPriority : uint8
{
	Normal                         = 0,
	High                           = 1,
	EHexWalkOffLedgesRequestPriority_MAX = 2,
};

enum class EHexAILineOfSightOffsetType : uint8
{
	None                           = 0,
	OwnerEyes_Vertical             = 1,
	TargetEyes_Vertical            = 2,
	Custom                         = 3,
	EHexAILineOfSightOffsetType_MAX = 4,
};

enum class EHexSensesMask : uint8
{
	None                           = 0,
	Sight                          = 2,
	Hearing                        = 4,
	Damage                         = 8,
	ESP                            = 16,
	Team                           = 32,
	Touch                          = 64,
	Prediction                     = 128,
	EHexSensesMask_MAX             = 129,
};

enum class EHexTurnToTargetMode : uint8
{
	TurnToActor                    = 0,
	TurnToLocation                 = 1,
	TurnToDirection                = 2,
	EHexTurnToTargetMode_MAX       = 3,
};

enum class EHexBoneTransformType : uint8
{
	Absolute                       = 0,
	Relative                       = 1,
	EHexBoneTransformType_MAX      = 2,
};

enum class EAIRelativeDirection : uint8
{
	None                           = 0,
	Forward                        = 1,
	Backwards                      = 2,
	Left                           = 4,
	Right                          = 8,
	EAIRelativeDirection_MAX       = 9,
};

enum class EHexAIObstacleMask : uint8
{
	None                           = 0,
	WorldStatic                    = 1,
	WorldDynamic                   = 2,
	Players                        = 4,
	NPC                            = 8,
	Destructibles                  = 16,
	EHexAIObstacleMask_MAX         = 17,
};

enum class ESocialCoinsType : uint8
{
	Blue                           = 0,
	Red                            = 1,
	Yellow                         = 2,
	Count                          = 3,
	ESocialCoinsType_MAX           = 4,
};

enum class ESocialAction : uint8
{
	Avenge                         = 0,
	PvP                            = 1,
	Coop                           = 2,
	Count                          = 3,
	ESocialAction_MAX              = 4,
};

enum class ESocialRewardType : uint8
{
	Avenge_Standard                = 0,
	Avenge_Dificult                = 1,
	PvP_Kill                       = 2,
	Coop_Standard                  = 3,
	Coop_Dificult                  = 4,
	Debug_Avenge                   = 5,
	Debug_PvP                      = 6,
	Debug_Coop                     = 7,
	Count                          = 8,
	ESocialRewardType_MAX          = 9,
};

enum class EReportReason : uint8
{
	Cheating                       = 0,
	Count                          = 1,
	EReportReason_MAX              = 2,
};

enum class EDirectionCheckMode : uint8
{
	Distance                       = 0,
	Time                           = 1,
	EDirectionCheckMode_MAX        = 2,
};

enum class EDirectionValidationMode : uint8
{
	Any                            = 0,
	All                            = 1,
	EDirectionValidationMode_MAX   = 2,
};

enum class EAIWorldReaction : uint8
{
	Dismemberment_LeftArm          = 0,
	Dismemberment_RightArm         = 1,
	Dismemberment_Head             = 2,
	Stunned                        = 3,
	BossIntroCinematic             = 4,
	EAIWorldReaction_MAX           = 5,
};

enum class ECombatRole : uint8
{
	None                           = 0,
	Attacker                       = 1,
	Cover                          = 2,
	Spectator                      = 3,
	ECombatRole_MAX                = 4,
};

enum class EHexBattleEffectParamType : uint8
{
	Numeric                        = 0,
	String                         = 1,
	Attribute                      = 2,
	EHexBattleEffectParamType_MAX  = 3,
};

enum class ECombatEventState : uint8
{
	StartMusic                     = 0,
	StopMusic                      = 1,
	StopMusicHostDeath             = 2,
	DeathScreen                    = 3,
	None                           = 4,
	ECombatEventState_MAX          = 5,
};

enum class EDistanceOptionMode : int32
{
	Axis2d                         = 0,
	Axis3d                         = 1,
	Vertical                       = 2,
	EDistanceOptionMode_MAX        = 3,
};

enum class ENonInterpMode : int32
{
	Start                          = 0,
	End                            = 1,
	ENonInterpMode_MAX             = 2,
};

enum class EFollowPitchMode : int32
{
	None                           = 0,
	Pulling                        = 1,
	Always                         = 2,
	EFollowPitchMode_MAX           = 3,
};

enum class ETransitionPriority : uint8
{
	Traversal                      = 0,
	Combat                         = 1,
	PlayerActions                  = 2,
	Count                          = 3,
	ETransitionPriority_MAX        = 4,
};

enum class ETransitionMode : uint8
{
	OnEnter                        = 0,
	OnExit                         = 1,
	ETransitionMode_MAX            = 2,
};

enum class EHexFrustumDefinitionType : uint8
{
	FOV                            = 0,
	PlaneSize                      = 1,
	EHexFrustumDefinitionType_MAX  = 2,
};

enum class EHexDamageFromSourceToTarget : uint8
{
	Undefined                      = 0,
	EnemyToPlayer                  = 1,
	PlayerToEnemy                  = 2,
	EnemyToEnemy                   = 3,
	PlayerToPlayer                 = 4,
	EHexDamageFromSourceToTarget_MAX = 5,
};

enum class EHexDamageFilter : uint8
{
	Damage                         = 0,
	Ignore                         = 1,
	EHexDamageFilter_MAX           = 2,
};

enum class EHexEnvInteractionSimulationBit : uint8
{
	None                           = 0,
	Water                          = 1,
	Foliage                        = 2,
	Snow                           = 4,
	EHexEnvInteractionSimulationBit_MAX = 5,
};

enum class ELOSTestType : uint8
{
	ItemToContext                  = 0,
	ContextToItem                  = 1,
	Invalid                        = 2,
	ELOSTestType_MAX               = 3,
};

enum class EHexFocusDirectionUpdateMode : uint8
{
	Snap                           = 0,
	RotateAtRate                   = 1,
	Locked                         = 2,
	RotateBetweenAngles            = 3,
	HexFocusDirectionUpdateMode_MAX = 4,
};

enum class EFSRQualityMode : int32
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EFSRQualityMode_MAX            = 4,
};

enum class EDLSSQualityMode : int32
{
	UltraPerformance               = 0,
	Performance                    = 1,
	Balanced                       = 2,
	Quality                        = 3,
	DLAA                           = 4,
	EDLSSQualityMode_MAX           = 5,
};

enum class ENVReflexMode : int32
{
	Off                            = 0,
	LowLatency                     = 1,
	LowLatencyWithBoost            = 2,
	ENVReflexMode_MAX              = 3,
};

enum class ESubtitlesSizePreset : uint8
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	ESubtitlesSizePreset_MAX       = 3,
};

enum class EPresetRenderMode : int32
{
	Performance                    = 0,
	Quality                        = 1,
	EPresetRenderMode_MAX          = 2,
};

enum class EHexNavDebugEventType : uint8
{
	NavChunk                       = 0,
	DirtyArea                      = 1,
	TileState                      = 2,
	EHexNavDebugEventType_MAX      = 3,
};

enum class EHexNavEdgeSide : uint8
{
	Left                           = 0,
	Right                          = 1,
	None                           = 2,
	EHexNavEdgeSide_MAX            = 3,
};

enum class EHexNavGetSideMode : uint8
{
	Default                        = 0,
	Inversed                       = 1,
	EHexNavGetSideMode_MAX         = 2,
};

enum class EHexFunnelState : uint8
{
	None                           = 0,
	NotNeeded                      = 1,
	Running                        = 2,
	Done                           = 3,
	EHexFunnelState_MAX            = 4,
};

enum class EHexNavLinkDirection : uint8
{
	Up                             = 0,
	Down                           = 1,
	Bridge                         = 2,
	None                           = 3,
	EHexNavLinkDirection_MAX       = 4,
};

enum class EHexNavLinkActionType_Down : uint8
{
	DoNothing                      = 0,
	Fall                           = 1,
	EHexNavLinkActionType_MAX      = 2,
};

enum class EHexNavLinkActionType_Up : uint8
{
	DoNothing                      = 0,
	Jump                           = 1,
	EHexNavLinkActionType_MAX      = 2,
};

enum class EHexNavLinkUserType : uint8
{
	AI                             = 0,
	Player                         = 1,
	Everyone                       = 2,
	EHexNavLinkUserType_MAX        = 3,
};

enum class EHexNavBoundsGenerationMode : uint8
{
	Automatic                      = 0,
	Manual                         = 1,
	EHexNavBoundsGenerationMode_MAX = 2,
};

enum class EJoinFriendFailureReason : uint8
{
	None                           = 0,
	NotInGame                      = 1,
	HasInvader                     = 2,
	UnableToConnect                = 3,
	NoValidData                    = 4,
	SessionIsFull                  = 5,
	MultiplayerDisabled            = 6,
	AlreadyInSession               = 7,
	SessionDoesNotExist            = 8,
	CouldNotRetrieveAddress        = 9,
	UnknownError                   = 10,
	BlockedByAntiCheat             = 11,
	EJoinFriendFailureReason_MAX   = 12,
};

enum class EHexMultiplayerRole : uint8
{
	OMPR_HOST                      = 0,
	OMPR_ALLY                      = 1,
	OMPR_INVADER                   = 2,
	OMPR_SPECTATOR                 = 3,
	OMPR_NONE                      = 4,
	OMPR_MAX                       = 5,
};

enum class EHexSessionVisibility : uint8
{
	Public                         = 0,
	Friends                        = 1,
	Key                            = 2,
	EHexSessionVisibility_MAX      = 3,
};

enum class EHexDataPersistenceFlags : uint8
{
	ResetsOnWorldReset             = 0,
	ResetsOnNewGamePlus            = 1,
	PersistsOnClient               = 2,
	EHexDataPersistenceFlags_MAX   = 3,
};

enum class EHexCornersOffsettingVersion : uint8
{
	None                           = 0,
	Engine                         = 1,
	Funnel                         = 2,
	PathOffsetter                  = 3,
	EHexCornersOffsettingVersion_MAX = 4,
};

enum class EHexSoulFlayPerformResult : uint8
{
	None                           = 0,
	Success                        = 1,
	HyperArmor                     = 2,
	Blocked                        = 3,
	Parried                        = 4,
	Fail                           = 5,
	EHexSoulFlayPerformResult_MAX  = 6,
};

enum class EHexStateTreeEventType : uint8
{
	StateStart                     = 0,
	StateEnd                       = 1,
	EHexStateTreeEventType_MAX     = 2,
};

enum class ESyncedAnimationRole : uint8
{
	ESAR_Leader                    = 0,
	ESAR_Follower                  = 1,
	ESAR_MAX                       = 2,
};

enum class ESyncedActionRole : uint8
{
	ESAR_Active                    = 0,
	ESAR_Passive                   = 1,
	ESAR_MAX                       = 2,
};

enum class ESyncedAttachmentMode : uint8
{
	ESAM_AttachmentNone            = 0,
	ESAM_AttachmentRelative        = 1,
	ESAM_MAX                       = 2,
};

enum class ETweenType : uint8
{
	Step                           = 0,
	LinearStep                     = 1,
	SmoothStep                     = 2,
	SmootherStep                   = 3,
	QuadraticEaseOut               = 4,
	QuadraticEaseIn                = 5,
	QuadraticEaseInout             = 6,
	QuarticEaseOut                 = 7,
	QuarticEaseIn                  = 8,
	QuarticEaseInout               = 9,
	OcticEaseOut                   = 10,
	OcticEaseIn                    = 11,
	OcticEaseInout                 = 12,
	Count                          = 13,
	ETweenType_MAX                 = 14,
};

enum class EUIExclusivity : uint8
{
	Inclusive                      = 0,
	Exclusive                      = 1,
	Undefined                      = 2,
	EUIExclusivity_MAX             = 3,
};

enum class EUIOnlineMsgCode : uint8
{
	Msg_FeatureRequiresLogin       = 0,
	Msg_LoggedOut                  = 1,
	Msg_RequestFailed              = 2,
	Msg_PurchaseFailed             = 3,
	Msg_DonationFailed             = 4,
	Msg_FeatureOnlyAvailableOnHost = 5,
	Msg_MAX                        = 6,
};

enum class EHitBoxType : uint8
{
	StartBoneOnly                  = 0,
	FromBoneToBone                 = 1,
	EHitBoxType_MAX                = 2,
};

enum class EDoDamageTraceMode : uint8
{
	Undefined                      = 0,
	LineTrace                      = 1,
	ShapeTrace                     = 2,
	EDoDamageTraceMode_MAX         = 3,
};

enum class EDoDamageTargets : uint8
{
	Undefined                      = 0,
	FirstHit                       = 1,
	EveryoneOnce                   = 2,
	EveryoneAlways                 = 3,
	EveryoneHitTimestamp           = 4,
	EDoDamageTargets_MAX           = 5,
};

enum class EDoDamageRebound : uint8
{
	Undefined                      = 0,
	IgnoreFloor                    = 1,
	IgnoreAll                      = 2,
	EDoDamageRebound_MAX           = 3,
};

enum class EDoDamageGeneralMode : uint8
{
	Undefined                      = 0,
	OverlapBased                   = 1,
	TraceBased                     = 2,
	EDoDamageGeneralMode_MAX       = 3,
};

enum class ESpawnType : uint8
{
	SinglePoint_SpawnType          = 0,
	Arc_SpawnType                  = 1,
	Line_SpawnType                 = 2,
	ESpawnType_MAX                 = 3,
};

enum class EShapePivot : uint8
{
	Center                         = 0,
	XAxisBased                     = 1,
	YAxisBased                     = 2,
	ZAxisBased                     = 3,
	EShapePivot_MAX                = 4,
};

enum class EReferenceActor : uint8
{
	Self                           = 0,
	Target                         = 1,
	Instigator                     = 2,
	BlackboardValue                = 3,
	SelfController                 = 4,
	TargetController               = 5,
	EReferenceActor_MAX            = 6,
};

enum class EReferenceActorWhenTargetInvalid : uint8
{
	Self                           = 0,
	Instigator                     = 1,
	EReferenceActorWhenTargetInvalid_MAX = 2,
};

enum class EIntermediateAttachmentMode : uint8
{
	ENone                          = 0,
	EComponent                     = 1,
	EBypass                        = 2,
	EIntermediateAttachmentMode_MAX = 3,
};

enum class EItemSortMode : int32
{
	Normal                         = 0,
	Alphabetical                   = 1,
	Undefined                      = 2,
	EItemSortMode_MAX              = 3,
};

enum class EInteractReason : uint8
{
	Normal                         = 0,
	Failed_MaxItemAmountReached    = 1,
	Failed_ItemAlreadyOwned        = 2,
	EInteractReason_MAX            = 3,
};

enum class EInventoryItemType : uint8
{
	Undefined                      = 0,
	Weapon                         = 1,
	Shield                         = 2,
	Armor                          = 3,
	Magic                          = 4,
	Ammo                           = 5,
	Accessory                      = 6,
	EInventoryItemType_MAX         = 7,
};

enum class EItemInfoDisplayMode : int32
{
	Normal                         = 0,
	Item_Comparison                = 1,
	Level_Comparison               = 2,
	EItemInfoDisplayMode_MAX       = 3,
};

enum class EInventoryVisualizationMode : uint8
{
	Full                           = 0,
	Grid_Character                 = 1,
	Grid_Item                      = 2,
	Grid                           = 3,
	Count                          = 4,
	EInventoryVisualizationMode_MAX = 5,
};

enum class ETitleScreenMode : uint8
{
	Equipment                      = 0,
	Inventory                      = 1,
	Vendor                         = 2,
	Upgrade                        = 3,
	Fast_Travel                    = 4,
	Player_Level_Up                = 5,
	Weapon_Rune_Equipment          = 6,
	Weapon_Rune_Socket             = 7,
	Lantern_Rune_Equipment         = 8,
	Lantern_Rune_Socket            = 9,
	ETitleScreenMode_MAX           = 10,
};

enum class EItemProperties : uint8
{
	Usable                         = 0,
	Inspectable                    = 1,
	Unstackable                    = 2,
	Refillable                     = 3,
	AutoUseOnAddedToPlayerInventory = 4,
	Unique                         = 5,
	Usable_in_Umbral               = 6,
	CanBeSold                      = 7,
	EItemProperties_MAX            = 8,
};

enum class EItemDevStatus : uint8
{
	Disabled                       = 0,
	Development                    = 1,
	Build                          = 2,
	EItemDevStatus_MAX             = 3,
};

enum class ELandingFxType : uint8
{
	NoFx                           = 0,
	Light                          = 1,
	Heavy                          = 2,
	ELandingFxType_MAX             = 3,
};

enum class EWitherChanceOperator : uint8
{
	Add                            = 0,
	Multiply                       = 1,
	EWitherChanceOperator_MAX      = 2,
};

enum class EApplyTagsIntoAbilityResult : uint8
{
	AbilityDoesNotHaveIdentifierTag = 0,
	AbilityWasNotFoundInTheTable   = 1,
	AbilityWasNotChanged           = 2,
	AbilityWasUpdated              = 3,
	EApplyTagsIntoAbilityResult_MAX = 4,
};

enum class EApplyHolsterNotifyResult : uint8
{
	ReplacedOldNotify              = 0,
	ModifiedExistingNotify         = 1,
	Unchanged                      = 2,
	AddedNewNotify                 = 3,
	Error                          = 4,
	EApplyHolsterNotifyResult_MAX  = 5,
};

enum class EFogGateState : uint8
{
	Enabled                        = 0,
	Disabled                       = 1,
	EnabledForClientUnblock        = 2,
	EnabledForClientBlock          = 3,
	None                           = 4,
	EFogGateState_MAX              = 5,
};

enum class EAbilitySystemComponentCreationPolicy : uint8
{
	Never                          = 0,
	Lazy                           = 1,
	Always                         = 2,
	EAbilitySystemComponentCreationPolicy_MAX = 3,
};

enum class ESettingScreenDetailsPanelPosition : uint8
{
	Right                          = 0,
	Bottom                         = 1,
	Hidden                         = 2,
	ESettingScreenDetailsPanelPosition_MAX = 3,
};

enum class EStanceWidgetIndex : uint8
{
	None                           = 0,
	Lantern                        = 1,
	Ranged                         = 2,
	Magic                          = 3,
	Throwable                      = 4,
	EStanceWidgetIndex_MAX         = 5,
};

enum class EHexLoadingState : uint8
{
	None                           = 0,
	Loading                        = 1,
	Loaded                         = 2,
	EHexLoadingState_MAX           = 3,
};

enum class EControllerPreviewControllerModel : uint8
{
	Default                        = 0,
	Xbox                           = 1,
	PS5                            = 2,
	SteamDeck                      = 3,
	EControllerPreviewControllerModel_MAX = 4,
};

enum class EMagicType : uint8
{
	SAA                            = 0,
	BattleEffect                   = 1,
	WeaponBuff                     = 2,
	EMagicType_MAX                 = 3,
};

enum class EMagicFamily : uint8
{
	Radiant                        = 0,
	Rhogar                         = 1,
	Umbral                         = 2,
	EMagicFamily_MAX               = 3,
};

enum class EMagicCueActorTarget : uint8
{
	Caster                         = 0,
	PrimaryWeapon                  = 1,
	EMagicCueActorTarget_MAX       = 2,
};

enum class EMagicCastingRules : uint8
{
	Default                        = 0,
	MeleeProjectile                = 1,
	Melee                          = 2,
	Laser                          = 3,
	EMagicCastingRules_MAX         = 4,
};

enum class EConnectionRejectedReason : uint8
{
	ProcessingDifferentConnection  = 0,
	PlayerInCombat                 = 1,
	RejectedByPlayer               = 2,
	NotReady                       = 3,
	SessionNotFound                = 4,
	BadConnection                  = 5,
	None                           = 6,
	EConnectionRejectedReason_MAX  = 7,
};

enum class ELootTableOverrideMode : uint8
{
	Override                       = 0,
	Add                            = 1,
	ELootTableOverrideMode_MAX     = 2,
};

enum class EParryableReferenceAxis : int32
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	EParryableReferenceAxis_MAX    = 3,
};

enum class EPerLevelUpgradeCurveBehavior : uint8
{
	Multiplicative                 = 0,
	Additive                       = 1,
	Override                       = 2,
	EPerLevelUpgradeCurveBehavior_MAX = 3,
};

enum class EPlayerCharacterAbilityInput : uint8
{
	Sneak                          = 0,
	Walk                           = 1,
	Run                            = 2,
	Jump                           = 3,
	Interact                       = 4,
	Dodge                          = 5,
	Target                         = 6,
	LightAttack                    = 7,
	HeavyAttack                    = 8,
	LightBlock                     = 9,
	HeavyBlock                     = 10,
	DemonForm                      = 11,
	HumanForm                      = 12,
	UseItem                        = 13,
	MAX                            = 14,
};

enum class EPlayerForm : uint8
{
	Human                          = 0,
	Boss0                          = 1,
	Boss6                          = 2,
	Boss7                          = 3,
	MAX                            = 4,
};

enum class ESettingsRemovalOptions : uint8
{
	ZeroEntry                      = 0,
	RemoveAll                      = 1,
	ESettingsRemovalOptions_MAX    = 2,
};

enum class EPlayerSpecialAction : uint8
{
	HeroAttack                     = 0,
	MAX                            = 1,
};

enum class EInputConvertionSpace : uint8
{
	Undefined                      = 0,
	Camera                         = 1,
	Character                      = 2,
	EInputConvertionSpace_MAX      = 3,
};

enum class EPlayerRespawnReason : uint8
{
	Undefined                      = 0,
	Resurrect                      = 1,
	Tethering                      = 2,
	EPlayerRespawnReason_MAX       = 3,
};

enum class EQuestStatus : uint8
{
	Inactive                       = 0,
	Active                         = 1,
	Completed                      = 2,
	Failed                         = 3,
	EQuestStatus_MAX               = 4,
};

enum class EQuestActionType : uint8
{
	None                           = 0,
	RewardItem                     = 1,
	ChangeFaction                  = 2,
	RewardItemLootTable            = 3,
	RemoveItem                     = 4,
	EQuestActionType_MAX           = 5,
};

enum class EHexQuestTaskCompletionType : uint8
{
	Default                        = 0,
	Required                       = 1,
	Optional                       = 2,
	EHexQuestTaskCompletionType_MAX = 3,
};

enum class EQuestTaskType : uint8
{
	None                           = 0,
	Talk                           = 1,
	ReachLocation                  = 2,
	Kill                           = 3,
	KillWithTag                    = 4,
	KillWithDeathReason            = 5,
	GiveItem                       = 6,
	GiveVigor                      = 7,
	RequireItem                    = 8,
	CollectItem                    = 9,
	RequireTagPlayer               = 10,
	RequireTagQuestState           = 11,
	RequireTagQuestGeneral         = 12,
	RequireStatLevel               = 13,
	RequireGear                    = 14,
	RequireAnswer                  = 15,
	RequireActivateAnchor          = 16,
	RequireActivateStigma          = 17,
	RequirePlayerToDie             = 18,
	RequireActivateAnyAnchor       = 19,
	GameplayAbilityEnds            = 20,
	ForgeAnchor                    = 21,
	UpgradePotionToMaxLevel        = 22,
	UpgradeWeaponToMaxLevel        = 23,
	UpgradeLanternToMaxLevel       = 24,
	SocketAnyRune                  = 25,
	SocketWeaponRuneToMax          = 26,
	SocketLanternRuneToMax         = 27,
	ApplyTint                      = 28,
	Revenge                        = 29,
	ShowItem                       = 30,
	RequirePlayGesture             = 31,
	HaveDLC                        = 32,
	EQuestTaskType_MAX             = 33,
};

enum class EQuestTaskActivationScope : uint8
{
	Always                         = 0,
	ReachedByQuest                 = 1,
	EQuestTaskActivationScope_MAX  = 2,
};

enum class EQuestDialogue : uint8
{
	Main                           = 0,
	Loop                           = 1,
	Tasks                          = 2,
	EQuestDialogue_MAX             = 3,
};

enum class EQuestTaskStatus : uint8
{
	Inactive                       = 0,
	Active                         = 1,
	Completed                      = 2,
	Failed                         = 3,
	EQuestTaskStatus_MAX           = 4,
};

enum class ERevengeStatus : uint8
{
	Available                      = 0,
	Completed                      = 1,
	Failed                         = 2,
	Unavailable                    = 3,
	ERevengeStatus_MAX             = 4,
};

enum class EHexRuneShape : uint8
{
	Circle                         = 0,
	Square                         = 1,
	Triangle                       = 2,
	Star                           = 3,
	Meta                           = 4,
	Lantern                        = 5,
	LanternPrimary                 = 6,
	LanternSecondary               = 7,
	EHexRuneShape_MAX              = 8,
};

enum class EHexRuneShardType : uint8
{
	Main                           = 0,
	Secondary                      = 1,
	EHexRuneShardType_MAX          = 2,
};

enum class EHexRuneSize : uint8
{
	Common                         = 0,
	Uncommon                       = 1,
	Rare                           = 2,
	Epic                           = 3,
	Legendary                      = 4,
	Boss                           = 5,
	EHexRuneSize_MAX               = 6,
};

enum class EHexRuneBattleEffectTarget : uint8
{
	Equipment                      = 0,
	Character                      = 1,
	EHexRuneBattleEffectTarget_MAX = 2,
};

enum class EHexRuneEquipmentApplication : uint8
{
	Weapon                         = 0,
	Armor                          = 1,
	EHexRuneEquipmentApplication_MAX = 2,
};

enum class EShapeType : uint8
{
	Box                            = 0,
	Capsule                        = 1,
	Sphere                         = 2,
	Custom                         = 3,
	EShapeType_MAX                 = 4,
};

enum class EProjectileHomingState : uint8
{
	None                           = 0,
	WaitingToStart                 = 1,
	Homing                         = 2,
	Stopped                        = 3,
	EProjectileHomingState_MAX     = 4,
};

enum class EProjectileBehaviourCondition : uint8
{
	Any                            = 0,
	All                            = 1,
	EProjectileBehaviourCondition_MAX = 2,
};

enum class EStopHomingAngleCheckCondition : uint8
{
	Inside                         = 0,
	Outside                        = 1,
	EStopHomingAngleCheckCondition_MAX = 2,
};

enum class EProjectileAimMode : uint8
{
	AimToTarget                    = 0,
	AimToTargetGround              = 1,
	AimToInstigator                = 2,
	None                           = 3,
	AimToBlackboardKey             = 4,
	Dynamic                        = 5,
	DynamicToGround                = 6,
	TargetOrDynamic                = 7,
	EProjectileAimMode_MAX         = 8,
};

enum class EProjectileHomingOffsetMode : uint8
{
	HomingOffset_InitialPosition   = 0,
	HomingOffset_None              = 1,
	HomingOffset_MAX               = 2,
};

enum class EProjectileAimDirection : uint8
{
	AimBothDirections              = 0,
	AimOnlyVertical                = 1,
	AimOnlyHorizontal              = 2,
	EProjectileAimDirection_MAX    = 3,
};

enum class EMeshType : uint8
{
	None                           = 0,
	StaticMesh                     = 1,
	SkeletalMesh                   = 2,
	CustomSkeletalMesh             = 3,
	EMeshType_MAX                  = 4,
};

enum class ELightType : uint8
{
	Directional                    = 0,
	Point                          = 1,
	Spot                           = 2,
	Rect                           = 3,
	MAX                            = 4,
};

enum class ESpawnerSpawningState : uint8
{
	NoCharacterSpawned             = 0,
	SpawningCharacter              = 1,
	CharacterSpawned               = 2,
	FailedToSpawn                  = 3,
	ESpawnerSpawningState_MAX      = 4,
};

enum class ESimpleElevatorState : uint8
{
	NotMoving                      = 0,
	StartMovement                  = 1,
	StandardMovement               = 2,
	StopMovement                   = 3,
	ESimpleElevatorState_MAX       = 4,
};

enum class EStatScalarGrades : uint8
{
	Grade_None                     = 0,
	Grade_E                        = 1,
	Grade_D_Minus                  = 2,
	Grade_D                        = 3,
	Grade_D_Plus                   = 4,
	Grade_C_Minus                  = 5,
	Grade_C                        = 6,
	Grade_C_Plus                   = 7,
	Grade_B_Minus                  = 8,
	Grade_B                        = 9,
	Grade_B_Plus                   = 10,
	Grade_A_Minus                  = 11,
	Grade_A                        = 12,
	Grade_A_Plus                   = 13,
	Grade_S                        = 14,
	Grade_MAX                      = 15,
};

enum class EBasicStat : uint8
{
	Strength                       = 0,
	Agility                        = 1,
	Endurance                      = 2,
	Vitality                       = 3,
	Faith                          = 4,
	Chaos                          = 5,
	Level                          = 6,
	EBasicStat_MAX                 = 7,
};

enum class EHexStatusEffectGEType : uint8
{
	Cooldown                       = 0,
	Overload                       = 1,
	CooldownPause                  = 2,
	OverloadCooldown               = 3,
	EHexStatusEffectGEType_MAX     = 4,
};

enum class EFindTargetFlags : uint8
{
	ZeroEntry                      = 0,
	IgnoreDeadTargets              = 1,
	UseUmbralRules                 = 2,
	IgnoreImmaterialTargets        = 4,
	IgnoreInvisibleTargets         = 8,
	EFindTargetFlags_MAX           = 9,
};

enum class ETutorialGameRealm : uint8
{
	Real                           = 0,
	Umbral                         = 1,
	Any                            = 2,
	Limbo                          = 3,
	LanternFromAxiom               = 4,
	ETutorialGameRealm_MAX         = 5,
};

enum class EUIInteractionAnimation : uint8
{
	None                           = 0,
	Start                          = 1,
	End                            = 2,
	EUIInteractionAnimation_MAX    = 3,
};

enum class EUmbralEyeBlinkState : uint8
{
	Undefined                      = 0,
	Closed                         = 1,
	Opening                        = 2,
	Open                           = 3,
	Closing                        = 4,
	EUmbralEyeBlinkState_MAX       = 5,
};

enum class EeAIActionTargetType : uint8
{
	Self                           = 0,
	Target                         = 1,
	EAIActionTargetType_MAX        = 2,
};

enum class EeAIMovementSpeed : uint8
{
	Patrol                         = 0,
	Walk                           = 1,
	Run                            = 2,
	Sprint                         = 3,
	EAIMovementSpeed_MAX           = 4,
};

enum class EeAIContextType : uint8
{
	Default                        = 0,
	Idle                           = 1,
	Patrol                         = 2,
	Attack                         = 3,
	Reposition                     = 4,
	Interrupt                      = 5,
	SwordPlay                      = 6,
	EAIContextType_MAX             = 7,
};

enum class EeInterruptionType : uint8
{
	None                           = 0,
	ParryTiming                    = 1,
	AttackIncoming                 = 2,
	Damaged                        = 3,
	TargetPerceived                = 4,
	TargetDetected                 = 5,
	TargetAquired                  = 6,
	TargetVisualLost               = 7,
	TargetLost                     = 8,
	TargetChanged                  = 9,
	GameplayEffectApplied          = 10,
	EInterruptionType_MAX          = 11,
};

enum class EVendorMode : uint8
{
	Buy                            = 0,
	Sell                           = 1,
	EVendorMode_MAX                = 2,
};

enum class EVendorTransactionCode : uint8
{
	Failed                         = 0,
	Success                        = 1,
	Failed_NoVigor                 = 2,
	Failed_UniqueItem              = 3,
	Failed_NotEnoughSocialCurrencyBlue = 4,
	Failed_NotEnoughSocialCurrencyRed = 5,
	Failed_NotEnoughSocialCurrencyYellow = 6,
	Failed_MaxItemAmountReached    = 7,
	EVendorTransactionCode_MAX     = 8,
};

enum class EWeaponToBuff : uint8
{
	PrimaryWeapon                  = 0,
	SecondaryWeapon                = 1,
	PrimaryAndSecondary            = 2,
	EWeaponToBuff_MAX              = 3,
};

enum class EAnathemaWeaponHitFXType : uint8
{
	AWHFX_Hit                      = 0,
	AWHFX_Block                    = 1,
	AWHFX_MAX                      = 2,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xA0 (0xA0 - 0x0)
// ScriptStruct LOTF2.InheritedMontagesMap
struct FInheritedMontagesMap
{
public:
	TMap<struct FGameplayTag, TSoftObjectPtr<class UAnimMontage>> Combined;                                          // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UAnimMontage>> Added;                                             // 0x50(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.MultiAnimationInfo
struct FMultiAnimationInfo
{
public:
	TArray<class UAnimSequence*>                 AnimSequences;                                     // 0x0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct LOTF2.VoiceOverMappingEntry
struct FVoiceOverMappingEntry
{
public:
	TSoftObjectPtr<class UAkAudioEvent>          Event;                                             // 0x0(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          FacialAnimation;                                   // 0x30(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct LOTF2.VoiceOverMediaMappingEntry
struct FVoiceOverMediaMappingEntry
{
public:
	TSoftObjectPtr<class UAkMediaAsset>          MediaAsset;                                        // 0x0(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          FacialAnimation;                                   // 0x30(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// ScriptStruct LOTF2.VoiceOverMappings
struct FVoiceOverMappings
{
public:
	TArray<struct FVoiceOverMappingEntry>        Mappings;                                          // 0x0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVoiceOverMediaMappingEntry>   MediaMappings;                                     // 0x10(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UAkAudioEvent>, int32> MappingEntryIndexOfAudioEvent;                     // 0x20(0x50)(Transient, NativeAccessSpecifierPublic)
	TMap<uint32, int32>                          MappingEntryIndexOfMediaAsset;                     // 0x70(0x50)(Transient, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct LOTF2.TurnAnimationInfo
struct FTurnAnimationInfo
{
public:
	class UAnimMontage*                          TurnAnimationMontageToUse;                         // 0x0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>           TurnAnimationMontage;                              // 0x8(0x30)(Deprecated, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                           AngleRange;                                        // 0x38(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct LOTF2.InheritedAnimSequencesMap
struct FInheritedAnimSequencesMap
{
public:
	TMap<struct FGameplayTag, TSoftObjectPtr<class UAnimSequence>> Combined;                                          // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UAnimSequence>> Added;                                             // 0x50(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct LOTF2.InheritedBlendspacessMap
struct FInheritedBlendspacessMap
{
public:
	TMap<struct FGameplayTag, TSoftObjectPtr<class UBlendSpace>> Combined;                                          // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UBlendSpace>> Added;                                             // 0x50(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x5C8 (0x5D0 - 0x8)
// ScriptStruct LOTF2.CharacterAnimationsConfig
struct FCharacterAnimationsConfig : public FTableRowBase
{
public:
	TMap<struct FGameplayTag, class UAnimMontage*> MontagesList;                                      // 0x8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class UAnimSequence*> AnimSequencesList;                                 // 0x58(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class UBlendSpace*> BlendSpacesList;                                   // 0xA8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class UAimOffsetBlendSpace*> AimOffsetsList;                                    // 0xF8(0x50)(Edit, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FMultiAnimationInfo> AnimSequencesArrayList;                            // 0x148(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class UAnimMontage*>                  LooseMontagesList;                                 // 0x198(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVoiceOverMappings                    VoiceOverMappings;                                 // 0x1A8(0xC0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UAnimMontage>> Montages;                                          // 0x268(0x50)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UAnimSequence>> AnimSequences;                                     // 0x2B8(0x50)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UBlendSpace>> BlendSpaces;                                       // 0x308(0x50)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FTurnAnimationInfo>            TurnAnimationInfos;                                // 0x358(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UAimOffsetBlendSpace>> AimOffsets;                                        // 0x368(0x50)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>             AnimationBlueprint;                                // 0x3B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UAnimInstance>           AnimationBP;                                       // 0x3C0(0x30)(Deprecated, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInheritedMontagesMap                 InheritedMontagesMap;                              // 0x3F0(0xA0)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	struct FInheritedAnimSequencesMap            InheritedAnimSequencesMap;                         // 0x490(0xA0)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	struct FInheritedBlendspacessMap             InheritedBlendSpacesMap;                           // 0x530(0xA0)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct LOTF2.LoadingTipData
struct FLoadingTipData
{
public:
	class UTexture2D*                            LoadingTipIcon;                                    // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  LoadingTipName;                                    // 0x8(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  LoadingTipDescription;                             // 0x20(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct LOTF2.AchievementSubsystemConfig
struct FAchievementSubsystemConfig
{
public:
	class UDataTable*                            TrackerTable;                                      // 0x0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x98 - 0x8)
// ScriptStruct LOTF2.AchievementTrackerConfig
struct FAchievementTrackerConfig : public FTableRowBase
{
public:
	TMap<class FName, class FString>             AchievementIdOfOnlineSubsystem;                    // 0x8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EAchievementTrackerType           Type;                                              // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31BA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  QuestId;                                           // 0x5C(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31BB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 Tags;                                              // 0x68(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class ESocialCoinsType                  SocialCoinsType;                                   // 0x88(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31BC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Count;                                             // 0x8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCoopRequired;                                   // 0x90(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31BD[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x68 (0x68 - 0x0)
// ScriptStruct LOTF2.ActionBufferData
struct FActionBufferData
{
public:
	struct FGameplayTag                          AbilityTag;                                        // 0x0(0x8)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                     ActionValue;                                       // 0x8(0x20)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                  GameplayEvents;                                    // 0x28(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        InputTimestamp;                                    // 0x38(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BufferPriority;                                    // 0x3C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle      TargetData;                                        // 0x40(0x28)(NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct LOTF2.InputActionGameplayEventMapping
struct FInputActionGameplayEventMapping
{
public:
	class UInputAction*                          InputAction;                                       // 0x0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class ETriggerEvent, struct FGameplayTag> GameplayEvents;                                    // 0x8(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bCanBeBuffered;                                    // 0x58(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31BE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          AssociatedAbilityTag;                              // 0x5C(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BufferPriority;                                    // 0x64(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputActionPayloadFactory*            InputActionPayloadFactory;                         // 0x68(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2C (0x2C - 0x0)
// ScriptStruct LOTF2.ComboInputsMapping
struct FComboInputsMapping
{
public:
	struct FGameplayTag                          FirstGameplayEvent;                                // 0x0(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          SecondGameplayEvent;                               // 0x8(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeWindow;                                        // 0x10(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          GeneratedGameplayEvent;                            // 0x14(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeBuffered;                                    // 0x1C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31BF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          AssociatedAbilityTag;                              // 0x20(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BufferPriority;                                    // 0x28(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x38 - 0x8)
// ScriptStruct LOTF2.AdaptiveTriggerProperties
struct FAdaptiveTriggerProperties : public FTableRowBase
{
public:
	enum class EAdaptiveTriggerMode              Mode;                                              // 0x8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Position;                                          // 0x9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Strength;                                          // 0xA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Frequency;                                         // 0xB(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Amplitude;                                         // 0xC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        StartPosition;                                     // 0xD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        StartStrength;                                     // 0xE(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        EndPosition;                                       // 0xF(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        EndStrength;                                       // 0x10(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31C0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<uint8>                                Amplitudes;                                        // 0x18(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                Strengths;                                         // 0x28(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct LOTF2.AIArchetypeGatingConfig
struct FAIArchetypeGatingConfig
{
public:
	int32                                        ClassRank;                                         // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        OverrideGateLockOwnerMaxDistance : 1;              // Mask: 0x1, PropSize: 0x10x4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        OverrideGateLockOwnerForgetDistance : 1;           // Mask: 0x2, PropSize: 0x10x4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        OverrideGateLockOwnerIgnoreCenternessDistance : 1; // Mask: 0x4, PropSize: 0x10x4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        OverrideGateLockOwnerMinCenterness : 1;            // Mask: 0x8, PropSize: 0x10x4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        OverrideGateLockOwnerMaxSpeed : 1;                 // Mask: 0x10, PropSize: 0x10x4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_24F : 3;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31C1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GateLockOwnerMaxDistance;                          // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GateLockOwnerForgetDistance;                       // 0xC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GateLockOwnerIgnoreCenternessDistance;             // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GateLockOwnerMinCenterness;                        // 0x14(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GateLockOwnerMaxSpeed;                             // 0x18(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct LOTF2.EnemyAggroData
struct FEnemyAggroData
{
public:
	class ABaseAICharacter*                      Character;                                         // 0x0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAITargetAssociatedSet*                HighestScoringSet;                                 // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31C2[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct LOTF2.EnvironmentActionsData
struct FEnvironmentActionsData
{
public:
	struct FGameplayTagContainer                 RequiredCharacterTags;                             // 0x0(0x20)(Edit, NativeAccessSpecifierPrivate)
	TArray<class UEnvironmentActionData*>        Actions;                                           // 0x20(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct LOTF2.EnvironmentActionsInfo
struct FEnvironmentActionsInfo
{
public:
	class UEnvironmentActionsDataAsset*          ActionsDataAsset;                                  // 0x0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FEnvironmentActionsData               ActionsData;                                       // 0x8(0x30)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct LOTF2.AIInterruptionData
struct FAIInterruptionData
{
public:
	uint8                                        Pad_31C3[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.PatrolPointConfig
struct FPatrolPointConfig
{
public:
	struct FEnvironmentActionsInfo               EnvironmentActions;                                // 0x0(0x38)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        PatrolSpeedMultiplier;                             // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31C4[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct LOTF2.PatrolPointInfo
struct FPatrolPointInfo
{
public:
	uint8                                        Pad_31C5[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPatrolPointConfig                    PointConfig;                                       // 0x18(0x40)(ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.AnimationSource
struct FAnimationSource
{
public:
	struct FGameplayTag                          AnimationTag;                                      // 0x0(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  StartSection;                                      // 0x8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct LOTF2.LandingAnimationInfo
struct FLandingAnimationInfo
{
public:
	float                                        FallHeight;                                        // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimationSource                      LandingAnimation;                                  // 0x4(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF8 - 0x8)
// ScriptStruct LOTF2.GameplayAbilityTargetData_Landed
struct FGameplayAbilityTargetData_Landed : public FGameplayAbilityTargetData
{
public:
	uint8                                        Pad_31C6[0xF0];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x80 (0x80 - 0x0)
// ScriptStruct LOTF2.LeashingBoxInfo
struct FLeashingBoxInfo
{
public:
	uint8                                        Pad_31C7[0x80];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C (0x1C - 0x0)
// ScriptStruct LOTF2.AITargetEnvelopeConfig
struct FAITargetEnvelopeConfig
{
public:
	float                                        ReactionTime;                                      // 0x0(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForgetTime;                                        // 0x4(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackValue;                                       // 0x8(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DecayRate;                                         // 0xC(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SustainValue;                                      // 0x10(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReleaseRate;                                       // 0x14(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForgetRate;                                        // 0x18(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.AITargetDefaultEnvelopeConfig
struct FAITargetDefaultEnvelopeConfig
{
public:
	enum class EAITargetEnvelopeType             Type;                                              // 0x0(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31CA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAITargetEnvelopeConfig               Config;                                            // 0x4(0x1C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct LOTF2.AITargetEnvelopeState
struct FAITargetEnvelopeState
{
public:
	enum class EAITargetEnvelopeState            State;                                             // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31CC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EnvelopeValue;                                     // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActiveTime;                                        // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InactiveTime;                                      // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LastKnownPosition;                                 // 0x10(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LastKnownFacing;                                   // 0x28(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LastKnownStimulusLocation;                         // 0x40(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.AITargetGatingActiveLocationSettings
struct FAITargetGatingActiveLocationSettings
{
public:
	uint8                                        EnableCloseInTime : 1;                             // Mask: 0x1, PropSize: 0x10x0(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        EnableStrafing : 1;                                // Mask: 0x2, PropSize: 0x10x0(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_251 : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31CE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinDistance;                                       // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistance;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseInTime;                                       // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseInDelay;                                      // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StrafeFOV;                                         // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StrafeDelay;                                       // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StrafeSpeed;                                       // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.AITargetGatingInterceptLocationEntry
struct FAITargetGatingInterceptLocationEntry
{
public:
	class AAITargetGatingInterceptLocation*      InterceptLocation;                                 // 0x0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ABaseAIController>      UsingController;                                   // 0x8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct LOTF2.AITargetGatingWaitingLocationEntry
struct FAITargetGatingWaitingLocationEntry
{
public:
	uint8                                        UsingControllerHighPriorityRequest : 1;            // Mask: 0x1, PropSize: 0x10x0(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_252 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31CF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AngleOffset;                                       // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinDistance;                                       // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistance;                                       // 0xC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UsingControllerDistSq;                             // 0x10(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31D1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AAITargetGatingWaitingLocation*        WaitingLocation;                                   // 0x18(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ABaseAIController>      UsingController;                                   // 0x20(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.AITargetGatingWaitingNavDataLocation
struct FAITargetGatingWaitingNavDataLocation
{
public:
	uint8                                        IsValidOnNavMesh : 1;                              // Mask: 0x1, PropSize: 0x10x0(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_253 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31D2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       LastUpdateFrame;                                   // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RelativeWorldLocation;                             // 0x8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct LOTF2.AITargetSystemConfig
struct FAITargetSystemConfig
{
public:
	bool                                         IgnoreGatingLock;                                  // 0x0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31D5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HighThreatValue;                                   // 0x4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MediumThreatValue;                                 // 0x8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowThreatValue;                                    // 0xC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IncludeDefaultEnvelopes;                           // 0x10(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31D7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EAITargetEnvelopeType, struct FAITargetEnvelopeConfig> AITargetSystemEnvelopes;                           // 0x18(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct LOTF2.AkAnathemaEvent
struct FAkAnathemaEvent
{
public:
	uint8                                        Pad_31D8[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         AkEvent;                                           // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSendForLocal;                                     // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31DA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkSwitchValue*                        LocalSwitch;                                       // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSendForPVP;                                       // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31DC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkSwitchValue*                        PVPSwitch;                                         // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSendForCoop;                                      // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31DE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkSwitchValue*                        CoopSwitch;                                        // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsVoiceOver;                                      // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31DF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.TempGameplayEffectHandleArrayForNotifies
struct FTempGameplayEffectHandleArrayForNotifies
{
public:
	uint8                                        Pad_31E0[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x48 - 0x8)
// ScriptStruct LOTF2.GameplayAbilityTargetData_RepositionInfo
struct FGameplayAbilityTargetData_RepositionInfo : public FGameplayAbilityTargetData
{
public:
	uint8                                        Pad_31E1[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct LOTF2.DecalRandomizationData
struct FDecalRandomizationData
{
public:
	int32                                        MaxAmount;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31E4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocationOffset;                                    // 0x8(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               SizeOffset;                                        // 0x20(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationOffset;                                    // 0x38(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        LifeSpanOffset;                                    // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31E6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct LOTF2.SurfaceHit
struct FSurfaceHit
{
public:
	class UPhysicalMaterial*                     PhysicalMaterial;                                  // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x8(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Normal;                                            // 0x20(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.MontageToPlay
struct FMontageToPlay
{
public:
	class UAnimMontage*                          Montage;                                           // 0x0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  StartSection;                                      // 0x8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// ScriptStruct LOTF2.HitReactData
struct FHitReactData
{
public:
	struct FGameplayTag                          HitEventType;                                      // 0x0(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31E7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAnathemaHitReactionBSInputMode   BlendSpaceInputMode;                               // 0x10(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31E8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlendInTime;                                       // 0x14(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlendOutTime;                                      // 0x18(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SlotName;                                          // 0x1C(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGenerateFlinch : 1;                               // Mask: 0x1, PropSize: 0x10x24(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_256 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31E9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 RequiredTags;                                      // 0x28(0x20)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 IgnoreTags;                                        // 0x48(0x20)(Edit, NativeAccessSpecifierPublic)
	float                                        ExtraOffset;                                       // 0x68(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExtraOffsetTime;                                   // 0x6C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRemoveVerticalOffset;                             // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31EA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UGameplayEffect>>   GameplayEffectsToApply;                            // 0x78(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct LOTF2.DirectionalAnimationData
struct FDirectionalAnimationData
{
public:
	struct FGameplayTag                          NoLockOnRollAnimation;                             // 0x0(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          FrontAnimation;                                    // 0x8(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          BackAnimation;                                     // 0x10(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          LeftAnimation;                                     // 0x18(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          RightAnimation;                                    // 0x20(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          BackstepAnimation;                                 // 0x28(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// ScriptStruct LOTF2.HitReactEventData
struct FHitReactEventData
{
public:
	struct FGameplayTag                          AnimationToUse;                                    // 0x0(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectionalAnimationData             DirectionalAnimationsToUse;                        // 0x8(0x30)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                          FallbackAnimationToUse;                            // 0x38(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGenerateFlinch : 1;                               // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_257 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31EB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FlinchIntensity;                                   // 0x44(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, float>             PerPoiseReactionFlinchIntensity;                   // 0x48(0x50)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                        bUseDynamicKnockback : 1;                          // Mask: 0x1, PropSize: 0x10x98(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_258 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31EC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DynamicKnocbackWaitTime;                           // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DynamicKnocbackDuration;                           // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseProtoFrameTimings : 1;                         // Mask: 0x1, PropSize: 0x10xA4(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_259 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31ED[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       ProtoInterruptAtFrame;                             // 0xA8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31EE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UGameplayEffect>>   GameplayEffectsToApply;                            // 0xB0(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bClearBufferOnReaction;                            // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31EF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.DoorActionContext
struct FDoorActionContext
{
public:
	class AActor*                                Instigator;                                        // 0x0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsForced;                                         // 0x8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct LOTF2.AnathemaQuery
struct FAnathemaQuery
{
public:
	uint8                                        SystemsToQuery;                                    // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_31F1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagQuery                     Query;                                             // 0x8(0x48)(Edit, NativeAccessSpecifierPrivate)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct LOTF2.InteractableState
struct FInteractableState
{
public:
	TArray<class FName>                          StatesToTrasition;                                 // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bShouldDisableInteraction;                         // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldDestroyAsc;                                 // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F2[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct LOTF2.InteractableCurrentState
struct FInteractableCurrentState
{
public:
	class FName                                  CurrentStateName;                                  // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTransition;                                       // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F3[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct LOTF2.CreatePlayMontageProxyParameters
struct FCreatePlayMontageProxyParameters
{
public:
	class UAnimMontage*                          MontageToPlay;                                     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Rate;                                              // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  StartSection;                                      // 0xC(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopWhenAbilityEnds;                              // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHexFocusDirectionUpdateMode      FocusUpdateMode;                                   // 0x15(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F4[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AnimRootMotionTranslationScale;                    // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StartTimeSeconds;                                  // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceDisableAutoBlendOut;                         // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x78 - 0x8)
// ScriptStruct LOTF2.AnchorTeleportInfo
struct FAnchorTeleportInfo : public FTableRowBase
{
public:
	int32                                        Order;                                             // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDebugLocation;                                  // 0xC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ShortName;                                         // 0x10(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  LongName;                                          // 0x28(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  DescriptionText;                                   // 0x40(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  LocationText;                                      // 0x58(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UTexture2D*                            PortraitImage;                                     // 0x70(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct LOTF2.ConditionalTagNotifySettings
struct FConditionalTagNotifySettings
{
public:
	enum class EConditionMode                    ConditionMode;                                     // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          ConditionalTagToCheck;                             // 0x4(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCheckIfTagIsNotPresent;                           // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagQuery                     OwnedTagsConditionQuery;                           // 0x10(0x48)(Edit, NativeAccessSpecifierPublic)
	bool                                         bDebugForceNotifyToTrigger;                        // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.AnimTagDestinationDesc
struct FAnimTagDestinationDesc
{
public:
	struct FGameplayTagContainer                 DestinationTags;                                   // 0x0(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.TaggedAnimRowAnim
struct FTaggedAnimRowAnim
{
public:
	class UAnimationAsset*                       Anim;                                              // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 AdditionalAnimTags;                                // 0x8(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                        PlaybackRate;                                      // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31FA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          AllowedNotifyGroups;                               // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB8 - 0x8)
// ScriptStruct LOTF2.TaggedAnimRow
struct FTaggedAnimRow : public FTableRowBase
{
public:
	TArray<struct FTaggedAnimRowAnim>            Anims;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AttackType;                                        // 0x18(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 AnimTags;                                          // 0x20(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 RequiredComboWindowTags;                           // 0x40(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                          SuggestedNextAttackType;                           // 0x60(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FAnimTagDestinationDesc> DestinationDescriptions;                           // 0x68(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct LOTF2.PostProcessBlendWeightData
struct FPostProcessBlendWeightData : public FTableRowBase
{
public:
	float                                        BlendTime;                                         // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetValue;                                       // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETweenType                        Curve;                                             // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31FB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x28 - 0x8)
// ScriptStruct LOTF2.AreaNamesDB
struct FAreaNamesDB : public FTableRowBase
{
public:
	struct FGameplayTag                          LocationId;                                        // 0x8(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Name;                                              // 0x10(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct LOTF2.ArtBookAreaDataAsset
struct FArtBookAreaDataAsset : public FTableRowBase
{
public:
	class FText                                  AreaName;                                          // 0x8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UDataTable*                            ArtDataTable;                                      // 0x20(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInitialyUnlocked;                               // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31FC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          UnlockCondition;                                   // 0x2C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31FD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ImageDescription;                                  // 0x38(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct LOTF2.ArtBookDataAsset
struct FArtBookDataAsset : public FTableRowBase
{
public:
	TSoftObjectPtr<class UTexture2D>             Image;                                             // 0x8(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideUnlock;                                   // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31FE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          UnlockCondition;                                   // 0x3C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31FF[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x88 (0x88 - 0x0)
// ScriptStruct LOTF2.GameplayEffectWithParams
struct FGameplayEffectWithParams
{
public:
	TSubclassOf<class UGameplayEffect>           GameplayEffectClass;                               // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, float>             Params;                                            // 0x8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 DynamicAssetTags;                                  // 0x58(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                        Pad_3200[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               OptionalObject;                                    // 0x80(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.GameplayEffectsWithParamsContainer
struct FGameplayEffectsWithParamsContainer
{
public:
	TArray<struct FGameplayEffectWithParams>     GameplayEffects;                                   // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct LOTF2.HexBattleEffectIdentifier
struct FHexBattleEffectIdentifier
{
public:
	class FName                                  BattleEffectID;                                    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.HexBattleEffectIdentifierContainer
struct FHexBattleEffectIdentifierContainer
{
public:
	TArray<struct FHexBattleEffectIdentifier>    BattleEffects;                                     // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// 0x268 (0x270 - 0x8)
// ScriptStruct LOTF2.AttackDamageDefinition
struct FAttackDamageDefinition : public FTableRowBase
{
public:
	float                                        MotionValue;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3201[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<struct FGameplayTag, float>             DamagePercentageMultiplier;                        // 0x10(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AttackType;                                        // 0x60(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          FXType;                                            // 0x68(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          PoiseReaction;                                     // 0x70(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          PoiseReactionDirection;                            // 0x78(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AttackSourceType;                                  // 0x80(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 AttackProperties;                                  // 0x88(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, float>             FlatDamage;                                        // 0xA8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, float>             Cost;                                              // 0xF8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, float>             HitstopData;                                       // 0x148(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AttackDirection;                                   // 0x198(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectsWithParamsContainer   GameplayEffectsWhenInside;                         // 0x1A0(0x10)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayEffectsWithParamsContainer   GameplayEffects;                                   // 0x1B0(0x10)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FHexBattleEffectIdentifierContainer   BattleEffectsWhenInside;                           // 0x1C0(0x10)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FHexBattleEffectIdentifierContainer   BattleEffects;                                     // 0x1D0(0x10)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 AdditionalDynamicAssetTags;                        // 0x1E0(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                          OnApplicationEvent;                                // 0x200(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHexDamageDefinitionBehavior      DamageDefinitionBehavior;                          // 0x208(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3202[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          AdditionalBehaviorTag;                             // 0x20C(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3203[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagQuery                     QueryNeededToApplyDamage;                          // 0x218(0x48)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class ETargetToApply                    TargetToApply;                                     // 0x260(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHexDamageMultipliersSource       DamageMultipliersSource;                           // 0x261(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3205[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueTag                       OnDamagedGameplayCue;                              // 0x264(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bOnDamagedGameplayCueUseHitLocation;               // 0x26C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3206[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.HitBoxDefinition
struct FHitBoxDefinition
{
public:
	enum class EHitBoxType                       HitBoxType;                                        // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3207[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  StartBoneName;                                     // 0x4(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  EndBoneName;                                       // 0xC(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CapsuleRadius;                                     // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CapsuleLength;                                     // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExtraCapsuleLength;                                // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocalOffset;                                       // 0x20(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAxis                             AxisFromBone;                                      // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInvertAxis;                                       // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableObstacleDetection;                          // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3208[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.TraceSettings
struct FTraceSettings
{
public:
	enum class EDoDamageTraceMode                DoDamageTraceMode;                                 // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDoDamageTargets                  DoDamageTargets;                                   // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3209[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeToConsiderReHit;                               // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDoDamageGeneralMode              DoDamageGeneralMode;                               // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 DamageTraceChannel;                                // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseSecondaryTraceChannel;                         // 0xA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 SecondaryDamageTraceChannel;                       // 0xB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 ReboundTraceChannel;                               // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_320A[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x48 - 0x8)
// ScriptStruct LOTF2.AttackHitBoxesDefinition
struct FAttackHitBoxesDefinition : public FTableRowBase
{
public:
	TArray<struct FHitBoxDefinition>             HitBoxes;                                          // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHitBoxDefinition>             PhysicalHitBoxes;                                  // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHitBoxDefinition>             EnvironmentHitBoxes;                               // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTraceSettings                        TraceSettings;                                     // 0x38(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.GrabAttackDefinition
struct FGrabAttackDefinition
{
public:
	class UHexSyncedAnimationDataAsset*          SyncAnimation;                                     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          EventTagToSendToTargetOnGrab;                      // 0x8(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct LOTF2.DamageDefinitionIdentifier
struct FDamageDefinitionIdentifier
{
public:
	class FName                                  DamageDefID;                                       // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.NextAttackDescriptor
struct FNextAttackDescriptor
{
public:
	class FName                                  NextAttackName;                                    // 0x0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ComboTag;                                          // 0x8(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct LOTF2.AttackDescriptionRow
struct FAttackDescriptionRow : public FTableRowBase
{
public:
	struct FGameplayTag                          AttackIdTag;                                       // 0x8(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          InitialComboTag;                                   // 0x10(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          InitialRequiredTag;                                // 0x18(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNextAttackDescriptor>         PossibleNextAttacks;                               // 0x20(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                Comment;                                           // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// ScriptStruct LOTF2.SpawnDefinition
struct FSpawnDefinition
{
public:
	class FName                                  StartBoneName;                                     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocalOffset;                                       // 0x8(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              LocalRotationOffset;                               // 0x20(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	enum class EAxis                             AxisFromBone;                                      // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInvertAxis;                                       // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAttached;                                         // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAttachedToSpringArm;                              // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetArmLength;                                   // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               SocketOffset;                                      // 0x40(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TargetOffset;                                      // 0x58(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableCameraLag;                                  // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_320B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CameraLagSpeed;                                    // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableCameraRotationLag;                          // 0x78(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_320C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CameraRotationLagSpeed;                            // 0x7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraLagMaxDistance;                              // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAttachedToHit;                                    // 0x84(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldDoRaycastIfTargetValid;                     // 0x85(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRayCastToGroundOnSpawn;                           // 0x86(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRayCastForwardOnSpawn;                            // 0x87(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RayCastToGroundOnSpawnLength;                      // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_320D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocalOffsetAfterRayCastToGround;                   // 0x90(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDontSpawnIfRayCastToGroundDontHit;                // 0xA8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_320E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RayCastFowardOnSpawnLength;                        // 0xAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreParentRotation;                             // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOrient2DOnly;                                     // 0xB1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreBoneRotationAndUseOwnerInstead;             // 0xB2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseOwnerAimOffsetToOverrideRotation;              // 0xB3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EReferenceActor                   ReferenceActor;                                    // 0xB4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EReferenceActorWhenTargetInvalid  ReferenceActorWhenTargetInvalid;                   // 0xB5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_320F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  BlackboardKeyReferenceActor;                       // 0xB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESpawnType                        SpawnType;                                         // 0xC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3210[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ArcMinRadius;                                      // 0xC4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcMaxRadius;                                      // 0xC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bChangeArcRadiusOverTime;                          // 0xCC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3211[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeToChangeArcRadius;                             // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChangedArcMinRadius;                               // 0xD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChangedArcMaxRadius;                               // 0xD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcAngle;                                          // 0xDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcVerticalAngle;                                  // 0xE0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcRandomFinalOffsetMinAngle;                      // 0xE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcRandomFinalOffsetMaxAngle;                      // 0xE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcRandomFinalOffsetMinVerticalAngle;              // 0xEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcRandomFinalOffsetMaxVerticalAngle;              // 0xF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcRandomLocalOffsetMinAngle;                      // 0xF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcRandomLocalOffsetMaxAngle;                      // 0xF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcRandomLocalOffsetMinVerticalAngle;              // 0xFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArcRandomLocalOffsetMaxVerticalAngle;              // 0x100(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseRandomArcAngleInRange;                         // 0x104(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAddsArcRotationToSpawnRotation;                   // 0x105(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3212[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LineSpawnLength;                                   // 0x108(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseRandomPositionInLine;                          // 0x10C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAxis                             LineSpawnAxisOrientation;                          // 0x10D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLineSpawnPivotCentered;                           // 0x10E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLineSpawnAxisInvertOrientation;                   // 0x10F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreTarget;                                     // 0x110(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3213[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpawnDelay;                                        // 0x114(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExtraSpawnDelayByInstance;                         // 0x118(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        NumInstancesToSpawn;                               // 0x11C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCheckIfEnoughResourcesToSpawnSAA;                 // 0x11D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3214[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x148 (0x148 - 0x0)
// ScriptStruct LOTF2.AutonomousAreaSpawnDef
struct FAutonomousAreaSpawnDef
{
public:
	struct FDataTableRowHandle                   AutonomousAbility;                                 // 0x0(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSpawnDefinition                      SpawnDefinition;                                   // 0x10(0x120)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class USubAutonomousAbilityData> SubAutonomousAbilityData;                          // 0x130(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          GameplayCue;                                       // 0x138(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLinkToSpawnerEndPlay;                             // 0x140(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDestroyParent;                                    // 0x141(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnTriggerIgnoreNextSpawnEvents;                   // 0x142(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3215[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct LOTF2.AutonomousAbilityCooldown
struct FAutonomousAbilityCooldown
{
public:
	struct FGameplayTag                          CooldownTag;                                       // 0x0(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CooldownDuration;                                  // 0x8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x750 (0x9C0 - 0x270)
// ScriptStruct LOTF2.AutonomousAbilityDefinition
struct FAutonomousAbilityDefinition : public FAttackDamageDefinition
{
public:
	TSoftClassPtr<class AActor>                  BaseBP;                                            // 0x270(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, float>             ActorParams;                                       // 0x2A0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   OptionalAutonomousAbilityParam;                    // 0x2F0(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UObject>                 OptionalClassParam;                                // 0x300(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LifeSpan;                                          // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3216[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSpawnDefinition                      SpawnDefinition;                                   // 0x338(0x120)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bDestroyOnValidOverlap;                            // 0x458(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDestroyOnPhysicalCollision;                       // 0x459(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3217[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   SpawnAutonomousAbilityOnDestroy;                   // 0x460(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAutonomousAreaSpawnDef               SpawnOnDestroy;                                    // 0x470(0x148)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAutonomousAreaSpawnDef               SpawnOnPhysicalHit;                                // 0x5B8(0x148)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAutonomousAreaSpawnDef               SpawnOnOverlap;                                    // 0x700(0x148)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAutonomousAreaSpawnDef               SpawnOnTimeout;                                    // 0x848(0x148)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 GameplayCueTags;                                   // 0x990(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAutonomousAbilityCooldown            Cooldown;                                          // 0x9B0(0xC)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3218[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct LOTF2.AIAnimatedFlinch
struct FAIAnimatedFlinch
{
public:
	int32                                        AGE;                                               // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DirectionPsi;                                      // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DirectionTheta;                                    // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.FocusOverrideData
struct FFocusOverrideData
{
public:
	class AActor*                                OverrideFocusTarget;                               // 0x0(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3219[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.HexCardinalDirectionAnimationStruct
struct FHexCardinalDirectionAnimationStruct
{
public:
	class UAnimSequence*                         Forward;                                           // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         Backward;                                          // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         Left;                                              // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         Right;                                             // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// ScriptStruct LOTF2.HandAnimInfo
struct FHandAnimInfo
{
public:
	enum class EEquipAnimationType               EquipAnimationType;                                // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEquip;                                            // 0x1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct LOTF2.HandAnimInfoEx
struct FHandAnimInfoEx
{
public:
	struct FHandAnimInfo                         HandAnimInfo;                                      // 0x0(0x2)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	enum class EHolsterableSlot                  HolsterableSlot;                                   // 0x2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHolsterableSlot                  ComplementaryHolsterableSlot;                      // 0x3(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_321A[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AGE;                                               // 0x10(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EEquipAnimationState              EquipAnimationState;                               // 0x14(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_321B[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct LOTF2.HexBattleEffectWithQuery
struct FHexBattleEffectWithQuery
{
public:
	struct FAnathemaQuery                        Query;                                             // 0x0(0x50)(Edit, NativeAccessSpecifierPrivate)
	struct FHexBattleEffectIdentifier            BattleEffectID;                                    // 0x50(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct LOTF2.BodyShapeSubCategoryType
struct FBodyShapeSubCategoryType
{
public:
	class FText                                  Name;                                              // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                  MutableName;                                       // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBodyShapeAttributeType           AttributeType;                                     // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_321C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.BodyShapeCustomizationType
struct FBodyShapeCustomizationType
{
public:
	class FText                                  Name;                                              // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                  MutableName;                                       // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.BodyShapeOptions
struct FBodyShapeOptions
{
public:
	TArray<enum class EBodyShapeAttributeType>   Attributes;                                        // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.PhysMergeConfig
struct FPhysMergeConfig
{
public:
	class UPhysicsAsset*                         OriginalPhysAsset;                                 // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                         FatPhysAsset;                                      // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                         MuscularPhysAsset;                                 // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                         SkinnyPhysAsset;                                   // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct LOTF2.UIShapeData
struct FUIShapeData
{
public:
	class FString                                MutableName;                                       // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bZoomIn;                                           // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterBodyType                bodyType;                                          // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_321D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            Image;                                             // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsMorphTarget;                                    // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBodyShapeCamera                  CameraToUse;                                       // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_321E[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.TattooArray
struct FTattooArray
{
public:
	TArray<struct FUIShapeData>                  Tattoo;                                            // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct LOTF2.TattooDataArray
struct FTattooDataArray
{
public:
	TMap<enum class ETattooLocation, struct FTattooArray> Tattoos;                                           // 0x0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct LOTF2.TattooData
struct FTattooData
{
public:
	TMap<enum class ETattooType, struct FTattooDataArray> HeadTattooData;                                    // 0x0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<enum class ETattooType, struct FTattooDataArray> BodyTattooData;                                    // 0x50(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.UIShapeDataArray
struct FUIShapeDataArray
{
public:
	TArray<struct FUIShapeData>                  Shapes;                                            // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.MorphFeatureArray
struct FMorphFeatureArray
{
public:
	TArray<class FString>                        MutableShapes;                                     // 0x0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct LOTF2.PlayerSocketOverrides
struct FPlayerSocketOverrides
{
public:
	enum class EPropJoint                        Joint;                                             // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_321F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Location;                                          // 0x8(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              Rotation;                                          // 0x20(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.PlayerSocketOverridesArray
struct FPlayerSocketOverridesArray
{
public:
	class FString                                ArmorName;                                         // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPlayerSocketOverrides>        OverriddenSockets;                                 // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct LOTF2.TattooAttributeByLocation
struct FTattooAttributeByLocation
{
public:
	enum class EBodyShapeAttributeType           Color;                                             // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBodyShapeAttributeType           Intensity;                                         // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBodyShapeAttributeType           Opacity;                                           // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBodyShapeAttributeType           Tint;                                              // 0x3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD0 (0xD8 - 0x8)
// ScriptStruct LOTF2.BossRemembranceDefinition
struct FBossRemembranceDefinition : public FTableRowBase
{
public:
	struct FGameplayTag                          BossId;                                            // 0x8(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          QuestStateId;                                      // 0x10(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          RemembranceItemId;                                 // 0x18(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  BossName;                                          // 0x20(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  ItemName;                                          // 0x38(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  BossDescription;                                   // 0x50(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Image_Portrait_Small;                              // 0x68(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Image_Portrait_Big;                                // 0x98(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   VendorTable;                                       // 0xC8(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct LOTF2.StepsToProbability
struct FStepsToProbability
{
public:
	float                                        Step;                                              // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Probability;                                       // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C0 (0x1C0 - 0x0)
// ScriptStruct LOTF2.TargetDesc
struct FTargetDesc
{
public:
	float                                        TranslationStiffnessRampTime;                      // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TranslationStiffness;                              // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TranslationDampingFactor;                          // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3220[0x8C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RotationStiffness;                                 // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationDampingFactor;                             // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3221[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ScreenSpaceDeadZoneRadius;                         // 0xE0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3222[0xDC];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// ScriptStruct LOTF2.LockDistanceSettings
struct FLockDistanceSettings
{
public:
	float                                        WaitingForTargetTime;                              // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraLockOnAngle;                                 // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThresholdAngularDistance;                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraTargetZOffset;                               // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetZOffset;                                     // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x5E8 (0x5E8 - 0x0)
// ScriptStruct LOTF2.AnimationMovesetLayer
struct FAnimationMovesetLayer
{
public:
	struct FCharacterAnimationsConfig            Animations;                                        // 0x0(0x5D0)(RepSkip, NativeAccessSpecifierPublic)
	struct FGameplayTag                          MovesetSourceID;                                   // 0x5D0(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                AnimationSourceClass;                              // 0x5D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Priority;                                          // 0x5E0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3223[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.AnimationMovesetStack
struct FAnimationMovesetStack
{
public:
	TArray<struct FAnimationMovesetLayer>        MovesetLayers;                                     // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.InitialInventoryData
struct FInitialInventoryData
{
public:
	TSubclassOf<class UItemData>                 ItemClassData;                                     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemLevel;                                         // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.CharacterClassUnlockInfo
struct FCharacterClassUnlockInfo
{
public:
	enum class ECharacterClassUnlockType         UnlockType;                                        // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3224[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          QuestCompleteTag;                                  // 0x4(0x8)(Edit, BlueprintVisible, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDLCName                          DLC;                                               // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3225[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             UnlockPortrait;                                    // 0x10(0x30)(Edit, BlueprintVisible, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x208 (0x210 - 0x8)
// ScriptStruct LOTF2.CharacterEquipmentConfig
struct FCharacterEquipmentConfig : public FTableRowBase
{
public:
	TSubclassOf<class UWeaponsData>              PrimaryWeaponDataClass;                            // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PrimaryWeaponLevel;                                // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3226[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UWeaponsData>              SecondaryWeaponDataClass;                          // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SecondaryWeaponLevel;                              // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3227[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class URangedWeaponData>         RangedWeaponDataClass;                             // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RangedWeaponLevel;                                 // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3228[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UEquipementData>         SoulsLanternData;                                  // 0x38(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LanternLevel;                                      // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3229[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UArmorPieceData>         HeadDataClass;                                     // 0x70(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UArmorPieceData>         BodyDataClass;                                     // 0xA0(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UArmorPieceData>         ArmsDataClass;                                     // 0xD0(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UArmorPieceData>         LegsDataClass;                                     // 0x100(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UArmorPieceData>         Ring1DataClass;                                    // 0x130(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UArmorPieceData>         Ring2DataClass;                                    // 0x160(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UArmorPieceData>         AmuletDataClass;                                   // 0x190(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UArmorPieceData>         AccessoriesDataClass;                              // 0x1C0(0x30)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UMagicItemData>>    MagicDataClassArray;                               // 0x1F0(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UAmmoData>>         AmmoDataClassArray;                                // 0x200(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x328 (0x330 - 0x8)
// ScriptStruct LOTF2.CharacterClassData
struct FCharacterClassData : public FTableRowBase
{
public:
	bool                                         bTestCharacter;                                    // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_322A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterClassUnlockInfo             UnlockInfo;                                        // 0x10(0x40)(Edit, BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)
	class FText                                  Name;                                              // 0x50(0x18)(Edit, BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x68(0x18)(Edit, BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   StatsRow;                                          // 0x80(0x10)(Edit, BlueprintVisible, SaveGame, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterEquipmentConfig             EquipmentConfig;                                   // 0x90(0x210)(Edit, BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FInitialInventoryData>         InitialInventory;                                  // 0x2A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FInitialInventoryData>         NotEquippedInitialInventory;                       // 0x2B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         ClassSelectionSound;                               // 0x2C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          CharacterSelectionAnimationTag;                    // 0x2C8(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCustomizableObjectInstance> MaleClassPreset;                                   // 0x2D0(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCustomizableObjectInstance> FemaleClassPreset;                                 // 0x300(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.AttributeInitializationData
struct FAttributeInitializationData
{
public:
	TSubclassOf<class UAttributeSet>             AttributeSetToInitialize;                          // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            AttributesTable;                                   // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct LOTF2.AttackHitCapsuleDefinition
struct FAttackHitCapsuleDefinition
{
public:
	class FName                                  StartSocket;                                       // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  EndSocket;                                         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct LOTF2.DamageParamDefinition
struct FDamageParamDefinition : public FTableRowBase
{
public:
	float                                        Knockback;                                         // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PhysicalDamage;                                    // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaDamage;                                     // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PoiseDamage;                                       // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttackAttribute                  AttackAttribute;                                   // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDamageLevel                      DamageLevel;                                       // 0x19(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_322B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAttackHitCapsuleDefinition>   HitBoxes;                                          // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x74 (0x74 - 0x0)
// ScriptStruct LOTF2.CharacterAIBattleConfig
struct FCharacterAIBattleConfig
{
public:
	float                                        NearDistance;                                      // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiddleDistance;                                    // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarDistance;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutOfRangeDistance;                                // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RetreatHomeMaxDistance;                            // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RetreatHomeDistance;                               // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RetreatHomeBattleDistance;                         // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RetreatHomeLookForTargetTime;                      // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RetreatHomeLookForTargetDistance;                  // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatStartDistance;                               // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TeamAttackEffectivity;                             // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeTeamSpectator;                               // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanRunWhileSpectating;                            // 0x2D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseDefaultSpectatorBehavior;                      // 0x2E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseDefaultDestroyDestructibleBehavior;            // 0x2F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseDefaultAttackReactionBehavior;                 // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_322C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ReactionBlockProbability;                          // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionDeflectProbability;                        // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionParryProbability;                          // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionDodgeProbability;                          // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionBlockProbabilityPerConsecutiveHit;         // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionDeflectProbabilityPerConsecutiveGuardHit;  // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionDodgeProbabilityPerConsecutiveHit;         // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionDodgeProjectileProbability;                // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionBlockProjectileProbability;                // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseMagicSpecificProbability;                      // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_322D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ReactionDodgeMagicProjectileProbability;           // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionBlockMagicProjectileProbability;           // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionSoulFlayBlockProbability;                  // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionSoulFlayParryProbability;                  // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReactionSoulFlayDodgeProbability;                  // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistanceToHitThroughObstaclesInBetweenRealms;   // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct LOTF2.CharacterAITargetConfig
struct FCharacterAITargetConfig
{
public:
	float                                        TargetSwapCooldown;                                // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreFirstDeathInvisibility;                     // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_322E[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct LOTF2.HexSenseConfig_Sight_Coffin_FOV_UI
struct FHexSenseConfig_Sight_Coffin_FOV_UI
{
public:
	struct FVector2D                             FrustumFOV;                                        // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceBetweenFrustumNearAndFarPlanes;            // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_322F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct LOTF2.HexSenseConfig_Sight_Coffin_PlaneSize_UI
struct FHexSenseConfig_Sight_Coffin_PlaneSize_UI
{
public:
	struct FVector2D                             FrustumFarPlaneSize;                               // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceBetweenFrustumNearAndFarPlanes;            // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3230[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.HexSenseConfig_Coffin_Combat_FOV_UI
struct FHexSenseConfig_Coffin_Combat_FOV_UI
{
public:
	struct FVector2D                             CombatFirstNearPlaneSize;                          // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHexSenseConfig_Sight_Coffin_FOV_UI> CombatFOVFrustumDefinitions;                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bUseCombatFrustumLoseSightDefinition;              // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3231[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHexSenseConfig_Sight_Coffin_FOV_UI   CombatFOVFrustumLoseSightDefinition;               // 0x28(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.HexSenseConfig_Coffin_Combat_PlaneSize_UI
struct FHexSenseConfig_Coffin_Combat_PlaneSize_UI
{
public:
	struct FVector2D                             CombatFirstNearPlaneSize;                          // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHexSenseConfig_Sight_Coffin_PlaneSize_UI> CombatPlaneSizeFrustumDefinitions;                 // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bUseCombatFrustumLoseSightDefinition;              // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3232[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHexSenseConfig_Sight_Coffin_PlaneSize_UI CombatPlaneSizeFrustumLoseSightDefinition;         // 0x28(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x100 (0x100 - 0x0)
// ScriptStruct LOTF2.SensesConfig_Sight
struct FSensesConfig_Sight
{
public:
	bool                                         bOmniVision;                                       // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3233[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OmniVisionRadius;                                  // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHexFrustumDefinitionType         CoffinDefinitionType;                              // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3234[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             FirstNearPlaneSize;                                // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHexSenseConfig_Sight_Coffin_FOV_UI> FOVFrustumDefinitions;                             // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bUseFrustumLoseSightDefinition;                    // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3235[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHexSenseConfig_Sight_Coffin_FOV_UI   FOVFrustumLoseSightDefinition;                     // 0x38(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FHexSenseConfig_Sight_Coffin_PlaneSize_UI> PlaneSizeFrustumDefinitions;                       // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FHexSenseConfig_Sight_Coffin_PlaneSize_UI PlaneSizeFrustumLoseSightDefinition;               // 0x60(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bUseDifferentCombatCoffin;                         // 0x78(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3236[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHexSenseConfig_Coffin_Combat_FOV_UI  FOVCombatCoffinSetup;                              // 0x80(0x40)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FHexSenseConfig_Coffin_Combat_PlaneSize_UI PlaneSizeCombatCoffinSetup;                        // 0xC0(0x40)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct LOTF2.SensesConfig_Hearing
struct FSensesConfig_Hearing
{
public:
	float                                        DistanceListen;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct LOTF2.SensesConfig_ESP
struct FSensesConfig_ESP
{
public:
	float                                        DistanceSense;                                     // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatScale;                                       // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinRadiusDuringCombat;                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.SensesConfig_Reaction
struct FSensesConfig_Reaction
{
public:
	enum class ESensesActivationReaction         CautionReaction;                                   // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESensesActivationReaction         SearchReaction;                                    // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldAlertOthers;                                // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3237[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AlertRadiusMeters;                                 // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanReactToAlert;                                  // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3238[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumHitsUntilAngered;                               // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// ScriptStruct LOTF2.CharacterAISensesConfig
struct FCharacterAISensesConfig
{
public:
	struct FSensesConfig_Sight                   Sight;                                             // 0x0(0x100)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSensesConfig_Hearing                 Hearing;                                           // 0x100(0x4)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSensesConfig_ESP                     ESP;                                               // 0x104(0xC)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSensesConfig_Reaction                Reactions;                                         // 0x110(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.RubberBandingAIConfig
struct FRubberBandingAIConfig
{
public:
	bool                                         bShouldEnableRubberBanding;                        // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3239[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DistanceToTarget;                                  // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LimitFallbackDistanceFromHome;                     // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceToBeAtHome;                                // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct LOTF2.AwarenessAIConfig
struct FAwarenessAIConfig
{
public:
	bool                                         bShouldOverrideGlobalData;                         // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_323A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ObstacleOrNavEdgeMinDistanceDefault;               // 0x4(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                DistancesToCheckInCardinalDirections;              // 0x8(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	float                                        CheckForSpaceAroundAI_Rate;                        // 0x18(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CheckForObstaclesAroundAI_Rate;                    // 0x1C(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        ObstaclesMask;                                     // 0x20(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_323B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DestructibleReactionDistance;                      // 0x24(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct LOTF2.NavMovementAIConfig
struct FNavMovementAIConfig
{
public:
	float                                        ComputeFloorDistSweepOffset;                       // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ComputeFloorDistSweepMultiplier;                   // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxGoalDistanceOutOfNavInCentimeters;              // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanNavigateWater;                                 // 0xC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanNavigateFire;                                  // 0xD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanNavigatePoison;                                // 0xE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHexNavLinkActionType_Down        NavLinksConfig_Down;                               // 0xF(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHexNavLinkActionType_Up          NavLinksConfig_Up;                                 // 0x10(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_323C[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.CharacterStatsBasic
struct FCharacterStatsBasic
{
public:
	float                                        Health;                                            // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Vigor;                                             // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VigorCapacity;                                     // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Stamina;                                           // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Poise;                                             // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PoiseLevel;                                        // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Toughness;                                         // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Mana;                                              // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct LOTF2.CharacterBattleStats
struct FCharacterBattleStats
{
public:
	float                                        AttackPhysical;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackFire;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackHoly;                                        // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackDark;                                        // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackMagic;                                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackPoise;                                       // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackStamina;                                     // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackStagger;                                     // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackProvisionalDamage;                           // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackAggro;                                       // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaCost;                                       // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackRepelAmount;                                 // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefensePhysical;                                   // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseSlash;                                      // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseStrike;                                     // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseThrust;                                     // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseFire;                                       // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseHoly;                                       // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseDark;                                       // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseMagic;                                      // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefensePoise;                                      // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseStamina;                                    // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseStagger;                                    // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseProvisionalDamage;                          // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefenseAggro;                                      // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefensePhysical;                              // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefenseFire;                                  // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefenseHoly;                                  // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefenseDark;                                  // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefenseMagic;                                 // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefensePoise;                                 // 0x78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefenseStamina;                               // 0x7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefenseProvisionalDamage;                     // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefenseAggro;                                 // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardAngle;                                        // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardAngleOffset;                                  // 0x8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardStability;                                    // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardDefenseStagger;                               // 0x94(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DeflectionGuard;                                   // 0x98(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DeflectionGuardMultiplierOnParry;                  // 0x9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct LOTF2.CharacterStatusEffectsStats
struct FCharacterStatusEffectsStats
{
public:
	float                                        DamageBleed;                                       // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamagePoison;                                      // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageWither;                                      // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageFrostbite;                                   // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageSmite;                                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageBurn;                                        // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageIgnite;                                      // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct LOTF2.CharacterResitancesStats
struct FCharacterResitancesStats
{
public:
	float                                        ResistanceBleed;                                   // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ResistancePoison;                                  // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ResistanceWither;                                  // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ResistanceFrostbite;                               // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ResistanceSmite;                                   // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ResistanceBurn;                                    // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ResistanceIgnite;                                  // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardResistanceBleed;                              // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardResistancePoison;                             // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardResistanceWither;                             // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardResistanceFrostbite;                          // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardResistanceSmite;                              // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardResistanceBurn;                               // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardResistanceIgnite;                             // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct LOTF2.CharacterLootConfig
struct FCharacterLootConfig
{
public:
	float                                        TODO_Souls;                                        // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_323F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          TODO_ItemsToDrop;                                  // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct LOTF2.CharacterStatsMovement
struct FCharacterStatsMovement
{
public:
	float                                        WalkSpeed;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RunSpeed;                                          // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SprintSpeed;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SprintStaminaCost;                                 // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardSpeed;                                        // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PatrolSpeed;                                       // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PatrolSpeedMultiplier;                             // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultRotationRate;                               // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultRotationRateDuringMontages;                 // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DodgeStaminaBaseCost;                              // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxEquippedWeight;                                 // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EncumbranceThreshold;                              // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct LOTF2.CharacterStaminaConfig
struct FCharacterStaminaConfig
{
public:
	bool                                         StaminaInfinite;                                   // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3243[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TiredStaminaThreshold;                             // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinStamina;                                        // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaRegenRate;                                  // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TiredStaminaRegenRate;                             // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExhaustedStaminaRegenRate;                         // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaRegenDelay;                                 // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExhaustedStaminaRegenDelay;                        // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaStunInitialDuration;                        // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaStunResetDuration;                          // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct LOTF2.CharacterMagicConfig
struct FCharacterMagicConfig
{
public:
	float                                        Mana;                                              // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxMana;                                           // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ManaRegenRate;                                     // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct LOTF2.CharacterAmmoConfig
struct FCharacterAmmoConfig
{
public:
	float                                        Ammo;                                              // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAmmo;                                           // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AmmoRegenRate;                                     // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct LOTF2.CharacterBodyConfigOld
struct FCharacterBodyConfigOld
{
public:
	float                                        HitHeight;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HitRadius;                                         // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Weight;                                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x380 (0x388 - 0x8)
// ScriptStruct LOTF2.CharacterAIConfig
struct FCharacterAIConfig : public FTableRowBase
{
public:
	class UBehaviorTree*                         MasterBehavior;                                    // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class UBehaviorTree*> DynamicBehaviors;                                  // 0x10(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBehaviorTree>          MasterBehaviorTree;                                // 0x60(0x30)(Deprecated, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UBehaviorTree>> Behaviors;                                         // 0x90(0x50)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	class UBlackboardData*                       BlackboardAsset;                                   // 0xE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBlackboardData>        Blackboard;                                        // 0xE8(0x30)(Deprecated, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITargetSystemConfig                 TargetSystemConfig;                                // 0x118(0x68)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRubberBandingAIConfig                RubberBandingConfig;                               // 0x180(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterAISensesConfig              SensesConfig;                                      // 0x190(0x120)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FCharacterAIBattleConfig              BattleConfig;                                      // 0x2B0(0x74)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterAITargetConfig              TargetConfig;                                      // 0x324(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3244[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAwarenessAIConfig                    AwarenessConfig;                                   // 0x330(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                               EnvironmentCapsuleChecksOffset;                    // 0x358(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EnvironmentCapsuleRadiusChecks;                    // 0x370(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNavMovementAIConfig                  NavMovmentConfig;                                  // 0x374(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.TraversalSpline
struct FTraversalSpline
{
public:
	TArray<struct FSplinePoint>                  SplinePoints;                                      // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.CharacterAttributes
struct FCharacterAttributes
{
public:
	float                                        Strength;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Agility;                                           // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Faith;                                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Endurance;                                         // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Vitality;                                          // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Luck;                                              // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Order;                                             // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Chaos;                                             // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1A8 (0x1B0 - 0x8)
// ScriptStruct LOTF2.CharacterStatsConfig
struct FCharacterStatsConfig : public FTableRowBase
{
public:
	struct FCharacterStatsBasic                  BasicStats;                                        // 0x8(0x20)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bUsesAttributes;                                   // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3248[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterAttributes                  Attributes;                                        // 0x2C(0x20)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterBattleStats                 BattleStats;                                       // 0x4C(0xA0)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterStatsMovement               MovementStats;                                     // 0xEC(0x30)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterStaminaConfig               StaminaConfig;                                     // 0x11C(0x28)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterMagicConfig                 MagicStats;                                        // 0x144(0xC)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterAmmoConfig                  AmmoStats;                                         // 0x150(0xC)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterStatusEffectsStats          StatusEffectsStats;                                // 0x15C(0x1C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterResitancesStats             ResistancesStats;                                  // 0x178(0x38)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct LOTF2.CharacterAnimConfig
struct FCharacterAnimConfig : public FTableRowBase
{
public:
	TMap<enum class EStanceType, struct FCharacterAnimationsConfig> AnimationsConfigs;                                 // 0x8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x38 (0x40 - 0x8)
// ScriptStruct LOTF2.CharactersBodyConfig
struct FCharactersBodyConfig : public FTableRowBase
{
public:
	TSubclassOf<class ALOTF2Character>           CharacterBlueprintData;                            // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class ALOTF2Character>         CharacterBlueprint;                                // 0x10(0x30)(Deprecated, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct LOTF2.InheritedGameplayEffectsWithParams
struct FInheritedGameplayEffectsWithParams
{
public:
	struct FGameplayEffectsWithParamsContainer   Combined;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NativeAccessSpecifierPublic)
	struct FGameplayEffectsWithParamsContainer   Added;                                             // 0x10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.InheritedGameplayAbilitiesArray
struct FInheritedGameplayAbilitiesArray
{
public:
	TArray<TSubclassOf<class UGameplayAbility>>  CombinedWithParent;                                // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayAbility>>  AddedThisClass;                                    // 0x10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UGameplayAbility>> Combined;                                          // 0x20(0x10)(ZeroConstructor, Transient, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UGameplayAbility>> Added;                                             // 0x30(0x10)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE8 - 0x8)
// ScriptStruct LOTF2.CharacterGameplayAbilitiesConfig
struct FCharacterGameplayAbilitiesConfig : public FTableRowBase
{
public:
	struct FInheritedGameplayEffectsWithParams   InheritedGameplayEffects;                          // 0x8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FInheritedGameplayAbilitiesArray      InheritedGameplayAbilities;                        // 0x28(0x40)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FInheritedTagContainer                InheritedCharacterTags;                            // 0x68(0x60)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TArray<struct FHexBattleEffectIdentifier>    BattleEffects;                                     // 0xC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAutonomousAreaSpawnDef>       AutonomousAreaSpawnDefs;                           // 0xD8(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// 0x5F8 (0x600 - 0x8)
// ScriptStruct LOTF2.WeaponStance
struct FWeaponStance : public FTableRowBase
{
public:
	struct FDataTableRowHandle                   MovementMoveset;                                   // 0x8(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterAnimationsConfig            GeneralMoveset;                                    // 0x18(0x5D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UDataTable*                            AttackMoveset;                                     // 0x5E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            AttackDefinitions;                                 // 0x5F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            HitboxesDefinition;                                // 0x5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x200 (0x208 - 0x8)
// ScriptStruct LOTF2.WeaponData
struct FWeaponData : public FTableRowBase
{
public:
	uint8                                        Pad_324A[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BaseStaminaCost;                                   // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackRepelAmount;                                 // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardAngle;                                        // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Stability;                                         // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardRepelAmount;                                  // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GuardRepelMultiplierOnParryAmount;                 // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScalingStrength;                                   // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScalingAgility;                                    // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScalingFaith;                                      // 0x78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RequirementStrenth;                                // 0x7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RequirementAgility;                                // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RequirementFaith;                                  // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Weight;                                            // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_324B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AWeaponActor>            WeaponActor;                                       // 0x90(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class EStanceType, struct FWeaponStance> Stances;                                           // 0xC0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UDataTable*                            VFXData;                                           // 0x110(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterGameplayAbilitiesConfig     GameplayAbilitiesConfig;                           // 0x118(0xE8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EWeaponCategory                   WeaponCategory;                                    // 0x200(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_324C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x8 - 0x8)
// ScriptStruct LOTF2.ArmorData
struct FArmorData : public FTableRowBase
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct LOTF2.AccessoryData
struct FAccessoryData : public FTableRowBase
{
public:
};

// 0x0 (0x8 - 0x8)
// ScriptStruct LOTF2.ConsumableItemData
struct FConsumableItemData : public FTableRowBase
{
public:
};

// 0xD8 (0xE0 - 0x8)
// ScriptStruct LOTF2.CharacterDefinition
struct FCharacterDefinition : public FTableRowBase
{
public:
	TSoftObjectPtr<class UCharacterData>         RedirectCharacterData;                             // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UCharacterData>          RedirectCharacterDataClass;                        // 0x38(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   Stats;                                             // 0x68(0x10)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   BodyConfiguration;                                 // 0x78(0x10)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   AnimationsConfiguration;                           // 0x88(0x10)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bIsAICharacter;                                    // 0x98(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_324D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   AIConfiguration;                                   // 0xA0(0x10)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bHasEquipment;                                     // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_324E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   EquipmentConfig;                                   // 0xB8(0x10)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   GameplayAbilitiesConfig;                           // 0xC8(0x10)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	enum class EAIFactionTeams                   Faction;                                           // 0xD8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_324F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.BloodDataFX
struct FBloodDataFX
{
public:
	class UNiagaraSystem*                        BloodVisual;                                       // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                        NiagaraDecalGenerator;                             // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.CustomizationCamera
struct FCustomizationCamera
{
public:
	enum class EBodyShapeCamera                  CameraType;                                        // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3250[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ACameraActor*                          Camera;                                            // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct LOTF2.PoiseReactionLevelSetting
struct FPoiseReactionLevelSetting
{
public:
	int32                                        PoiseReactionLevel;                                // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3251[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  PoiseReactions;                                    // 0x8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct LOTF2.ExtraStaggerByHealthDamageConfig
struct FExtraStaggerByHealthDamageConfig
{
public:
	struct FGameplayAttribute                    ExtraDamageMultiplierAttribute;                    // 0x0(0x38)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.HexStatusEffectBattleEffectsArray
struct FHexStatusEffectBattleEffectsArray
{
public:
	TArray<struct FHexBattleEffectIdentifier>    BattleEffects;                                     // 0x0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct LOTF2.HexStatusEffectBattleEffectsByAttribute
struct FHexStatusEffectBattleEffectsByAttribute
{
public:
	TMap<struct FGameplayAttribute, struct FHexStatusEffectBattleEffectsArray> EffectClasses;                                     // 0x0(0x50)(Edit, NativeAccessSpecifierPublic)
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct LOTF2.HexAIDamageAggroSettings
struct FHexAIDamageAggroSettings
{
public:
	float                                        MinAggroIncreaseDamage;                            // 0x0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAggroIncreaseDamage;                            // 0x4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasMaxAggroIncreaseDamage;                        // 0x8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3252[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DamageAggroDecayStartDelay;                        // 0xC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                    DamageAggroDecayCurve;                             // 0x10(0x88)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AggroDamageType;                                   // 0x98(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.HexAITargetAggroSettings
struct FHexAITargetAggroSettings
{
public:
	float                                        NewTargetAggroBonusScore;                          // 0x0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DecayRateForNewTargetAggroBonusScore;              // 0x4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PreviousTargetAggroDetrimentScore;                 // 0x8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DecayRateForPreviousTargetAggroDetrimentScore;     // 0xC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x60 - 0x8)
// ScriptStruct LOTF2.ComboAnimData
struct FComboAnimData : public FTableRowBase
{
public:
	TSoftObjectPtr<class UAnimationAsset>        Anim;                                              // 0x8(0x30)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AttackTypeTag;                                     // 0x38(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PlaybackRate;                                      // 0x40(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlendInTime;                                       // 0x44(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlendOutTime;                                      // 0x48(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3253[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          AllowedNotifyGroups;                               // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.LOTF2Input
struct FLOTF2Input
{
public:
	class FString                                ActionName;                                        // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                  Key;                                               // 0x10(0x18)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                KeyAsString;                                       // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShift : 1;                                        // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCtrl : 1;                                         // Mask: 0x2, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlt : 1;                                          // Mask: 0x4, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCmd : 1;                                          // Mask: 0x8, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3254[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.LOTF2InputAxis
struct FLOTF2InputAxis
{
public:
	class FString                                AxisName;                                          // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                KeyAsString;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                  Key;                                               // 0x20(0x18)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Scale;                                             // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3255[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct LOTF2.PlayerPresetData
struct FPlayerPresetData
{
public:
	class ALOTF2Character*                       PresetCharacter;                                   // 0x0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEquipmentManagerComponent*            EquipmentManagerComponent;                         // 0x8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMutableWrapperComponent*              MutableWrapperComponent;                           // 0x10(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASpotLight*>                    SelectionLights;                                   // 0x18(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UEquipableInventoryWeapon*>     WeaponsEquipment;                                  // 0x28(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UCustomizationSettings*                CustomizationSettings;                             // 0x38(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct LOTF2.MorphTargetFeature
struct FMorphTargetFeature
{
public:
	class FString                                MutableName;                                       // 0x0(0x10)(Edit, ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        bValue;                                            // 0x10(0x4)(Edit, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3256[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.MorphTargetFeatureArray
struct FMorphTargetFeatureArray
{
public:
	TArray<struct FMorphTargetFeature>           MorphFeature;                                      // 0x0(0x10)(Edit, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.CustomizationHeadArray
struct FCustomizationHeadArray
{
public:
	TArray<class FString>                        HeadArray;                                         // 0x0(0x10)(Edit, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// ScriptStruct LOTF2.DamageDealerInitialParams
struct FDamageDealerInitialParams
{
public:
	uint8                                        Pad_3257[0x88];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x110 (0x110 - 0x0)
// ScriptStruct LOTF2.HitBoxRuntimeData
struct FHitBoxRuntimeData
{
public:
	uint8                                        Pad_3258[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       ComponentToAttach;                                 // 0x70(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               SourceObject;                                      // 0x78(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3259[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayEffectsWithParamsContainer   GameplayEffectsWithParamsContainer;                // 0xD0(0x10)(NativeAccessSpecifierPublic)
	uint8                                        Pad_325A[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x220 (0x220 - 0x0)
// ScriptStruct LOTF2.TemporalHitboxPair
struct FTemporalHitboxPair
{
public:
	struct FHitBoxRuntimeData                    CurrentHitbox;                                     // 0x0(0x110)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FHitBoxRuntimeData                    PreviousHitbox;                                    // 0x110(0x110)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct LOTF2.TemporalHitboxArray
struct FTemporalHitboxArray
{
public:
	TArray<struct FTemporalHitboxPair>           HitboxesArray;                                     // 0x0(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct LOTF2.CameraSettingElement
struct FCameraSettingElement
{
public:
	class FString                                StringName;                                        // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BufferName;                                        // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHexCameraSettings*                    CameraSettings;                                    // 0x20(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct LOTF2.EquipmentElement
struct FEquipmentElement
{
public:
	class FString                                StringName;                                        // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BufferName;                                        // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UEquipementData>         EquipmentDataClass;                                // 0x20(0x30)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct LOTF2.ItemElement
struct FItemElement
{
public:
	class FString                                StringName;                                        // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BufferName;                                        // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UItemData>               ItemDataClass;                                     // 0x20(0x30)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct LOTF2.UpgradeMaterialElement
struct FUpgradeMaterialElement
{
public:
	class FString                                StringName;                                        // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                BufferName;                                        // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UUpgradeMaterialItemData> UpgradeMaterialData;                               // 0x20(0x30)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct LOTF2.DialogueAnswerData
struct FDialogueAnswerData
{
public:
	class FText                                  AnswerText;                                        // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EAnswerType                       AnswerType;                                        // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_325B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimationSource                      PlayerAnimation;                                   // 0x1C(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_325C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// ScriptStruct LOTF2.DialogueMessage
struct FDialogueMessage
{
public:
	class FText                                  NPCText;                                           // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAkAnathemaEvent                      DialogueAudio;                                     // 0x18(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bOverrideTimeOut;                                  // 0x68(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_325D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverriddenTimeOut;                                 // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExtraTimeoutAfterAudioEnds;                        // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_325E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OverrideNPCName;                                   // 0x78(0x18)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
};

// 0x168 (0x168 - 0x0)
// ScriptStruct LOTF2.DialogueStepData
struct FDialogueStepData
{
public:
	enum class EDialogueType                     DialogueType;                                      // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_325F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDialogueMessage                      Message;                                           // 0x8(0x90)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FDialogueAnswerData>           Answers;                                           // 0x98(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<enum class EAnswerType>               FinalAnswers;                                      // 0xA8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<enum class EAnswerType, class FName>    Branches;                                          // 0xB8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                  ItemId;                                            // 0x108(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Vigor;                                             // 0x110(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          DialogueAnimation;                                 // 0x114(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3260[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UAnimMontage>           FacialAnimationMontage;                            // 0x120(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          QuestActions;                                      // 0x150(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                          DialogueStepOptionalTag;                           // 0x160(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct LOTF2.NPCDialogue
struct FNPCDialogue : public FTableRowBase
{
public:
	class FText                                  NPCName;                                           // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
