#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x10 - 0x0)
// Function W_HeadShape.W_HeadShape_C.OnShown_533C054F48598C1BC59B4BAC717A5E8C
struct UW_HeadShape_C_OnShown_533C054F48598C1BC59B4BAC717A5E8C_Params
{
public:
	enum class EMessagingResult                  Result;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4035[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHexGameDialog*                        Dialog;                                            // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function W_HeadShape.W_HeadShape_C.OnResultNamed_533C054F48598C1BC59B4BAC717A5E8C
struct UW_HeadShape_C_OnResultNamed_533C054F48598C1BC59B4BAC717A5E8C_Params
{
public:
	enum class EMessagingResult                  Result;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4036[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActionId;                                          // 0x4(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4037[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHexGameDialog*                        Dialog;                                            // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// 0x10 (0x10 - 0x0)
// Function W_HeadShape.W_HeadShape_C.OnResult_533C054F48598C1BC59B4BAC717A5E8C
struct UW_HeadShape_C_OnResult_533C054F48598C1BC59B4BAC717A5E8C_Params
{
public:
	enum class EMessagingResult                  Result;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4038[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHexGameDialog*                        Dialog;                                            // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function W_HeadShape.W_HeadShape_C.BndEvt__W_HeadShape_Top_Head_K2Node_ComponentBoundEvent_3_On Head Selected__DelegateSignature
struct UW_HeadShape_C_BndEvt__W_HeadShape_Top_Head_K2Node_ComponentBoundEvent_3_On_Head_Selected__DelegateSignature_Params
{
public:
	enum class EHeadPresetLocation               Head_Location;                                     // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function W_HeadShape.W_HeadShape_C.BndEvt__W_HeadShape_Left_Head_K2Node_ComponentBoundEvent_0_On Head Selected__DelegateSignature
struct UW_HeadShape_C_BndEvt__W_HeadShape_Left_Head_K2Node_ComponentBoundEvent_0_On_Head_Selected__DelegateSignature_Params
{
public:
	enum class EHeadPresetLocation               Head_Location;                                     // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function W_HeadShape.W_HeadShape_C.BndEvt__W_HeadShape_Right_Head_K2Node_ComponentBoundEvent_1_On Head Selected__DelegateSignature
struct UW_HeadShape_C_BndEvt__W_HeadShape_Right_Head_K2Node_ComponentBoundEvent_1_On_Head_Selected__DelegateSignature_Params
{
public:
	enum class EHeadPresetLocation               Head_Location;                                     // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function W_HeadShape.W_HeadShape_C.PreConstruct
struct UW_HeadShape_C_PreConstruct_Params
{
public:
	bool                                         IsDesignTime;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x85 (0x85 - 0x0)
// Function W_HeadShape.W_HeadShape_C.ExecuteUbergraph_W_HeadShape
struct UW_HeadShape_C_ExecuteUbergraph_W_HeadShape_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EMessagingResult                  K2Node_CustomEvent_Result_2;                       // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4040[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHexGameDialog*                        K2Node_CustomEvent_Dialog_2;                       // 0x8(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x10(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EMessagingResult                  K2Node_CustomEvent_Result_1;                       // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4041[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  K2Node_CustomEvent_ActionId;                       // 0x24(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4042[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHexGameDialog*                        K2Node_CustomEvent_Dialog_1;                       // 0x30(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_1;            // 0x38(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class EMessagingResult                  K2Node_CustomEvent_Result;                         // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4043[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHexGameDialog*                        K2Node_CustomEvent_Dialog;                         // 0x50(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_2;            // 0x58(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHexGameDialog*                        Temp_object_Variable;                              // 0x68(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	enum class EMessagingResult                  Temp_byte_Variable;                                // 0x70(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x71(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4044[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAsyncAction_ShowConfirmationDialog*   CallFunc_ShowConfirmationOkCancel_ReturnValue;     // 0x78(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x80(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EHeadPresetLocation               K2Node_ComponentBoundEvent_Head_Location_2;        // 0x81(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EHeadPresetLocation               K2Node_ComponentBoundEvent_Head_Location_1;        // 0x82(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EHeadPresetLocation               K2Node_ComponentBoundEvent_Head_Location;          // 0x83(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_IsDesignTime;                         // 0x84(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


