#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xD9 (0x641 - 0x568)
// BlueprintGeneratedClass WitherEntitySpawner_BP.WitherEntitySpawner_BP_C
class AWitherEntitySpawner_BP_C : public ABP_StatueSpawner_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x568(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                         MirageRandomRevealCollision;                       // 0x570(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                     EQScheckCapsule;                                   // 0x578(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                         MaxRevealCollision;                                // 0x580(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                         MirageUnspawnCollision;                            // 0x588(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                         MinRevealCollision;                                // 0x590(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                  WaitFirstEncounterTriggerBox;                      // 0x598(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_CurveValue_B2C4E067405CC6D0950475A114E14F9F; // 0x5A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline__Direction_B2C4E067405CC6D0950475A114E14F9F; // 0x5A4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D47[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline;                                          // 0x5A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                        FadeInCurveTimeline_DissolveNiagara_91A8AB7A4FFACCAF01A36D8788F8FD2D; // 0x5B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FadeInCurveTimeline_Opacity_91A8AB7A4FFACCAF01A36D8788F8FD2D; // 0x5B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                FadeInCurveTimeline__Direction_91A8AB7A4FFACCAF01A36D8788F8FD2D; // 0x5B8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D48[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    FadeInCurveTimeline;                               // 0x5C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                        FadeOutCurveTimeline_DissolveNiagara_9AD69B454EC91B4B5080009AF31F5AD8; // 0x5C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FadeOutCurveTimeline_Opacity_9AD69B454EC91B4B5080009AF31F5AD8; // 0x5CC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                FadeOutCurveTimeline__Direction_9AD69B454EC91B4B5080009AF31F5AD8; // 0x5D0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D49[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    FadeOutCurveTimeline;                              // 0x5D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                    MirageMaterial;                                    // 0x5E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       TimeBeforeUnspawnByDistance;                       // 0x5E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bUnspawningEnemy;                                  // 0x5F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                         bSpawnedEnemyIsNearAPlayer;                        // 0x5F1(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                        Pad_3D4A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       CountdownToUnspawn;                                // 0x5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                       FarDistanceThreshold;                              // 0x600(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MinSpawnTime;                                      // 0x608(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MaxSpawnTime;                                      // 0x610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          SpawnTimerHandle;                                  // 0x618(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       SpawnReverseDissolveDuration;                      // 0x620(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsFadingOut;                                       // 0x628(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsUnspawning;                                      // 0x629(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D4B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_UmbrieBase_C*                      Character;                                         // 0x630(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                     SpawnSystem;                                       // 0x638(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         IsWitherInhibited;                                 // 0x640(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AWitherEntitySpawner_BP_C* GetDefaultObj();

	void GetRandomRevealTriggerSize(struct FVector* TriggerBoxExtent, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_1, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_RandomFloatInRange_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue);
	void SetFirstEncounterTriggerEnabled(bool bEnableCollision, bool CallFunc_IsValid_ReturnValue);
	void TriggerFirstEncounter();
	void Setup_First_Encounter_Trigger_Size(const struct FVector& Extents, class UBoxComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	bool IsPlayerNearby(TArray<class AActor*>& CallFunc_GetOverlappingActors_OverlappingActors, bool CallFunc_Array_IsEmpty_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void UserConstructionScript(class UWaitFirstEncounterConfigComp* CallFunc_GetWaitFirstEncounterConfigComponent_ReturnValue, class AWaitFirstEncounterTriggerBox* K2Node_DynamicCast_AsWait_First_Encounter_Trigger_Box, bool K2Node_DynamicCast_bSuccess, TSoftObjectPtr<class AWaitFirstEncounterTriggerBox> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void FadeOutCurveTimeline__FinishedFunc();
	void FadeOutCurveTimeline__UpdateFunc();
	void FadeInCurveTimeline__FinishedFunc();
	void FadeInCurveTimeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void ReceiveBeginPlay();
	void FadeOut_and_AutoDestroy();
	void StatueMeshUpdated(class UStaticMeshComponent* StatueMesh);
	void Unspawn_Enemy_and_AutoDestroy();
	void Fade_In();
	void OnFirstEncounterTriggered(class AActor* TriggerVolumeActor, class AActor* TriggeringActor);
	void OnWitherInhibitChange_Event(bool bInhibit);
	void BndEvt__WitherEntitySpawner_BP_MaxCollider_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void TryReleaseEntity();
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void BndEvt__WitherEntitySpawner_BP_MirageRandomRevealCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnCharacterSpawnedDelegate_Event(class ASimpleCharacterSpawner* Spawner, class ALOTF2Character* Character);
	void OnCharacterDeadDelegate_Event(class ASimpleCharacterSpawner* Spawner, class ALOTF2Character* Character);
	void OnWitherUnspawnVFX(class ALOTF2Character* SpawnedCharacter);
	void ExecuteUbergraph_WitherEntitySpawner_BP(int32 EntryPoint, bool CallFunc_IsSpawningEnabled_ReturnValue, bool CallFunc_IsPlayerNearby_ReturnValue, bool CallFunc_IsPlayerNearby_ReturnValue_1, class ALOTF2Character* CallFunc_GetSpawnedCharacter_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue, class AActor* K2Node_Event_triggerVolumeActor, class AActor* K2Node_Event_triggeringActor, int32 CallFunc_GetNumPlayerStates_ReturnValue, class ALOTF2Character* CallFunc_GetSpawnedCharacter_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, class UStaticMeshComponent* K2Node_Event_StatueMesh, double CallFunc_MakeLiteralDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, bool Temp_bool_Variable, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Square_ReturnValue, bool K2Node_CustomEvent_bInhibit, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OverlappedComponent_1, class AActor* K2Node_ComponentBoundEvent_OtherActor_1, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OtherComp_1, int32 K2Node_ComponentBoundEvent_OtherBodyIndex_1, bool CallFunc_HasAuthority_ReturnValue_1, double CallFunc_RandomFloatInRange_ReturnValue, enum class EEndPlayReason K2Node_Event_EndPlayReason, bool CallFunc_WasRecentlyRendered_ReturnValue, bool CallFunc_HasAuthority_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue_3, int32 CallFunc_GetNumMaterials_ReturnValue, class ALOTF2Character* CallFunc_GetSpawnedCharacter_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_2, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, class UDissolveFXComponent_C* CallFunc_GetComponentByClass_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_5, float CallFunc_BreakVector3f_X, float CallFunc_BreakVector3f_Y, float CallFunc_BreakVector3f_Z, double CallFunc_Add_DoubleDouble_ReturnValue, bool CallFunc_HasAuthority_ReturnValue_4, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue_1, const struct FVector& CallFunc_BreakTransform_Location_1, const struct FRotator& CallFunc_BreakTransform_Rotation_1, const struct FVector& CallFunc_BreakTransform_Scale_1, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue_1, float CallFunc_BreakVector3f_X_1, float CallFunc_BreakVector3f_Y_1, float CallFunc_BreakVector3f_Z_1, bool CallFunc_IsValid_ReturnValue_6, double CallFunc_Add_DoubleDouble_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue_1, bool CallFunc_HasAuthority_ReturnValue_5, const struct FVector& CallFunc_GetRandomRevealTriggerSize_TriggerBoxExtent, const struct FVector& CallFunc_GetRandomRevealTriggerSize_TriggerBoxExtent_1, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OverlappedComponent, class AActor* K2Node_ComponentBoundEvent_OtherActor, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OtherComp, int32 K2Node_ComponentBoundEvent_OtherBodyIndex, bool K2Node_ComponentBoundEvent_bFromSweep, const struct FHitResult& K2Node_ComponentBoundEvent_SweepResult, class AAnathemaPlayerCharacter_BP_C* K2Node_DynamicCast_AsAnathema_Player_Character_BP, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Variable, class APlayerState* CallFunc_GetPlayerState_ReturnValue, class APawn* CallFunc_GetPawn_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, float CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, int32 Temp_int_Array_Index_Variable, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, const struct FVector4& CallFunc_MakeVector4_ReturnValue, bool CallFunc_IsSpawningEnabled_ReturnValue_1, bool CallFunc_IsSpawningEnabled_ReturnValue_2, bool CallFunc_IsSpawningEnabled_ReturnValue_3, bool CallFunc_IsCharacterDead_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_IsSpawningEnabled_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsSpawningEnabled_ReturnValue_5, class ASimpleCharacterSpawner* K2Node_Event_spawner_1, class ALOTF2Character* K2Node_Event_character_1, bool CallFunc_Not_PreBool_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue, class ASimpleCharacterSpawner* K2Node_Event_spawner, class ALOTF2Character* K2Node_Event_character, enum class ESpawnerSpawningState CallFunc_GetSpawnerSpawningState_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, float CallFunc_GetPlaybackPosition_ReturnValue, float CallFunc_GetTimelineLength_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_4, double CallFunc_Multiply_DoubleDouble_ReturnValue_5, const struct FVector4& CallFunc_MakeVector4_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, float CallFunc_GetTimelineLength_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float CallFunc_GetTimelineLength_ReturnValue_2, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_1, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, class ALOTF2Character* K2Node_CustomEvent_SpawnedCharacter, class ABP_UmbrieBase_C* K2Node_DynamicCast_AsBP_Umbrie_Base, bool K2Node_DynamicCast_bSuccess_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, double CallFunc_Add_DoubleDouble_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue_2, class UWitherSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue, bool CallFunc_IsValid_ReturnValue_7, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, int32 CallFunc_PostEventAtLocation_ReturnValue, int32 Temp_int_Variable_1, bool CallFunc_LessEqual_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_K2_SetTimerDelegate_InitialStartDelay_ImplicitCast, const struct FVector3f& CallFunc_BreakVector3f_InVec_ImplicitCast, double CallFunc_MakeVector_X_ImplicitCast, double CallFunc_MakeVector_Y_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, const struct FVector3f& CallFunc_BreakVector3f_InVec_ImplicitCast_1, double CallFunc_MakeVector_X_ImplicitCast_1, double CallFunc_MakeVector_Y_ImplicitCast_1, double CallFunc_Add_DoubleDouble_A_ImplicitCast_1, double CallFunc_LessEqual_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, float CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1, float CallFunc_SetVariableFloat_InValue_ImplicitCast, double CallFunc_Divide_DoubleDouble_A_ImplicitCast, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1, float CallFunc_SetVariableFloat_InValue_ImplicitCast_1, double CallFunc_Divide_DoubleDouble_A_ImplicitCast_1, double CallFunc_Divide_DoubleDouble_B_ImplicitCast, float K2Node_Timeline_NewTime_ImplicitCast, float CallFunc_SetNewTime_NewTime_ImplicitCast);
};

}


