#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x50 (0x5B0 - 0x560)
// ControlRigBlueprintGeneratedClass CR_Facial_Tier2.CR_Facial_Tier2_C
class UCR_Facial_Tier2_C : public UControlRig
{
public:
	int32                                        Expression_Index;                                  // 0x560(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  Expression_Name;                                   // 0x564(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4227[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Anger;                                             // 0x570(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Pain;                                              // 0x578(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       blinkTriggerEvent;                                 // 0x580(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       JawUpper_coef;                                     // 0x588(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       brow_dist;                                         // 0x590(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Nose_dist;                                         // 0x598(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Cheek_dist;                                        // 0x5A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       GetAngleMid;                                       // 0x5A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCR_Facial_Tier2_C* GetDefaultObj();

};

// 0x848 (0x870 - 0x28)
// RigVMMemoryStorageGeneratorClass CR_Facial_Tier2.RigVMMemory_Literal
class URigVMMemory_Literal_CRF2 : public URigVMMemoryStorage
{
public:
	class FString                                RigVMModel___SetControlVisibility_Pattern__Const;  // 0x28(0x10)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	uint8                                        RigVMModel___SetControlVisibility_bVisible__Const : 1; // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_287 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4228[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RigVMModel___CollectionNameSearchArray_3_PartialName__Const; // 0x3C(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	enum class ERigElementType                   RigVMModel___CollectionNameSearchArray_3_TypeToSearch__Const; // 0x44(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4229[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___RigUnit_SetTransform_1_1_1_Item__Const; // 0x48(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	enum class EBoneGetterSetterMode             RigVMModel___RigUnit_SetTransform_1_1_1_Space__Const; // 0x54(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___RigUnit_SetTransform_1_1_1_bInitial__Const : 1; // Mask: 0x1, PropSize: 0x10x55(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_288 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_422A[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_1_1_1_Item__Const; // 0x58(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___RigUnit_SetTransform_1_1_1_Weight__Const; // 0x64(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___Set_Transform_3_Item__Const;          // 0x68(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	enum class EBoneGetterSetterMode             RigVMModel___Set_Transform_3_Space__Const;         // 0x74(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_422B[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___Set_Transform_3_Value__Const;         // 0x80(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___Random_1_2_Seed__Const;               // 0xE0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_1_2_Minimum__Const;            // 0xE4(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_2_InitialValue__Const; // 0xE8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_2_Blend__Const;      // 0xEC(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Remap_SourceMinimum__Const;           // 0xF0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Remap_SourceMaximum__Const;           // 0xF8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Remap_TargetMaximum__Const;           // 0x100(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___ParentConstraint_1_1_1_1_Child__Const; // 0x108(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                      RigVMModel___ParentConstraint_1_1_1_1_Filter__Const; // 0x114(0x9)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                        Pad_422C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_1_1_1_1_Parents__Const; // 0x120(0x10)(Edit, EditConst, NonTransactional)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_1_1_1_1_AdvancedSettings__Const; // 0x130(0x2)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                        Pad_422D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ParentConstraint_1_1_1_2_Child__Const; // 0x134(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_1_1_1_2_Parents__Const; // 0x140(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_Parents__Const;      // 0x150(0x10)(Edit, EditConst, NonTransactional)
	class FName                                  RigVMModel___CollectionNameSearchArray_PartialName__Const; // 0x160(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_1_Parents__Const;    // 0x168(0x10)(Edit, EditConst, NonTransactional)
	class FName                                  RigVMModel___CollectionNameSearchArray_1_PartialName__Const; // 0x178(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___CollectionNameSearchArray_1_1_PartialName__Const; // 0x180(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_1_1_Parents__Const;  // 0x188(0x10)(Edit, EditConst, NonTransactional)
	struct FFilterOptionPerAxis                  RigVMModel___AimConstraintLocalSpaceOffset_1_1_Filter__Const; // 0x198(0x3)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                        Pad_422E[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RigVMModel___AimConstraintLocalSpaceOffset_1_1_AimAxis__Const; // 0x1A0(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                               RigVMModel___AimConstraintLocalSpaceOffset_1_1_UpAxis__Const; // 0x1B8(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimConstraint_WorldUp        RigVMModel___AimConstraintLocalSpaceOffset_1_1_WorldUp__Const; // 0x1D0(0x28)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FConstraintParent>             RigVMModel___AimConstraintLocalSpaceOffset_1_1_Parents__Const; // 0x1F8(0x10)(Edit, EditConst, NonTransactional)
	uint8                                        Pad_422F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigUnit_AimConstraint_AdvancedSettings RigVMModel___AimConstraintLocalSpaceOffset_1_1_AdvancedSettings__Const; // 0x210(0x80)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_1_2_Parents__Const;  // 0x290(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FConstraintParent>             RigVMModel___AimConstraintLocalSpaceOffset_1_Parents__Const; // 0x2A0(0x10)(Edit, EditConst, NonTransactional)
	class FName                                  RigVMModel___CollectionNameSearchArray_1_2_PartialName__Const; // 0x2B0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___CollectionNameSearchArray_1_1_1_PartialName__Const; // 0x2B8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_1_1_1_Parents__Const; // 0x2C0(0x10)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                        RigVMModel___ParentConstraint_2_Child__Const;      // 0x2D0(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_1_Old__Const;                 // 0x2DC(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_1_New__Const;                 // 0x2E4(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                      RigVMModel___ParentConstraint_2_Filter__Const;     // 0x2EC(0x9)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                        Pad_4230[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_2_Parents__Const;    // 0x2F8(0x10)(Edit, EditConst, NonTransactional)
	class FName                                  RigVMModel___CollectionNameSearchArray_2_1_PartialName__Const; // 0x308(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_Set_Transform_2_Item__Const; // 0x310(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_RigUnit_GetTransform_1_1_Item__Const; // 0x31C(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                    RigVMModel___AnimEvalRichCurve_Curve__Const;       // 0x328(0x88)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Multiply_5_1_B__Const;                // 0x3B0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_Remap_1_SourceMaximum__Const; // 0x3B8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_Remap_1_TargetMaximum__Const; // 0x3C0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_Remap_1_1_TargetMaximum__Const; // 0x3C8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_1_Set_Transform_2_Item__Const; // 0x3D0(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_1_1_Item__Const; // 0x3DC(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_2_Set_Transform_2_Item__Const; // 0x3E8(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_1_1_Item__Const; // 0x3F4(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_3_Set_Transform_2_Item__Const; // 0x400(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_1_1_Item__Const; // 0x40C(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_1_1_Set_Transform_2_Item__Const; // 0x418(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_1_1_Item__Const; // 0x424(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_2_1_Set_Transform_2_Item__Const; // 0x430(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_1_1_Item__Const; // 0x43C(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_2_1_AdvancedSettings__Const; // 0x448(0x2)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                        Pad_4231[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RigVMModel___CollectionNameSearchArray_4_PartialName__Const; // 0x44C(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4232[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_2_1_1_Parents__Const; // 0x458(0x10)(Edit, EditConst, NonTransactional)
	class FName                                  RigVMModel___CollectionNameSearchArray_2_1_1_1_PartialName__Const; // 0x468(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	enum class ERigElementType                   RigVMModel___CollectionNameSearchArray_2_1_1_1_TypeToSearch__Const; // 0x470(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4233[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_2_1_1_1_Parents__Const; // 0x478(0x10)(Edit, EditConst, NonTransactional)
	class FName                                  RigVMModel___CollectionNameSearchArray_2_1_1_1_1_PartialName__Const; // 0x488(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___ParentConstraint_2_1_1_1_1_Child__Const; // 0x490(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4234[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_2_1_1_1_1_Parents__Const; // 0x4A0(0x10)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                        RigVMModel___ParentConstraint_2_1_1_1_2_Child__Const; // 0x4B0(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___ParentConstraint_2_1_1_1_1_1_Child__Const; // 0x4BC(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_2_1_1_1_1_1_Parents__Const; // 0x4C8(0x10)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                        RigVMModel___ParentConstraint_2_1_1_1_2_1_Child__Const; // 0x4D8(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTransform_6_Item__Const;   // 0x4E4(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___RigUnit_SetTransform_6_Value__Const;  // 0x4F0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_3_B__Const;                  // 0x550(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___Random_1_1_Seed__Const;               // 0x558(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_1_1_Minimum__Const;            // 0x55C(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_1_1_Maximum__Const;            // 0x560(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_1_1_Duration__Const;           // 0x564(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTransform_3_Item__Const;   // 0x568(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4235[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_SetTransform_3_Value__Const;  // 0x580(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___Random_Seed__Const;                   // 0x5E0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_Minimum__Const;                // 0x5E4(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTransform_3_1_Item__Const; // 0x5E8(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4236[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_SetTransform_3_1_Value__Const; // 0x600(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTransform_6_1_Item__Const; // 0x660(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4237[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RigVMModel___Multiply_3_1_B__Const;                // 0x670(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_SetTransform_Item__Const;     // 0x678(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_7_Item__Const;   // 0x684(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___Set_Transform_Item__Const;            // 0x690(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_2_Item__Const;   // 0x69C(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_3_Item__Const;   // 0x6A8(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_T__Const;                 // 0x6B4(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___Set_Transform_1_Item__Const;          // 0x6B8(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_4_Item__Const;   // 0x6C4(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_4_1_Item__Const; // 0x6D0(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___GetTransform_1_Item__Const;           // 0x6DC(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target               RigVMModel___AimBoneMath_Primary__Const;           // 0x6E8(0x48)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target               RigVMModel___AimBoneMath_Secondary__Const;         // 0x730(0x48)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                        Pad_4238[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigUnit_AimBone_DebugSettings        RigVMModel___AimBoneMath_DebugSettings__Const;     // 0x780(0x70)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FRigElementKey>                RigVMModel___ArrayIterator_3_Array__Const;         // 0x7F0(0x10)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                        RigVMModel___GetTransform_1_1_Item__Const;         // 0x800(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4239[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRigElementKey>                RigVMModel___ArrayIterator_3_1_Array__Const;       // 0x810(0x10)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Multiply_1_B__Const;                  // 0x820(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                               RigVMModel___MathVectorDistance_1_1_A__Const;      // 0x828(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_6_1_1_Item__Const; // 0x840(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___RigUnit_GetTransform_5_1_1_1_Item__Const; // 0x84C(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___GetTransform_6_2_Item__Const;         // 0x858(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___GetTransform_6_Item__Const;           // 0x864(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal_CRF2* GetDefaultObj();

};

// 0x3648 (0x3670 - 0x28)
// RigVMMemoryStorageGeneratorClass CR_Facial_Tier2.RigVMMemory_Work
class URigVMMemory_Work_CRF2 : public URigVMMemoryStorage
{
public:
	struct FControlRigExecuteContext             ExecuteContext_;                                   // 0x28(0x38)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                        RigVMModel___ArrayIterator_5_Element;              // 0x60(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_423A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___SetControlVisibility_CachedControlIndices; // 0x70(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_3_Items;    // 0x80(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_5_Index;                // 0x90(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_5_Count;                // 0x94(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_5_Ratio;                // 0x98(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_5_Continue : 1;         // Mask: 0x1, PropSize: 0x10x9C(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_289 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_423B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_GetTransform_1_1_1_Transform; // 0xA0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_1_1_1_CachedIndex; // 0x100(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_1_1_1_CachedIndex; // 0x110(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___Interpolate_3_Result;                 // 0x120(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___GetTransform_3_Transform;             // 0x140(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_3_CachedIndex;           // 0x1A0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___Interpolate_3_A;                      // 0x1B0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___Inverse_Result;                       // 0x1D0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Remap_Result;                         // 0x1F0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_2_Result;            // 0x1F8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_423C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RigVMModel___Multiply_4_1_2_Result;                // 0x200(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_1_2_Result;                    // 0x208(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_423D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                RigVMModel___Random_1_2_LastResult;                // 0x210(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_1_2_LastSeed;                  // 0x220(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_1_2_BaseSeed;                  // 0x230(0x10)(Edit, EditConst, NonTransactional)
	TArray<float>                                RigVMModel___Random_1_2_TimeLeft;                  // 0x240(0x10)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Multiply_4_1_2_B;                     // 0x250(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_2_TargetValue;       // 0x258(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_423E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                RigVMModel___AccumulateLerp_1_2_AccumulatedValue;  // 0x260(0x10)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Remap_Value;                          // 0x270(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_3_T;                      // 0x278(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_423F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___Set_Transform_3_Value__IO;            // 0x280(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_3_CachedIndex;          // 0x2E0(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_1_1_1_1_ChildCache;  // 0x2F0(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_1_1_1_1_ParentCaches; // 0x300(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_1_1_1_2_ChildCache;  // 0x310(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_1_1_1_2_ParentCaches; // 0x320(0x10)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                        RigVMModel___ArrayIterator_Element;                // 0x330(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4240[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_ChildCache;          // 0x340(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_ParentCaches;        // 0x350(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_Items;      // 0x360(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_Index;                  // 0x370(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_Count;                  // 0x374(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_Ratio;                  // 0x378(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_Continue : 1;           // Mask: 0x1, PropSize: 0x10x37C(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_28A : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4241[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ArrayIterator_1_Element;              // 0x380(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4242[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_1_ChildCache;        // 0x390(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_1_ParentCaches;      // 0x3A0(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_1_Items;    // 0x3B0(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_1_Index;                // 0x3C0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_1_Count;                // 0x3C4(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_1_Ratio;                // 0x3C8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_1_Continue : 1;         // Mask: 0x1, PropSize: 0x10x3CC(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_28B : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4243[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_1_1_Items;  // 0x3D0(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayFind_Index;                      // 0x3E0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayFind_Success : 1;                // Mask: 0x1, PropSize: 0x10x3E4(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_28C : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4244[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ArrayIterator_1_1_Element;            // 0x3E8(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4245[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_1_1_ChildCache;      // 0x3F8(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_1_1_ParentCaches;    // 0x408(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___AimConstraintLocalSpaceOffset_1_1_WorldUpSpaceCache; // 0x418(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___AimConstraintLocalSpaceOffset_1_1_ChildCache; // 0x428(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___AimConstraintLocalSpaceOffset_1_1_ParentCaches; // 0x438(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_1_1_Index;              // 0x448(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_1_1_Count;              // 0x44C(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_1_1_Ratio;              // 0x450(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_1_1_Continue : 1;       // Mask: 0x1, PropSize: 0x10x454(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_28D : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4246[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ArrayIterator_1_2_Element;            // 0x458(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4247[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_1_2_ChildCache;      // 0x468(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_1_2_ParentCaches;    // 0x478(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___AimConstraintLocalSpaceOffset_1_WorldUpSpaceCache; // 0x488(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___AimConstraintLocalSpaceOffset_1_ChildCache; // 0x498(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___AimConstraintLocalSpaceOffset_1_ParentCaches; // 0x4A8(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_1_2_Items;  // 0x4B8(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_1_2_Index;              // 0x4C8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_1_2_Count;              // 0x4CC(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_1_2_Ratio;              // 0x4D0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_1_2_Continue : 1;       // Mask: 0x1, PropSize: 0x10x4D4(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_28E : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4248[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_1_1_1_Items; // 0x4D8(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayFind_1_Index;                    // 0x4E8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayFind_1_Success : 1;              // Mask: 0x1, PropSize: 0x10x4EC(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_28F : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4249[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ArrayIterator_1_1_1_Element;          // 0x4F0(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_424A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_1_1_1_ChildCache;    // 0x500(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_1_1_1_ParentCaches;  // 0x510(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___AimConstraintLocalSpaceOffset_WorldUpSpaceCache; // 0x520(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___AimConstraintLocalSpaceOffset_ChildCache; // 0x530(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___AimConstraintLocalSpaceOffset_ParentCaches; // 0x540(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_1_1_1_Index;            // 0x550(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_1_1_1_Count;            // 0x554(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_1_1_1_Ratio;            // 0x558(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_1_1_1_Continue : 1;     // Mask: 0x1, PropSize: 0x10x55C(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_290 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_424B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RigVMModel___Replace_1_Result;                     // 0x560(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___ArrayIterator_2_1_Element;            // 0x568(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_1_Name;                       // 0x574(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___ParentConstraint_2_Child__IO;         // 0x57C(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_2_Parents__IO;       // 0x588(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_2_ChildCache;        // 0x598(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_2_ParentCaches;      // 0x5A8(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_2_1_Items;  // 0x5B8(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_2_1_Index;              // 0x5C8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_2_1_Count;              // 0x5CC(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_2_1_Ratio;              // 0x5D0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_2_1_Continue : 1;       // Mask: 0x1, PropSize: 0x10x5D4(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_291 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_424C[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 RigVMModel___BlinkInterpolate_Multiply_2_Result;   // 0x5E0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Multiply_Result;     // 0x600(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Interpolate_1_Result; // 0x620(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_RigUnit_GetTransform_4_Transform; // 0x640(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_RigUnit_GetTransform_4_CachedIndex; // 0x6A0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Interpolate_1_A;     // 0x6B0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_RigUnit_GetTransform_1_1_Transform; // 0x6D0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_RigUnit_GetTransform_1_1_CachedIndex; // 0x730(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Interpolate_1_B;     // 0x740(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_Remap_1_Result;      // 0x760(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Clamp_1_Result;                       // 0x768(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_2_Result;                         // 0x770(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AnimEvalRichCurve_Result;             // 0x778(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AnimEvalRichCurve_Value;              // 0x77C(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_2_A;                              // 0x780(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_5_1_Result;                  // 0x788(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_Interpolate_1_T;     // 0x790(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_424D[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___BlinkInterpolate_RigUnit_GetTransform_1_1_1_Transform; // 0x7A0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_RigUnit_GetTransform_1_1_1_CachedIndex; // 0x800(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Multiply_B;          // 0x810(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Inverse_Result;      // 0x830(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_RigUnit_GetTransform_1_1_1_1_Transform; // 0x850(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0x8B0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Inverse_Value;       // 0x8C0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_Set_Transform_2_CachedIndex; // 0x8E0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Multiply_1_1_Result; // 0x8F0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Multiply_1_Result;   // 0x910(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_Interpolate_1_1_Result; // 0x930(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_Remap_1_1_Result;    // 0x950(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_Interpolate_1_1_T;   // 0x958(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_424E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_Set_Transform_1_2_CachedIndex; // 0x960(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Multiply_2_Result; // 0x970(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Multiply_Result;   // 0x990(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Interpolate_1_Result; // 0x9B0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_4_Transform; // 0x9D0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_4_CachedIndex; // 0xA30(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Interpolate_1_A;   // 0xA40(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_1_1_Transform; // 0xA60(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_1_1_CachedIndex; // 0xAC0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Interpolate_1_B;   // 0xAD0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_1_Remap_1_Result;    // 0xAF0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_1_Interpolate_1_T;   // 0xAF8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_424F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_1_1_1_Transform; // 0xB00(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_1_1_1_CachedIndex; // 0xB60(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Multiply_B;        // 0xB70(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Inverse_Result;    // 0xB90(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_1_1_1_1_Transform; // 0xBB0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0xC10(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Inverse_Value;     // 0xC20(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_Set_Transform_2_CachedIndex; // 0xC40(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Multiply_1_1_Result; // 0xC50(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Multiply_1_Result; // 0xC70(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_Interpolate_1_1_Result; // 0xC90(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_1_Remap_1_1_Result;  // 0xCB0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_1_Interpolate_1_1_T; // 0xCB8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4250[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_Set_Transform_1_2_CachedIndex; // 0xCC0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Multiply_2_Result; // 0xCD0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Multiply_Result;   // 0xCF0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Interpolate_1_Result; // 0xD10(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_4_Transform; // 0xD30(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_4_CachedIndex; // 0xD90(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Interpolate_1_A;   // 0xDA0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_1_1_Transform; // 0xDC0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_1_1_CachedIndex; // 0xE20(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Interpolate_1_B;   // 0xE30(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_2_Remap_1_Result;    // 0xE50(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_2_Interpolate_1_T;   // 0xE58(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4251[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_1_1_1_Transform; // 0xE60(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_1_1_1_CachedIndex; // 0xEC0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Multiply_B;        // 0xED0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Inverse_Result;    // 0xEF0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_1_1_1_1_Transform; // 0xF10(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0xF70(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Inverse_Value;     // 0xF80(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_Set_Transform_2_CachedIndex; // 0xFA0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Multiply_1_1_Result; // 0xFB0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Multiply_1_Result; // 0xFD0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_Interpolate_1_1_Result; // 0xFF0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_2_Remap_1_1_Result;  // 0x1010(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_2_Interpolate_1_1_T; // 0x1018(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4252[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_Set_Transform_1_2_CachedIndex; // 0x1020(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Multiply_2_Result; // 0x1030(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Multiply_Result;   // 0x1050(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Interpolate_1_Result; // 0x1070(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_4_Transform; // 0x1090(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_4_CachedIndex; // 0x10F0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Interpolate_1_A;   // 0x1100(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_1_1_Transform; // 0x1120(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_1_1_CachedIndex; // 0x1180(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Interpolate_1_B;   // 0x1190(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_3_Remap_1_Result;    // 0x11B0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_3_Interpolate_1_T;   // 0x11B8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4253[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_1_1_1_Transform; // 0x11C0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_1_1_1_CachedIndex; // 0x1220(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Multiply_B;        // 0x1230(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Inverse_Result;    // 0x1250(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_1_1_1_1_Transform; // 0x1270(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_3_RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0x12D0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Inverse_Value;     // 0x12E0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_3_Set_Transform_2_CachedIndex; // 0x1300(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Multiply_1_1_Result; // 0x1310(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Multiply_1_Result; // 0x1330(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_3_Interpolate_1_1_Result; // 0x1350(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_3_Remap_1_1_Result;  // 0x1370(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_3_Interpolate_1_1_T; // 0x1378(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4254[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_3_Set_Transform_1_2_CachedIndex; // 0x1380(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Multiply_2_Result; // 0x1390(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Multiply_Result; // 0x13B0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Interpolate_1_Result; // 0x13D0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_4_Transform; // 0x13F0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_4_CachedIndex; // 0x1450(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Interpolate_1_A; // 0x1460(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_1_1_Transform; // 0x1480(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_1_1_CachedIndex; // 0x14E0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Interpolate_1_B; // 0x14F0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_1_1_Remap_1_Result;  // 0x1510(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_1_1_Interpolate_1_T; // 0x1518(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4255[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_1_1_1_Transform; // 0x1520(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_1_1_1_CachedIndex; // 0x1580(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Multiply_B;      // 0x1590(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Inverse_Result;  // 0x15B0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_1_1_1_1_Transform; // 0x15D0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_1_RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0x1630(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Inverse_Value;   // 0x1640(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_1_Set_Transform_2_CachedIndex; // 0x1660(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Multiply_1_1_Result; // 0x1670(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Multiply_1_Result; // 0x1690(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_1_1_Interpolate_1_1_Result; // 0x16B0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_1_1_Remap_1_1_Result; // 0x16D0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_1_1_Interpolate_1_1_T; // 0x16D8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4256[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_1_1_Set_Transform_1_2_CachedIndex; // 0x16E0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Multiply_2_Result; // 0x16F0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Multiply_Result; // 0x1710(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Interpolate_1_Result; // 0x1730(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_4_Transform; // 0x1750(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_4_CachedIndex; // 0x17B0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Interpolate_1_A; // 0x17C0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_1_1_Transform; // 0x17E0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_1_1_CachedIndex; // 0x1840(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Interpolate_1_B; // 0x1850(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_2_1_Remap_1_Result;  // 0x1870(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_2_1_Interpolate_1_T; // 0x1878(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4257[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_1_1_1_Transform; // 0x1880(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_1_1_1_CachedIndex; // 0x18E0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Multiply_B;      // 0x18F0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Inverse_Result;  // 0x1910(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_1_1_1_1_Transform; // 0x1930(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_1_RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0x1990(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Inverse_Value;   // 0x19A0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_1_Set_Transform_2_CachedIndex; // 0x19C0(0x10)(Edit, EditConst, NonTransactional)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Multiply_1_1_Result; // 0x19D0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Multiply_1_Result; // 0x19F0(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                 RigVMModel___BlinkInterpolate_2_1_Interpolate_1_1_Result; // 0x1A10(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___BlinkInterpolate_2_1_Remap_1_1_Result; // 0x1A30(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___BlinkInterpolate_2_1_Interpolate_1_1_T; // 0x1A38(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4258[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___BlinkInterpolate_2_1_Set_Transform_1_2_CachedIndex; // 0x1A40(0x10)(Edit, EditConst, NonTransactional)
	class FName                                  RigVMModel___Replace_1_1_Result;                   // 0x1A50(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___ArrayIterator_2_1_1_Element;          // 0x1A58(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_1_1_Name;                     // 0x1A64(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___ParentConstraint_2_1_Child__IO;       // 0x1A6C(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>             RigVMModel___ParentConstraint_2_1_Parents__IO;     // 0x1A78(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_2_1_ChildCache;      // 0x1A88(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_2_1_ParentCaches;    // 0x1A98(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_4_Items;    // 0x1AA8(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_2_1_1_Index;            // 0x1AB8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_2_1_1_Count;            // 0x1ABC(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_2_1_1_Ratio;            // 0x1AC0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_2_1_1_Continue : 1;     // Mask: 0x1, PropSize: 0x10x1AC4(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_292 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4259[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ArrayIterator_2_1_1_1_Element;        // 0x1AC8(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_425A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_2_1_1_ChildCache;    // 0x1AD8(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_2_1_1_ParentCaches;  // 0x1AE8(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_2_1_1_1_Items; // 0x1AF8(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_2_1_1_1_Index;          // 0x1B08(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_2_1_1_1_Count;          // 0x1B0C(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_2_1_1_1_Ratio;          // 0x1B10(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_2_1_1_1_Continue : 1;   // Mask: 0x1, PropSize: 0x10x1B14(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_293 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_425B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ArrayIterator_2_1_1_1_1_Element;      // 0x1B18(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_425C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_2_1_1_1_ChildCache;  // 0x1B28(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_2_1_1_1_ParentCaches; // 0x1B38(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_2_1_1_1_1_Items; // 0x1B48(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_2_1_1_1_1_Index;        // 0x1B58(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_2_1_1_1_1_Count;        // 0x1B5C(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_2_1_1_1_1_Ratio;        // 0x1B60(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_2_1_1_1_1_Continue : 1; // Mask: 0x1, PropSize: 0x10x1B64(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_294 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_425D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_2_1_1_1_1_ChildCache; // 0x1B68(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_2_1_1_1_1_ParentCaches; // 0x1B78(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_2_1_1_1_2_ChildCache; // 0x1B88(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_2_1_1_1_2_ParentCaches; // 0x1B98(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_2_1_1_1_1_1_ChildCache; // 0x1BA8(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_2_1_1_1_1_1_ParentCaches; // 0x1BB8(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___ParentConstraint_2_1_1_1_2_1_ChildCache; // 0x1BC8(0x10)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>     RigVMModel___ParentConstraint_2_1_1_1_2_1_ParentCaches; // 0x1BD8(0x10)(Edit, EditConst, NonTransactional)
	uint8                                        Pad_425E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_GetTransform_5_2_Transform;   // 0x1BF0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_5_2_CachedIndex; // 0x1C50(0x10)(Edit, EditConst, NonTransactional)
	float                                        RigVMModel___Interpolate_1_3_Result;               // 0x1C60(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_3_A;                    // 0x1C64(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_1_Result;                         // 0x1C68(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_1_A;                              // 0x1C70(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_3_Result;                    // 0x1C78(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_3_B;                    // 0x1C80(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_1_Result;            // 0x1C84(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_4_1_1_Result;                // 0x1C88(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_1_1_Result;                    // 0x1C90(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_425F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                RigVMModel___Random_1_1_LastResult;                // 0x1C98(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_1_1_LastSeed;                  // 0x1CA8(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_1_1_BaseSeed;                  // 0x1CB8(0x10)(Edit, EditConst, NonTransactional)
	TArray<float>                                RigVMModel___Random_1_1_TimeLeft;                  // 0x1CC8(0x10)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Multiply_4_1_1_B;                     // 0x1CD8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_1_TargetValue;       // 0x1CE0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_1_InitialValue;      // 0x1CE4(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                RigVMModel___AccumulateLerp_1_1_AccumulatedValue;  // 0x1CE8(0x10)(Edit, EditConst, NonTransactional)
	uint8                                        Pad_4260[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_SetTransform_6_Value__IO;     // 0x1D00(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_6_CachedIndex;   // 0x1D60(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_5_Transform;     // 0x1D70(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_5_CachedIndex;   // 0x1DD0(0x10)(Edit, EditConst, NonTransactional)
	float                                        RigVMModel___Interpolate_1_Result;                 // 0x1DE0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_A;                      // 0x1DE4(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_Result;                           // 0x1DE8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_A;                                // 0x1DF0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_B;                      // 0x1DF8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_Result;                // 0x1DFC(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Clamp_Result;                         // 0x1E00(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_3_Result;                         // 0x1E08(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_4_Result;                    // 0x1E10(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_Result;                        // 0x1E18(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4261[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                RigVMModel___Random_LastResult;                    // 0x1E20(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_LastSeed;                      // 0x1E30(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_BaseSeed;                      // 0x1E40(0x10)(Edit, EditConst, NonTransactional)
	TArray<float>                                RigVMModel___Random_TimeLeft;                      // 0x1E50(0x10)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Multiply_4_B;                         // 0x1E60(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_4_2_Result;                  // 0x1E68(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_2_Result;                      // 0x1E70(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4262[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                RigVMModel___Random_2_LastResult;                  // 0x1E78(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_2_LastSeed;                    // 0x1E88(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_2_BaseSeed;                    // 0x1E98(0x10)(Edit, EditConst, NonTransactional)
	TArray<float>                                RigVMModel___Random_2_TimeLeft;                    // 0x1EA8(0x10)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Multiply_4_2_B;                       // 0x1EB8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_TargetValue;           // 0x1EC0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4263[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RigVMModel___Add_4_Result;                         // 0x1EC8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_InitialValue;          // 0x1ED0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4264[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                RigVMModel___AccumulateLerp_AccumulatedValue;      // 0x1ED8(0x10)(Edit, EditConst, NonTransactional)
	float                                        RigVMModel___Interpolate_1_2_Result;               // 0x1EE8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_2_A;                    // 0x1EEC(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Subtract_1_1_Result;                  // 0x1EF0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Subtract_1_1_A;                       // 0x1EF8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_Result;                      // 0x1F00(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_2_B;                    // 0x1F08(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4265[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_SetTransform_3_Value__IO;     // 0x1F10(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_3_CachedIndex;   // 0x1F70(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_6_Transform;     // 0x1F80(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_6_CachedIndex;   // 0x1FE0(0x10)(Edit, EditConst, NonTransactional)
	float                                        RigVMModel___Interpolate_1_1_Result;               // 0x1FF0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_1_A;                    // 0x1FF4(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Subtract_1_Result;                    // 0x1FF8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Subtract_1_A;                         // 0x2000(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_1_B;                    // 0x2008(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_2_1_Result;             // 0x200C(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_2_1_A;                  // 0x2010(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4266[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RigVMModel___Subtract_1_1_1_Result;                // 0x2018(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Subtract_1_1_1_A;                     // 0x2020(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_2_Result;                    // 0x2028(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_2_1_B;                  // 0x2030(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4267[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_SetTransform_3_1_Value__IO;   // 0x2040(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_3_1_CachedIndex; // 0x20A0(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_5_2_1_Transform; // 0x20B0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_5_2_1_CachedIndex; // 0x2110(0x10)(Edit, EditConst, NonTransactional)
	float                                        RigVMModel___Interpolate_1_3_1_Result;             // 0x2120(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_3_1_A;                  // 0x2124(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_1_1_Result;                       // 0x2128(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Add_1_1_A;                            // 0x2130(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_3_1_Result;                  // 0x2138(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Interpolate_1_3_1_B;                  // 0x2140(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_Result;              // 0x2144(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_4_1_Result;                  // 0x2148(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___Random_1_Result;                      // 0x2150(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4268[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                RigVMModel___Random_1_LastResult;                  // 0x2158(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_1_LastSeed;                    // 0x2168(0x10)(Edit, EditConst, NonTransactional)
	TArray<int32>                                RigVMModel___Random_1_BaseSeed;                    // 0x2178(0x10)(Edit, EditConst, NonTransactional)
	TArray<float>                                RigVMModel___Random_1_TimeLeft;                    // 0x2188(0x10)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Multiply_4_1_B;                       // 0x2198(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_TargetValue;         // 0x21A0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___AccumulateLerp_1_InitialValue;        // 0x21A4(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                RigVMModel___AccumulateLerp_1_AccumulatedValue;    // 0x21A8(0x10)(Edit, EditConst, NonTransactional)
	uint8                                        Pad_4269[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_SetTransform_6_1_Value__IO;   // 0x21C0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_6_1_CachedIndex; // 0x2220(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_8_Transform;     // 0x2230(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_8_CachedIndex;   // 0x2290(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_5_CachedIndex;   // 0x22A0(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_Transform;       // 0x22B0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_CachedIndex;     // 0x2310(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_CachedIndex;     // 0x2320(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_7_Transform;     // 0x2330(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_7_CachedIndex;   // 0x2390(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_4_CachedIndex;   // 0x23A0(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___Interpolate_Result;                   // 0x23B0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_Transform;     // 0x2410(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_CachedIndex;   // 0x2470(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_3_Transform;     // 0x2480(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_3_CachedIndex;   // 0x24E0(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_CachedIndex;            // 0x24F0(0x10)(Edit, EditConst, NonTransactional)
	class FName                                  RigVMModel___Replace_Result;                       // 0x2500(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___ArrayIterator_2_Element;              // 0x2508(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_Name;                         // 0x2514(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___Set_Transform_1_Item__IO;             // 0x251C(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_426A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___GetTransform_Transform;               // 0x2530(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_CachedIndex;             // 0x2590(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_1_CachedIndex;          // 0x25A0(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_4_Transform;     // 0x25B0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_4_CachedIndex;   // 0x2610(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_SetTransform_2_Value__IO;     // 0x2620(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_2_CachedIndex;   // 0x2680(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_4_1_Transform;   // 0x2690(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_4_1_CachedIndex; // 0x26F0(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_SetTransform_2_1_Value__IO;   // 0x2700(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetTransform_2_1_CachedIndex; // 0x2760(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                RigVMModel___CollectionNameSearchArray_2_Items;    // 0x2770(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_2_Index;                // 0x2780(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_2_Count;                // 0x2784(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_2_Ratio;                // 0x2788(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_2_Continue : 1;         // Mask: 0x1, PropSize: 0x10x278C(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_295 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_426B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ArrayIterator_3_Element;              // 0x2790(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_426C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___GetTransform_1_Transform;             // 0x27A0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_1_CachedIndex;           // 0x2800(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___Set_Transform_1_1_Value__IO;          // 0x2810(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_1_1_CachedIndex;        // 0x2870(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___AimBoneMath_Result;                   // 0x2880(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___GetTransform_2_Transform;             // 0x28E0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_2_CachedIndex;           // 0x2940(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___GetTransform_2_1_Transform;           // 0x2950(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_2_Result;                     // 0x29B0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_2_Name;                       // 0x29B8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___GetTransform_2_1_Item__IO;            // 0x29C0(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_426D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_2_1_CachedIndex;         // 0x29D0(0x10)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target               RigVMModel___AimBoneMath_Primary__IO;              // 0x29E0(0x48)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>             RigVMModel___AimBoneMath_PrimaryCachedSpace;       // 0x2A28(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___AimBoneMath_SecondaryCachedSpace;     // 0x2A38(0x10)(Edit, EditConst, NonTransactional)
	uint8                                        Pad_426E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 RigVMModel___Set_Transform_2_2_Value;              // 0x2A50(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_2_2_CachedIndex;        // 0x2A70(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_3_Index;                // 0x2A80(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_3_Count;                // 0x2A84(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_3_Ratio;                // 0x2A88(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_3_Continue : 1;         // Mask: 0x1, PropSize: 0x10x2A8C(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_296 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_426F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        RigVMModel___ArrayIterator_3_1_Element;            // 0x2A90(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4270[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___GetTransform_1_1_Transform;           // 0x2AA0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_1_1_CachedIndex;         // 0x2B00(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___Set_Transform_1_1_1_Value__IO;        // 0x2B10(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_1_1_1_CachedIndex;      // 0x2B70(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___AimBoneMath_1_Result;                 // 0x2B80(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___GetTransform_2_2_Transform;           // 0x2BE0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_2_2_CachedIndex;         // 0x2C40(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___GetTransform_2_1_1_Transform;         // 0x2C50(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_2_1_Result;                   // 0x2CB0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                  RigVMModel___Replace_2_1_Name;                     // 0x2CB8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                        RigVMModel___GetTransform_2_1_1_Item__IO;          // 0x2CC0(0xC)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4271[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_2_1_1_CachedIndex;       // 0x2CD0(0x10)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target               RigVMModel___AimBoneMath_1_Primary__IO;            // 0x2CE0(0x48)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>             RigVMModel___AimBoneMath_1_PrimaryCachedSpace;     // 0x2D28(0x10)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>             RigVMModel___AimBoneMath_1_SecondaryCachedSpace;   // 0x2D38(0x10)(Edit, EditConst, NonTransactional)
	uint8                                        Pad_4272[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 RigVMModel___Set_Transform_2_2_1_Value;            // 0x2D50(0x20)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_2_2_1_CachedIndex;      // 0x2D70(0x10)(Edit, EditConst, NonTransactional)
	int32                                        RigVMModel___ArrayIterator_3_1_Index;              // 0x2D80(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        RigVMModel___ArrayIterator_3_1_Count;              // 0x2D84(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___ArrayIterator_3_1_Ratio;              // 0x2D88(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        RigVMModel___ArrayIterator_3_1_Continue : 1;       // Mask: 0x1, PropSize: 0x10x2D8C(0x1)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        BitPad_297 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_4273[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RigVMModel___Multiply_1_Result;                    // 0x2D90(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___MathVectorDistance_1_Result;          // 0x2D98(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4274[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_GetTransform_5_1_Transform;   // 0x2DA0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_5_1_CachedIndex; // 0x2E00(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___MathVectorDistance_1_A;               // 0x2E10(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4275[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_GetTransform_6_1_Transform;   // 0x2E30(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_6_1_CachedIndex; // 0x2E90(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___MathVectorDistance_1_B;               // 0x2EA0(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_1_A;                         // 0x2EB8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_1_1_Result;                  // 0x2EC0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___MathVectorDistance_1_1_Result;        // 0x2EC8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4276[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_GetTransform_5_1_1_Transform; // 0x2ED0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_5_1_1_CachedIndex; // 0x2F30(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___MathVectorDistance_1_1_A__IO;         // 0x2F40(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4277[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_GetTransform_6_1_1_Transform; // 0x2F60(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_6_1_1_CachedIndex; // 0x2FC0(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___MathVectorDistance_1_1_B__IO;         // 0x2FD0(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_1_1_A;                       // 0x2FE8(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_1_1_1_Result;                // 0x2FF0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___MathVectorDistance_1_1_1_Result;      // 0x2FF8(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4278[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_GetTransform_5_1_1_1_Transform; // 0x3000(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_5_1_1_1_CachedIndex; // 0x3060(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___MathVectorDistance_1_1_1_A__IO;       // 0x3070(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4279[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___RigUnit_GetTransform_6_1_1_1_Transform; // 0x3090(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_6_1_1_1_CachedIndex; // 0x30F0(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___MathVectorDistance_1_1_1_B__IO;       // 0x3100(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Multiply_1_1_1_A;                     // 0x3118(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___Interpolate_2_Result;                 // 0x3120(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_1_Transform;   // 0x3180(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_1_CachedIndex; // 0x31E0(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_3_1_Transform;   // 0x31F0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_3_1_CachedIndex; // 0x3250(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___Set_Transform_2_Value__IO;            // 0x3260(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_2_CachedIndex;          // 0x32C0(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___Interpolate_2_1_Result;               // 0x32D0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_2_1_1_Transform; // 0x3330(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_2_1_1_CachedIndex; // 0x3390(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___RigUnit_GetTransform_3_1_1_Transform; // 0x33A0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_GetTransform_3_1_1_CachedIndex; // 0x3400(0x10)(Edit, EditConst, NonTransactional)
	struct FTransform                            RigVMModel___Set_Transform_2_1_Value__IO;          // 0x3410(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___Set_Transform_2_1_CachedIndex;        // 0x3470(0x10)(Edit, EditConst, NonTransactional)
	double                                       RigVMModel___Degrees_Result;                       // 0x3480(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        RigVMModel___MathVectorAngle_Result;               // 0x3488(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_427A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RigVMModel___Subtract_Result;                      // 0x3490(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_427B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___GetTransform_6_2_Transform;           // 0x34B0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_6_2_CachedIndex;         // 0x3510(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___Subtract_A;                           // 0x3520(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_427C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RigVMModel___GetTransform_6_1_Transform;           // 0x3540(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_6_1_CachedIndex;         // 0x35A0(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___Subtract_B;                           // 0x35B0(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                               RigVMModel___Subtract_2_Result;                    // 0x35C8(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RigVMModel___GetTransform_6_Transform;             // 0x35E0(0x60)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>             RigVMModel___GetTransform_6_CachedIndex;           // 0x3640(0x10)(Edit, EditConst, NonTransactional)
	struct FVector                               RigVMModel___Subtract_2_A;                         // 0x3650(0x18)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       RigVMModel___Degrees_Value;                        // 0x3668(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class URigVMMemory_Work_CRF2* GetDefaultObj();

};

}


