#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x188 (0x238 - 0xB0)
// BlueprintGeneratedClass DissolveFXComponent.DissolveFXComponent_C
class UDissolveFXComponent_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                     DissolveCharacterFX;                               // 0xB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                       TimeToDissolve;                                    // 0xC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          DissolveTimer;                                     // 0xC8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          DestroyTimer;                                      // 0xD0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                        DissolveVFX;                                       // 0xD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                        DissolveVFX_Reverse;                               // 0xE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         AutomaticRadius;                                   // 0xE8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39B3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       DissolveRadius;                                    // 0xF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShowDebug;                                         // 0xF8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39B4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       DebugThickness;                                    // 0x100(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ReverseDissolve;                                   // 0x108(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShowDebug_ExternalRadius;                          // 0x109(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShowDebug_InternalRadius;                          // 0x10A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39B5[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       StartDissolveDelayWhenDyingWithoutAnimation;       // 0x110(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DestroyActorAfterDissolve;                         // 0x118(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39B6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GradientScale;                                     // 0x11C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  BoneCenter;                                        // 0x120(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentDissolveRatio;                              // 0x128(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CurrentWorldPosition;                              // 0x130(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                MeshesToDissolve;                                  // 0x148(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMeshComponent*                        CharacterMesh;                                     // 0x158(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         FreezeWorldPosition;                               // 0x160(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OverrideBoneCenter;                                // 0x161(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39B7[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  OverriddenBoneCenter;                              // 0x164(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39B8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnDissolveStart;                                   // 0x170(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         OverrideTimeToDissolve;                            // 0x180(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39B9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       OverriddenTimeToDissolve;                          // 0x188(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OverrideGradientScale;                             // 0x190(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39BA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverriddenGradientScale;                           // 0x194(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnDissolveEnd;                                     // 0x198(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         IsDissolving;                                      // 0x1A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OverrideDissolveVFX;                               // 0x1A9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39BB[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UNiagaraSystem*                        OverriddenDissolveVFX;                             // 0x1B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldDissolveWhenDyingWithoutAnimation;           // 0x1B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OverrideReverseDissolveVFX;                        // 0x1B9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39BC[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UNiagaraSystem*                        OverriddenReverseDissolveVFX;                      // 0x1C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                  DeactivateComponentOnDissolveTag;                  // 0x1C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  DontShowOnReverseDissolveTag;                      // 0x1D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsDead;                                            // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39BD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FActiveGameplayEffectHandle           GEDelayDisableIfDeadAdded_Handle;                  // 0x1DC(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsDissolved;                                       // 0x1E4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39BE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAkAnathemaEvent                      Dissolve_sound;                                    // 0x1E8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UDissolveFXComponent_C* GetDefaultObj();

	void CanMeshBeDissolved(class UMeshComponent* MeshComponent, bool* CanBeDissolved, class FName Temp_name_Variable, bool CallFunc_Array_Contains_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class ALOTF2Character* K2Node_DynamicCast_AsLOTF2Character, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, TArray<class USceneComponent*>& CallFunc_GetParentComponents_Parents, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, class USceneComponent* CallFunc_Array_Get_Item, class AActor* CallFunc_GetOwner_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, class ALOTF2Character* K2Node_DynamicCast_AsLOTF2Character_1, bool K2Node_DynamicCast_bSuccess_1, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1, bool CallFunc_HasMatchingGameplayTag_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_2, class AActor* CallFunc_GetOwner_ReturnValue_3, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue_1);
	void DeactivateComponentsOnDisolve(class AActor* ActorOwner, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UActorComponent*>& CallFunc_GetComponentsByTag_ReturnValue, class UActorComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UFXSystemComponent* K2Node_DynamicCast_AsFXSystem_Component, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, class UNiagaraComponent* K2Node_DynamicCast_AsNiagara_Particle_System_Component, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_ComponentHasTag_ReturnValue);
	void _GetDissolveVFX(class UNiagaraSystem** DissolveVFX, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, class UNiagaraSystem* K2Node_Select_Default, class UNiagaraSystem* K2Node_Select_Default_1, class UNiagaraSystem* K2Node_Select_Default_2);
	void _CancelDissolveInternal(bool CallFunc_RemoveGameplayEffectByHandle_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void _GetGradientScale(double* GradientScale, double CallFunc_SelectFloat_ReturnValue, double CallFunc_SelectFloat_B_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast);
	void _GetTimeToDissolve(double* TimeToDissolve, double CallFunc_SelectFloat_ReturnValue);
	struct FVector _GetSphereCenter(bool Temp_bool_Variable, class FName CallFunc_MakeLiteralName_ReturnValue, bool CallFunc_IsValid_ReturnValue, class FName K2Node_Select_Default, bool CallFunc_EqualEqual_NameName_ReturnValue, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_SelectVector_ReturnValue);
	void _ComputeDissolveRadius(double* ComputedRadius, const struct FVector& CallFunc__GetSphereCenter_ReturnValue, const struct FVector& CallFunc_GetComponentBounds_Origin, const struct FVector& CallFunc_GetComponentBounds_BoxExtent, float CallFunc_GetComponentBounds_SphereRadius, double CallFunc_Vector_Distance_ReturnValue, double CallFunc_GetMaxElement_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue);
	void _UpdateVisibility(bool Temp_bool_Variable, class AActor* CallFunc_GetOwner_ReturnValue, TScriptInterface<class IHorse_BPInterface_C> K2Node_DynamicCast_AsHorse_BPInterface, bool K2Node_DynamicCast_bSuccess, class AActor* CallFunc_GetRider_rider, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void _SetMaterialParameters(int32 Temp_int_Array_Index_Variable, double CallFunc__GetGradientScale_GradientScale, double CallFunc__GetGradientScale_GradientScale_1, int32 Temp_int_Loop_Counter_Variable, class UMeshComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_InRange_FloatFloat_ReturnValue, float CallFunc_BreakVector3f_X, float CallFunc_BreakVector3f_Y, float CallFunc_BreakVector3f_Z, double CallFunc_SelectFloat_ReturnValue, const struct FVector4& CallFunc_MakeVector4_ReturnValue, const struct FVector4& CallFunc_MakeVector4_ReturnValue_1, float CallFunc_SetVariableFloat_InValue_ImplicitCast, float CallFunc_SetVariableFloat_InValue_ImplicitCast_1, float CallFunc_SetFloatParameter_Param_ImplicitCast, const struct FVector3f& CallFunc_BreakVector3f_InVec_ImplicitCast, double CallFunc_MakeVector4_X_ImplicitCast, double CallFunc_MakeVector4_Y_ImplicitCast, double CallFunc_MakeVector4_Z_ImplicitCast);
	void _StartDissolveInternal(const struct FActiveGameplayEffectHandle& PrevGEDelayDisableIfDeadAdded_Handle, bool WasDissolving, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_RemoveGameplayEffectByHandle_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface, bool K2Node_DynamicCast_bSuccess, bool CallFunc_HasMatchingGameplayTag_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, class UNiagaraSystem* CallFunc__GetDissolveVFX_DissolveVFX, bool CallFunc_IsValid_ReturnValue_1, TArray<class AActor*>& CallFunc_GetAttachedActors_OutActors, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool Temp_bool_Variable, double CallFunc__GetTimeToDissolve_TimeToDissolve, bool CallFunc_Greater_DoubleDouble_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, const struct FVector& CallFunc__GetSphereCenter_ReturnValue, TArray<class USceneComponent*>& CallFunc_GetChildrenComponents_Children, class UStaticMeshComponent* K2Node_DynamicCast_AsStatic_Mesh_Component, bool K2Node_DynamicCast_bSuccess_1, class USceneComponent* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, class UMeshComponent* K2Node_DynamicCast_AsMesh_Component, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_CanMeshBeDissolved_CanBeDissolved, class USkeletalMeshComponent* K2Node_DynamicCast_AsSkeletal_Mesh_Component, bool K2Node_DynamicCast_bSuccess_3, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, class AActor* CallFunc_GetOwner_ReturnValue_2, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, class UMeshComponent* CallFunc_GetComponentByClass_ReturnValue, TArray<class UMeshComponent*>& CallFunc_GetComponentsByTag_ReturnValue, class ALOTF2Character* K2Node_DynamicCast_AsLOTF2Character, bool K2Node_DynamicCast_bSuccess_4, class UMeshComponent* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, double CallFunc__ComputeDissolveRadius_ComputedRadius, int32 CallFunc_Array_Add_ReturnValue_1, double CallFunc_SelectFloat_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_3, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, float CallFunc_K2_SetTimer_Time_ImplicitCast);
	void _EndDissolveInternal(bool CallFunc_RemoveGameplayEffectByHandle_ReturnValue, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_SelectFloat_ReturnValue);
	void CancelDissolve(class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue);
	void StartDissolveWithParams(bool ReverseDissolve, bool OverrideDuration, double Duration, bool OverrideGradientScale, double GradientScale, bool OverrideBoneCenter, class FName BoneCenter, bool OverrideDissolveVFX, class UNiagaraSystem* DissolveVFX, bool OverrideReverseDissolve, class UNiagaraSystem* ReverseDissolveVFX, bool FreezeWorldPosition, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue);
	void ResetDissolve(double CallFunc_SelectFloat_ReturnValue);
	void StartDissolveReverse(class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue);
	void StartDissolve(class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue);
	void EventReceived_2193E7EB4EB32C84B6DBA9AF3169FA8C(const struct FGameplayEventData& Payload);
	void EventReceived_386DA1F643B1A2F13A9158804A5C0AA1(const struct FGameplayEventData& Payload);
	void EventReceived_5C1BC83241069B6BFF8118878AAD319F(const struct FGameplayEventData& Payload);
	void EventReceived_34BCB31742A2B8C1B0D30B82DE32741F(const struct FGameplayEventData& Payload);
	void EventReceived_E3DBB45E4A9C4FEED328E989F14170C5(const struct FGameplayEventData& Payload);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void PRIVATE_MulticastStartDissolve(bool ReverseDissolve, bool OverrideDuration, double Duration, bool OverrideGradientScale, double GradientScale, bool OverrideBoneCenter, class FName BoneCenter, bool OverrideVFX, class UNiagaraSystem* DissolveVFX, bool OverrideReverseVFX, class UNiagaraSystem* ReverseDissolveVFX, bool FreezeWorldPosition);
	void Start_Dissolve_Reverse_Delay(double Delay);
	void PRIVATE_MulticastCancelDissolve();
	void ExecuteUbergraph_DissolveFXComponent(int32 EntryPoint, const struct FGameplayEventData& K2Node_CustomEvent_Payload_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FGameplayEventData& Temp_struct_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FGameplayEventData& K2Node_CustomEvent_Payload_2, const struct FGameplayEventData& Temp_struct_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct FGameplayEventData& K2Node_CustomEvent_Payload_1, const struct FGameplayEventData& Temp_struct_Variable_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, const struct FGameplayEventData& K2Node_CustomEvent_Payload, const struct FGameplayEventData& Temp_struct_Variable_3, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, float K2Node_Event_DeltaSeconds, bool CallFunc_K2_IsValidTimerHandle_ReturnValue, float CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class AActor* CallFunc_GetOwner_ReturnValue_1, class UAbilityAsync_WaitGameplayEvent* CallFunc_WaitGameplayEventToActor_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UAbilityAsync_WaitGameplayEvent* CallFunc_WaitGameplayEventToActor_ReturnValue_1, class UAbilityAsync_WaitGameplayEvent* CallFunc_WaitGameplayEventToActor_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, class UAbilityAsync_WaitGameplayEvent* CallFunc_WaitGameplayEventToActor_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_3, class UAbilityAsync_WaitGameplayEvent* CallFunc_WaitGameplayEventToActor_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_4, bool K2Node_CustomEvent_ReverseDissolve, bool K2Node_CustomEvent_OverrideDuration, double K2Node_CustomEvent_Duration, bool K2Node_CustomEvent_OverrideGradientScale, double K2Node_CustomEvent_GradientScale, bool K2Node_CustomEvent_OverrideBoneCenter, class FName K2Node_CustomEvent_BoneCenter, bool K2Node_CustomEvent_OverrideVFX, class UNiagaraSystem* K2Node_CustomEvent_DissolveVFX, bool K2Node_CustomEvent_OverrideReverseVFX, class UNiagaraSystem* K2Node_CustomEvent_ReverseDissolveVFX, bool K2Node_CustomEvent_FreezeWorldPosition, const struct FGameplayEventData& Temp_struct_Variable_4, double CallFunc_Subtract_DoubleDouble_ReturnValue, const struct FVector& CallFunc__GetSphereCenter_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc__GetTimeToDissolve_TimeToDissolve, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, const struct FGameplayEventData& K2Node_CustomEvent_Payload_4, double CallFunc_SelectFloat_ReturnValue, double CallFunc_FClamp_ReturnValue, double CallFunc__GetGradientScale_GradientScale, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double K2Node_CustomEvent_Delay, double CallFunc_Divide_DoubleDouble_A_ImplicitCast, float CallFunc_DrawDebugSphere_Thickness_ImplicitCast, float CallFunc_DrawDebugSphere_Thickness_ImplicitCast_1, float CallFunc_Delay_Duration_ImplicitCast, float K2Node_VariableSet_OverriddenGradientScale_ImplicitCast, float CallFunc_DrawDebugSphere_Radius_ImplicitCast, float CallFunc_DrawDebugSphere_Radius_ImplicitCast_1, float CallFunc_Delay_Duration_ImplicitCast_1);
	void OnDissolveEnd__DelegateSignature();
	void OnDissolveStart__DelegateSignature(bool IsReverse);
};

}


