#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x140 (0x860 - 0x720)
// WidgetBlueprintGeneratedClass W_Head_Features.W_Head_Features_C
class UW_Head_Features_C : public UHeadFeaturesScreenWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x720(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_SkinTypeSelector_C*                 Age_Selector;                                      // 0x728(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button;                                            // 0x730(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_96;                                         // 0x738(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShapeSelector_C*                  Cheekbones_Selector;                               // 0x740(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          Container_ScrollArrows;                            // 0x748(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Container_ShapeCustomization;                      // 0x750(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShapeSelector_C*                  Ears_Selector;                                     // 0x758(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShapeSelector_C*                  Eyes_Selector;                                     // 0x760(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ColorSelector_C*                  EyesColor_Selector;                                // 0x768(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          Face_Presets;                                      // 0x770(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShapeSelector_C*                  Face_Selector;                                     // 0x778(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image;                                             // 0x780(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_1;                                           // 0x788(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_2;                                           // 0x790(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_3;                                           // 0x798(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_4;                                           // 0x7A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_5;                                           // 0x7A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_6;                                           // 0x7B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_7;                                           // 0x7B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_10;                                          // 0x7C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_11;                                          // 0x7C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_12;                                          // 0x7D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_13;                                          // 0x7D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_90;                                          // 0x7E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_412;                                         // 0x7E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShapeSelector_C*                  Mouth_Selector;                                    // 0x7F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShapeSelector_C*                  Nose_Selector;                                     // 0x7F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shape_Empty_C*                    Shape_Empty;                                       // 0x800(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shape_Eyes_C*                     Shape_EyesColor;                                   // 0x808(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Shape_Face_C*                     Shape_Face;                                        // 0x810(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BottomBarButton_C*                  W_BottomBarButton;                                 // 0x818(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ACameraActor*                          Face_Camera;                                       // 0x820(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ACameraActor*                          Body_Camera;                                       // 0x828(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                Hair_Style;                                        // 0x830(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                FacialHair_Style;                                  // 0x840(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         Is_Armor_Visible;                                  // 0x850(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Warning_Popup_Visible;                             // 0x851(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3535[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUserWidget*                           ShapeWidget;                                       // 0x858(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UW_Head_Features_C* GetDefaultObj();

	void Set_Shape_Widget(class UOptionSelectorBaseWidget* Feature);
	class UWidget* Select_Age(enum class EUINavigation Navigation);
	class UWidget* Select_Face_appearance(enum class EUINavigation Navigation);
	class UWidget* Select_Eyes_Color(enum class EUINavigation Navigation);
	void Show_Details_Panel(class UUserWidget* Selector_Button, class UShapeCategoryWidget* Panel_Widget, bool Show_Fine_Tune);
	void Set_Shape_Visibility(enum class ESlateVisibility Visibility);
	void Update_Icon(class UInputActionImage* Input_Image, const struct FGameplayTag& CallFunc_GetInputAction_ReturnValue, class UTexture2D* CallFunc_GetControllerIconByEventName_ReturnValue);
	class UWidget* GetDesiredFocusTarget(bool CallFunc_IsValid_ReturnValue);
	class UWidget* Select_Cheekbones(enum class EUINavigation Navigation);
	class UWidget* Select_Mouth(enum class EUINavigation Navigation);
	class UWidget* Select_Ears(enum class EUINavigation Navigation);
	class UWidget* Select_Nose(enum class EUINavigation Navigation);
	class UWidget* Select_Eyes(enum class EUINavigation Navigation);
	void BP_PanelActivated();
	void BP_PanelDeactivated();
	void BndEvt__WBP_Head_Customization_Hair_Selector_K2Node_ComponentBoundEvent_6_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void BndEvt__WBP_Head_Customization_Nose_Selector_K2Node_ComponentBoundEvent_7_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void BndEvt__WBP_Head_Customization_Ears_Selector_K2Node_ComponentBoundEvent_8_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void BndEvt__WBP_Head_Customization_Mouth_Selector_K2Node_ComponentBoundEvent_9_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void BndEvt__WBP_Head_Customization_Cheekbones_Selector_K2Node_ComponentBoundEvent_10_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void BndEvt__WBP_Head_Customization_Eyes_Selector_K2Node_ComponentBoundEvent_11_OnHeadShapeSelected__DelegateSignature(const class FString& FeatureName, enum class ECustomizationCategory Category);
	void BndEvt__WBP_Head_Customization_Nose_Selector_K2Node_ComponentBoundEvent_12_OnHeadShapeSelected__DelegateSignature(const class FString& FeatureName, enum class ECustomizationCategory Category);
	void BndEvt__WBP_Head_Customization_Ears_Selector_K2Node_ComponentBoundEvent_13_OnHeadShapeSelected__DelegateSignature(const class FString& FeatureName, enum class ECustomizationCategory Category);
	void BndEvt__WBP_Head_Customization_Mouth_Selector_K2Node_ComponentBoundEvent_14_OnHeadShapeSelected__DelegateSignature(const class FString& FeatureName, enum class ECustomizationCategory Category);
	void BndEvt__WBP_Head_Customization_Cheekbones_Selector_K2Node_ComponentBoundEvent_15_OnHeadShapeSelected__DelegateSignature(const class FString& FeatureName, enum class ECustomizationCategory Category);
	void BndEvt__WBP_Head_Customization_W_BottomBarButton_K2Node_ComponentBoundEvent_19_OnButtonActionComplete__DelegateSignature();
	void BP_RandomizeCharacter();
	void BndEvt__W_Head_Customization_Eyes_Selector_1_K2Node_ComponentBoundEvent_20_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void BP_StopShapeCustomization();
	void BndEvt__W_Head_Customization_Face_Selector_K2Node_ComponentBoundEvent_22_On_Customize_Feature__DelegateSignature(enum class ECustomizationCategory Customization_Category);
	void OnRequestEditHead(enum class ECustomizationCategory Category, bool bShowPanel, const class FString& SelectedOption);
	void BndEvt__W_Head_Features_Grid_Presets_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__W_Head_Features_Grid_Presets_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__W_Head_Features_Button_FineTune_K2Node_ComponentBoundEvent_2_OnButtonActionComplete__DelegateSignature();
	void ExecuteUbergraph_W_Head_Features(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue_1, class ALOTF2Character* K2Node_DynamicCast_AsLOTF2Character, bool K2Node_DynamicCast_bSuccess, class ALOTF2Character* K2Node_DynamicCast_AsLOTF2Character_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsArmorVisible_ReturnValue, bool CallFunc_NotEqual_BoolBool_ReturnValue, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category_6, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category_5, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category_4, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category_3, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category_2, const class FString& K2Node_ComponentBoundEvent_featureName_4, enum class ECustomizationCategory K2Node_ComponentBoundEvent_category_4, const class FString& K2Node_ComponentBoundEvent_featureName_3, enum class ECustomizationCategory K2Node_ComponentBoundEvent_category_3, const class FString& K2Node_ComponentBoundEvent_featureName_2, enum class ECustomizationCategory K2Node_ComponentBoundEvent_category_2, const class FString& K2Node_ComponentBoundEvent_featureName_1, enum class ECustomizationCategory K2Node_ComponentBoundEvent_category_1, const class FString& K2Node_ComponentBoundEvent_featureName, enum class ECustomizationCategory K2Node_ComponentBoundEvent_category, int32 CallFunc_PostEventAtLocation_ReturnValue, int32 CallFunc_PostEventAtLocation_ReturnValue_1, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category_1, bool CallFunc_IsValid_ReturnValue, enum class ECustomizationCategory K2Node_ComponentBoundEvent_Customization_Category, enum class ECustomizationCategory K2Node_Event_category, bool K2Node_Event_bShowPanel, const class FString& K2Node_Event_selectedOption, class UObject* K2Node_ComponentBoundEvent_Item_1, bool K2Node_ComponentBoundEvent_bIsHovered, class UObject* K2Node_ComponentBoundEvent_Item, bool K2Node_ComponentBoundEvent_bIsSelected, class UUserWidget* CallFunc_GetWidgetFromItem_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UW_HeadPresetWidget_list_C* K2Node_DynamicCast_AsW_Head_Preset_Widget_List, bool K2Node_DynamicCast_bSuccess_2, class UUserWidget* CallFunc_GetWidgetFromItem_ReturnValue_1, TArray<class UObject*>& CallFunc_GetListItems_ReturnValue, class UW_HeadPresetWidget_list_C* K2Node_DynamicCast_AsW_Head_Preset_Widget_List_1, bool K2Node_DynamicCast_bSuccess_3, class UObject* CallFunc_Array_Get_Item, class UUserWidget* CallFunc_GetWidgetFromItem_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue, class UW_HeadPresetWidget_list_C* K2Node_DynamicCast_AsW_Head_Preset_Widget_List_2, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_GetMutableName_ReturnValue, const class FString& CallFunc_GetMutableName_ReturnValue_1, const class FString& CallFunc_GetMutableName_ReturnValue_2, const class FString& CallFunc_GetMutableName_ReturnValue_3, const class FString& CallFunc_GetMutableName_ReturnValue_4);
};

}


