#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x170 (0xDB0 - 0xC40)
// BlueprintGeneratedClass BaseAICharacter_BP.BaseAICharacter_BP_C
class ABaseAICharacter_BP_C : public ABaseAICharacter
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xC40(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_CharacterTendrils_C*             COMP_CharacterTendrils;                            // 0xC48(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoftRepulsionCapsuleComponent*        SoftRepulsionCapsule;                              // 0xC50(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHexAIDamageGaugeComponent*            HexAIDamageGauge;                                  // 0xC58(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                     FleshieSoulVFX;                                    // 0xC60(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDualRealmBehaviourComponent*          DualRealmBehaviour;                                // 0xC68(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Comp_EnvInteraction_C*             BP_Comp_EnvInteraction;                            // 0xC70(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTargetComponent*                      Target1;                                           // 0xC78(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorWidgetComponent*                 StatusBar1;                                        // 0xC80(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPropManagerComponent*                 PropManager;                                       // 0xC88(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Random_EyeBlinking_Timeline_DoubleBlink_FD1158A5461B24D50247CF95B1E9FB93; // 0xC90(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Random_EyeBlinking_Timeline_SingleBlink_FD1158A5461B24D50247CF95B1E9FB93; // 0xC94(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Random_EyeBlinking_Timeline__Direction_FD1158A5461B24D50247CF95B1E9FB93; // 0xC98(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BC0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Random_EyeBlinking_Timeline;                       // 0xCA0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEnemyStatusUIWidget_BP_C*             StatusBarWidget;                                   // 0xCA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTargetComponent*                      TargetComponent;                                   // 0xCB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ADismemberedBleed_StatusEffect_BP_C*   BleedOutStatusEffectActor;                         // 0xCB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bLogDebugInfo;                                     // 0xCC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BC1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       SoulFlayDistance;                                  // 0xCC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_Tick*                     SoulFlayTickTask;                                  // 0xCD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                               InitialSoulPullLocation;                           // 0xCD8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LasSoulFlayDistance;                               // 0xCF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               DesiredSoulPullLocation;                           // 0xCF8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               RelativeSoulPosition;                              // 0xD10(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                      DebugAttributes;                                   // 0xD28(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         bSoulHidden;                                       // 0xD30(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BC2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UNiagaraSystem*                        FleshieSoulVFX_Smoke;                              // 0xD38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                        FleshieSoulVFX_Blast_Appear;                       // 0xD40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                        FleshieSoulVFX_Blast_Disappear;                    // 0xD48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                         bPickSingleBlink;                                  // 0xD50(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3BC3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UPrimitiveComponent*, class UNiagaraComponent*> SpecialDamageSpots_ActiveParticleSystems;          // 0xD58(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UNiagaraSystem*                        SpecialDamageSpots_VFXParticleSystem;              // 0xDA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABaseAICharacter_BP_C* GetDefaultObj();

	void SetFleshieSoulVisibility(bool bNewVisibility, bool CallFunc_IsValid_ReturnValue);
	void UpdateFleshieSoul_MojoFeedback(class UMojoComponent* CallFunc_GetMojoComponent_ReturnValue, float CallFunc_GetMojo_ReturnValue, float CallFunc_GetMojoCapacity_ReturnValue, double CallFunc_SafeDivide_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_SafeDivide_A_ImplicitCast, double CallFunc_SafeDivide_B_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast);
	void CreateDebugAttributes(const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, class UWidgetComponent* CallFunc_AddComponentByClass_ReturnValue, class UWBP_DebugAttributes3DContainer_C* CallFunc_Create_ReturnValue);
	void Print_Debug_End_Play_Info(enum class EEndPlayReason EndPlayReason, const class FString& CallFunc_GetActorCoordinatesString_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_5);
	void PrintDebugDeathInfo(class UObject* DeathInstigator, const class FString& CallFunc_GetActorCoordinatesString_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, bool CallFunc_IsFallingIntoTheVoid_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_SelectString_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_6);
	void PrintDebugBeginPlayInfo(const class FString& CallFunc_GetActorCoordinatesString_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3);
	class FString GetActorCoordinatesString(const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, const class FString& CallFunc_Conv_DoubleToString_ReturnValue, const class FString& CallFunc_Conv_DoubleToString_ReturnValue_1, const class FString& CallFunc_Conv_DoubleToString_ReturnValue_2, TArray<class FString>& K2Node_MakeArray_Array, const class FString& CallFunc_JoinStringArray_ReturnValue);
	void HandleRagdoll();
	void Random_EyeBlinking_Timeline__FinishedFunc();
	void Random_EyeBlinking_Timeline__UpdateFunc();
	void Added_4C1F716E44F61146DD437C916FD7A54B();
	void Removed_18D1186E457910D611B128BC9F278037();
	void Added_65722A874E489D11760C5BB278037A17();
	void BndEvt__HealthComponent_K2Node_ComponentBoundEvent_3_HealthComponentOnTakeDamageDelegate__DelegateSignature(class AActor* DamagedActor, float Damage, const struct FGameplayTagContainer& AllAssetTags, class AActor* InstigatedBy, class AActor* DamageCauser, enum class EHexAttackTypeEffectivenes AttackTypeEffectiveness);
	void Show_Status_Bar();
	void Hide_Status_Bar();
	void On_Targeted(class UTargetComponent* Target, class AActor* Targeter);
	void On_Untargeted(class UTargetComponent* Target, class AActor* Targeter);
	void OnDeath(class AActor* InstigatorActor, struct FGameplayTagContainer& InstigatorTags, bool bDeathWasObserved);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void OnDebugAttributes(bool bEnabled);
	void OnMojoChange_Event_0(float NewMojo, class AActor* MojoChangeInstigator);
	void BndEvt__BaseAICharacter_BP_SpecialDamageSpotsHighlighterComponent_K2Node_ComponentBoundEvent_0_SpecialDamageSpotHighlightColliderEvent__DelegateSignature(class UPrimitiveComponent* SpotColliderComponent);
	void BndEvt__BaseAICharacter_BP_SpecialDamageSpotsHighlighterComponent_K2Node_ComponentBoundEvent_1_SpecialDamageSpotHighlightColliderEvent__DelegateSignature(class UPrimitiveComponent* SpotColliderComponent);
	void BndEvt__BaseAICharacter_BP_SpecialDamageSpotsHighlighterComponent_K2Node_ComponentBoundEvent_2_ActorComponentActivatedSignature__DelegateSignature(class UActorComponent* Component, bool bReset);
	void BndEvt__BaseAICharacter_BP_SpecialDamageSpotsHighlighterComponent_K2Node_ComponentBoundEvent_4_ActorComponentDeactivateSignature__DelegateSignature(class UActorComponent* Component);
	void ExecuteUbergraph_BaseAICharacter_BP(int32 EntryPoint, int32 Temp_int_Loop_Counter_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_IsDead_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsDead_ReturnValue_1, class AActor* K2Node_ComponentBoundEvent_DamagedActor, float K2Node_ComponentBoundEvent_Damage, const struct FGameplayTagContainer& K2Node_ComponentBoundEvent_AllAssetTags, class AActor* K2Node_ComponentBoundEvent_InstigatedBy, class AActor* K2Node_ComponentBoundEvent_DamageCauser, enum class EHexAttackTypeEffectivenes K2Node_ComponentBoundEvent_attackTypeEffectiveness, bool Temp_bool_Has_Been_Initd_Variable, bool CallFunc_IsDead_ReturnValue_2, bool Temp_bool_Has_Been_Initd_Variable_1, bool CallFunc_IsValid_ReturnValue, class UTargetComponent* K2Node_CustomEvent_Target_1, class AActor* K2Node_CustomEvent_Targeter_1, class UTargetComponent* K2Node_CustomEvent_Target, class AActor* K2Node_CustomEvent_Targeter, class AActor* K2Node_Event_instigatorActor, const struct FGameplayTagContainer& K2Node_Event_instigatorTags, bool K2Node_Event_bDeathWasObserved, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsBeingTargeted_ReturnValue, bool CallFunc_BooleanNOR_ReturnValue, bool Temp_bool_IsClosed_Variable, class AController* CallFunc_GetController_ReturnValue, class ABaseAIController* K2Node_DynamicCast_AsBase_AIController, bool K2Node_DynamicCast_bSuccess, enum class EEndPlayReason K2Node_Event_EndPlayReason, bool CallFunc_HasMatchingGameplayTag_ReturnValue, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool K2Node_Event_bEnabled, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_NotEqual_BoolBool_ReturnValue, bool CallFunc_HasMatchingGameplayTag_ReturnValue_1, float K2Node_CustomEvent_newMojo, class AActor* K2Node_CustomEvent_mojoChangeInstigator, class UMojoComponent* CallFunc_GetMojoComponent_ReturnValue, bool Temp_bool_IsClosed_Variable_1, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_5, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue_6, const struct FVector& CallFunc_GetSocketLocation_ReturnValue_1, double CallFunc_Vector_Distance_ReturnValue, class UAbilityAsync_WaitGameplayTagAdded* CallFunc_WaitGameplayTagAddToActor_ReturnValue, bool CallFunc_IsValid_ReturnValue_7, int32 Temp_int_Array_Index_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class ABaseAIController* CallFunc_GetAIController_ReturnValue, bool CallFunc_GetShouldIgnoreSenses_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, double CallFunc_RandomFloatInRange_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UABP_EnemyBase_C* K2Node_DynamicCast_AsABP_Enemy_Base, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_RandomBool_ReturnValue, double CallFunc_SelectFloat_ReturnValue, class UPrimitiveComponent* K2Node_ComponentBoundEvent_spotColliderComponent_1, class UBoxComponent* K2Node_DynamicCast_AsBox_Collision, bool K2Node_DynamicCast_bSuccess_2, class UCapsuleComponent* K2Node_DynamicCast_AsCapsule_Collision, bool K2Node_DynamicCast_bSuccess_3, const struct FVector& CallFunc_GetUnscaledBoxExtent_ReturnValue, float CallFunc_GetUnscaledCapsuleSize_WithoutHemisphere_OutRadius, float CallFunc_GetUnscaledCapsuleSize_WithoutHemisphere_OutHalfHeightWithoutHemisphere, class USphereComponent* K2Node_DynamicCast_AsSphere_Collision, bool K2Node_DynamicCast_bSuccess_4, class UPrimitiveComponent* K2Node_ComponentBoundEvent_spotColliderComponent, float CallFunc_GetUnscaledSphereRadius_ReturnValue, class UAbilityAsync_WaitGameplayTagRemoved* CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue, bool CallFunc_Map_Remove_ReturnValue, bool CallFunc_IsValid_ReturnValue_8, class UNiagaraComponent* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, bool CallFunc_IsValid_ReturnValue_9, class UActorComponent* K2Node_ComponentBoundEvent_Component_1, bool K2Node_ComponentBoundEvent_bReset, class UActorComponent* K2Node_ComponentBoundEvent_Component, bool CallFunc_IsValid_ReturnValue_10, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, class UAbilityAsync_WaitGameplayTagAdded* CallFunc_WaitGameplayTagAddToActor_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_11, float CallFunc_SetVariableFloat_InValue_ImplicitCast, float CallFunc_RetriggerableDelay_Duration_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast, double CallFunc_SelectFloat_B_ImplicitCast, float K2Node_VariableSet_FacialExpression_Blinking_Value_ImplicitCast);
};

}


